{
    "filename": "B--J_3HAbNe.jpg",
    "description": "In a stunning turn of events, Surgeon General Jerome Adams explained in an interview on live XM radio, that the Coronavirus Task Force has, effectively, dumped the Bill Gates/CDC/WHO predictive contagion model, and is now working with the real data.\nHe explained on the Sirius XM’s Breitbart News Dailyhost Alex Marlow, that given the new data, businesses will begin to re-open as early as May, others in June.\nThis runs contrary to the out-and-out fear-mongering of Dr. Fauci and Bill Gates who have made a media tour, threatening the public that businesses may not re-open for six months to a year, or until and unless governments purchase their conveniently patented, big-pharma vaccination.\nAccording to Dr. Adams:\n“What the American people need to know now is we actually have data, and so we’re tracking that data\"\"\"\"\nBefore this about-face, which appears to have come as an order from the Trump administration in  consultation with the findings of Dr. Adams, the task force was working with’predictive models’, which had been created by the Bill Gates dominated WHO and CDC. Dr. Fausti’s control over the CDC has been criticized in the past for its for-profit motive in handling a range of illnesses from HIV to H1NI.\nIn those inflated, ‘fear-based’ models, the deaths of millions worldwide, and hundreds of thousands in America, were touted. These were used as the basis for what many experts have termed a ‘grossly disproportionate response\nthe task force was working with predictive models, frequently criticized because of their tendency to exaggerate the possible effect of the virus on the United States. Models predicting the deaths of millions and hundreds of thousands in America appear to be overblown, as the real-time data is showing the death count much lower.\n\"\"\"\"We're following this data every single day, and we’re giving that data to communities so that they can make informed and intelligent decisions about when and where to reopen,” he said.\n.\n.\n.\n#dontbelievethelies #dontbelievethehype #bigthingshappening #backroundnoise #deepstate #hospital #filmyourhospital #clintons #distraction #hoax #corona #virus #coronavirus #hystaria #media #manipulation #panic #wwg1wga #anon #q",
    "tags": [
        "Qanon",
        "Deep State"
    ],
    "year": "4"
}