{
    "filename": "B--zGPNhdie.jpg",
    "description": "As #PresidentTrump declared that he would leave the process of reopening the economy up to the states (with input from federal officials, of course), the Washington Post was releasing a 'leaked' report outlining a plan drafted by #CDC and FDA that's essentially a guide for local officials about how to go about reopening the economy.\n\nAnd in contrast to the 'guidelines' released by the governors of #California and #Oregon, which seemed to imply that the process of reopening the economy could take as long as the rest of the year, if not longer, the administration plan offers a somewhat more realistic timetable.\n\nThe plan has been seen and discussed by members of the #WhiteHouse #coronavirus task force. But remember, this is only a piece of what is supposed to be a more comprehensive framework that each governor can adjust to their liking. A federal official who spoke on the condition of anonymity with WaPo said the final plan will have 8 parts; this document represents only 2 of them.\n\nThe first part of the phased reopening would focus on schools, daycares and places where \"\"\"\"children are cared for.\"\"\"\" The plan lays out three-phases: Preparing the nation to reopen with a national communication campaign and community readiness assessment until May 1. Then, the effort, through May 15, would involve ramping up manufacturing of testing kits and personal protective equipment and increasing emergency funding. Then staged reopenings would begin, depending on local conditions. The plan does not give specific dates for reopenings but specified \"\"\"\"not before May 1.\"\"\"\" The first priority, according to the CDC response document, is to \"\"\"\"reopen community settings where children are cared for, including K-12 schools, daycares, and locally attended summer camps, to allow the workforce to return to work. Other community settings will follow with careful monitoring for increased transmission that exceeds the public health and health care systems.\"\"\"\" The process of a managed reopening will take much longer than 30 days: in fact, the administration expects there will be \"\"\"\"some level\"\"\"\" of government involvement until a vaccine is finally developed. 🖐🏾More in comments👇🏾",
    "tags": [
        "Other"
    ],
    "year": "4"
}