{
    "filename": "B-8igM4pLpe.jpg",
    "description": "The Elites are doing everything they can to ensure the numbers of this virus are as high as they can get them. With that, let me remind you we're dealing with a virus that has supposedly been responsible for 119,000 deaths in over 5 months. Yet we have shut down nearly every part of the planet and destroyed the global economic system in a matter of weeks time. Meanwhile the flu consistently kills 650,000 and no one panics or practices social distancing, or locks themselves in their homes. Also can I remind you that 2.5 million people have died from starvation since the start of 2020. Starvation kills an average 9 million people every single year, yet the global governments have never done anything to help. If the WHO and the CDC actually cared about health, they would have the media spreading information on how to boost the immune system, instead of having them promote panic and create fear and anxiety. These are all emotions that hinder the immune system, cause irrationality and lower vibrations. For a virus with a 1% mortality rate that has over 97% of it's infected experiencing mild to zero symptoms it would make much more sense to create a society that has strong immune systems. But instead they have poisoned the people in various ways such as GMO, fear, EMF, fluoridated water, chemtrails, attacks on the subconscious mind, etc. Now... Be strong in every way (physically, mentally, spiritually). Be healthy in every way (physically, mentally, spiritually). Take a deep breathe. There is a lot more to this situation than meets the eye. \n#stop5gnow #5gÂ \n#freedomkeepersÂ  #stop5g\n#martiallawÂ  #agenda21 #4biddenknowledge #believemothers  #saveourstate #parentalrights #5gdangers #robertkennedyjr #chemtrails #sosÂ #holistichealth #nongmo #organic #bilderberg #globalelite #financialcollapse #publicserviceannouncement #listenup #wakeupworld #feedfightfreedom",
    "tags": [
        "5G"
    ],
    "year": "4"
}