{
    "filename": "B-97xVFBppU.jpg",
    "description": "#Texas Gov. Greg Abbott on Monday reiterated plans to issue an executive order this week that would kickstart the process of reopening the state’s economy, including guidance for businesses on how to re-open.\n\nHis remarks came after he told reporters Friday he planned to issue an executive order that will “focus on protecting lives while restoring livelihoods.” It will be “about reopening Texas businesses … in a way that will be safe for that economic revitalization,” he said.\n\nLike most states in #America, recent orders in Texas mandate residents mostly stay at home unless they’re taking so-called essential trips, in a bid to slow the spread of the CCP (#ChineseCommunistParty) virus, commonly known as the #novelcoronavirus.\n\nThe governor on Monday said, “impact economically” caused by the #CCPvirus cannot be ignored. “Later this week, I will outline both safe and healthy strategies where we can begin the process of going about reopening businesses in Texas and revitalizing the economy,” he added.\n\nHe highlighted that re-opening the state’s economy does not mean Texas will be given the all-clear. “I have some good news, I will call it glimmers of hope with a whole bunch of red flags attached to those glimmers of hope,” Abbott said, referring to the recent drop in confirmed #COVID19 cases in the state.\n\nConfirmed CCP virus cases in Texas rose to 13,906 on Monday, with 287 deaths. But the growth rate has slowed down after #socialdistancing measures were implemented last month, officials said, while the percentage of cases requiring hospital care has remained steady at around 10 percent of those who test positive.\n\nAn estimated 2,269 COVID-19 patients have recovered, according to the Texas Department of State Health Services.\n\nState officials are in contact with the White House to make sure the new guidelines will follow guidance from the Centers for Disease Control and Prevention, health officials on the White House Coronavirus Task Force, and economic officials like Treasury Secretary Steven Mnuchin. 🖐🏾More in comments👇🏾#GlobalHealthSecurityAgenda",
    "tags": [
        "Other"
    ],
    "year": "4"
}