{
    "filename": "B-9vR-LAG3E.jpg",
    "description": "Responding to a Howard Stern joke about reptilians, Corgan became serious and said, “Not to add to the conspiracy, but I’ve had paranormal experiences in my life that sort of lend itself into that category.” Sounding surprised, Howard Stern encouraged Corgan to open up about the experience. “I’m turning red I’m so embarrassed,” said Corgan, before explaining, “Let’s just say I was with somebody once, and I saw a transformation I can’t explain.” Howard asked, “The person transformed into something other than human?” Corgan responded, “Yes, I saw it. I was totally sober. Imagine you’re doing something, and suddenly you turn around, and there’s somebody else standing there. It’s hard to explain without going into detail, I’d rather not do it.” Corgan said he wasn’t hallucinating or imagining the incident. When he asked the shapeshifting humanoid-reptilian what had happened, the entity acknowledged what had happened.\n\nHoward asked, “What did they say they were, from another planet?” Corgan responded, “They wouldn’t explain. It’s a really messed up story. I’m being vague on purpose. It’s up there with one of the most intense things I’ve ever been through.” The Smashing Pumpkins frontman later explained that he was being vague on air out of fear for his career and the wellbeing of his loved ones. “Demons exist. They are real. They are reptilian. That’s why the Bible says Eve was seduced by a snake. Substitute reptile for snake,” Corgan said, before elaborating about his experience with the record industry-Illuminati.\n\nDescribing the record industry executive who shapeshifted in front of him during a meeting, Corgan said that he “can’t remember the exact words” the reptilian said to him, “but it was something along the lines of: All humans will suffer in unending agony.”\n⬇️⬇️⬇️",
    "tags": [
        "Other"
    ],
    "year": "4"
}