{
    "filename": "B-_CGOdhmmj.jpg",
    "description": "In a new study performed at #IHUMéditerranéeInfection, #Marseille, #France a  cohort of 1061 #COVID19 patients were treated for 3 days with the #Hydroxychloroquine-Azithromycin (HCQ-AZ) combination. A follow-up of at least 9 days was investigated and the study found that no cardiac toxicity was observed. According to the abstract which was recently released: “A good clinical outcome and virological cure was obtained in 973 (out of 1061) patients within 10 days (91.7%)…A poor outcome was observed for 46 patients (4.3 %); 10 were transferred to intensive care units, 5 patients died (0.47%) (74-95 years old) and 31 required 10 days of hospitalization or more…The HCQ-AZ combination, when started immediately after diagnosis, is a safe and efficient treatment for COVID-19, with a mortality rate of 0.5%, in elderly patients. It avoids worsening and clears virus persistence and contagiosity in most cases.” Also, the researchers made this table available.\n\nI came across this information via the Physicians For Informed Consent.\n\nIt’s not clear when the complete study will be made available. But there is another side to this story, Sciencemg  points out that:\n\nThe popular faith in hydroxychloroquine stands in stark contrast to the weakness of the data. Several studies of its efficacy against COVID-19 have delivered an equivocal or negative verdict, and it can have significant side effects, including heart arrhythmias. Raoult’s positive studies have been widely criticized for their limitations and methodological issues. The first included only 42 patients, and Raoult chose who received the drug or a placebo, a no-no in clinical research; the International Society of Antimicrobial Chemotherapy has distanced itself from the paper, published in the society’s International Journal of Antimicrobial Agents. The second study, published as a preprint without peer review, didn’t have a control group at all.\n\nThey go on to mention that:\n\nRaoult has dismissed the criticism and complained about the “dictatorship of the methodologists” who insist on randomization and control groups in clinical trials... 🖐🏾More in comments👇🏾",
    "tags": [
        "Other"
    ],
    "year": "4"
}