{
    "filename": "B-AeZzgnz-w.jpg",
    "description": "Location: WINDSOR CASTLE in 2006, for Prince Andrew’s daughter Beatrice’s 18th birthday; whilst Epstein already had an arrest warrant in America for child-prostitution crimes.\n\nHarvey Weinstein, Jeffrey Epstein, and Ghislaine Maxwell are Prince Andrew’s invited FRIENDS - just like Jimmy Saville was close FRIENDS with the Queen, Prince Philip, Charles, Andrew etc.\nYou see they’re ALL friends, they ALL know each other, because they’re ALL part of the same - deranged - cult focused on satanic ritual abuse events including: paedophilia, murder, cannibalism, necrophilia, dark magic sorcery, and many more depraved behaviours. \nJimmy Saville is NOT the only famous person to commit the type of vile crimes above.\n\nThis is what the secret society network of the elites - at the higher levels - focus upon; the Illuminati is its most well-known cultural reference.\nFollowers worship the Devil and the dark extraterrestrial species and demonic cosmic forces of the satanic structure of the Darkness.\nExistence is a multi-dimensional expansion of consciousness - energy - which is not just the physical third-dimension; the vast majority of the Universe’s dimensions are non-physical and spiritual.\nWithin the vast cosmos are positive and negative forces of consciousness, i.e. the Light and Darkness/ Good and Evil/ Heaven and Hell.\n\nThe high-profile followers of this cult are brainwashed [mind-controlled] into entering it. \nThey undergo dark magic rituals, which disconnect them from morality and their souls, to plug directly in to the very lower depraved consciousness energies - becoming demonically possessed.\nDon’t let their public behaviour fool you - psychopaths, famous or not, go to great lengths to deceive about their true behaviour; like Jimmy Saville did.\n\nWhilst our celebrated rich and famous false idols commit these crimes in the societal shadows, our hierarchical world is predicated on unjustifiable horrors at the top. \nHumanity is a very backward experience - full of tragic events - because these exact people own the world; controlling its means of production to create those events.\n\nThey serve the Eye 👁, holding Earth and Humans hostage.\n✨\n✨\n✨\n✨\n#wakeupworld",
    "tags": [
        "Other"
    ],
    "year": "3"
}