{
    "filename": "B-fHgmWhpnA.jpg",
    "description": "Thoughts?\n\nDr. Anthony S. Fauci says that the #UnitedStates will not come out of lockdown until there are no “new cases” of #coronavirus, prompting some to question precisely how long that will be.\n\nDuring yesterday’s #WhiteHouse briefing, Fauci, who has become the face of #America’s response to the #coronavirus, was asked by a reporter whether social distancing measures will be imposed until there is a drug or vaccine to treat #COVID19. “I think if we get to the part of the curve that Dr. Birx showed yesterday when it goes down to essentially no new cases, no new deaths at a period of time. I think it makes sense that you will have to relax #socialdistancing,” Fauci said. “The one thing we hopefully would have in place, and I believe we will have in place, is a much more robust system to be able to identify someone who was infected, isolate them and then do contact tracing,” he added.\n\nThe prospect of there ever being zero new coronavirus cases appears to be a very long way off, leading some to question if Fauci was asking Americans to adopt social distancing indefinitely, or at least until a vaccine is available. “Fauci said that we can start to “relax” social distancing once there are “no new cases, no deaths.” Is it just me or is that completely batshit insane?” asked Matt Walsh. “That would keep us in a lockdown for many months or years. And if the virus becomes endemic, forever. How can that be the plan?” “No kidding. We would need to assume that any vaccine would be immediately available, 100% effective, 100% of the population has access to it, and 100% of the population takes it,” commented another respondent. “Sounds like they’ll eventually have to keep us “temporarily” locked in our homes. No cars on the road. No people at stores or gas stations, and the national guard will start leaving a box of food on our doorsteps every 3 days. And everyone will be ok with it,” added another.\n\n#Italy is already experiencing looting and #civilunrest as a result of lockdown measures.\n\nExperts have suggested that this could be a massive problem everywhere if authorities attempt to quarantine entire countries for too long.",
    "tags": [
        "Other"
    ],
    "year": "4"
}