{
    "filename": "B-GAAA1h9En.jpg",
    "description": "#Eugenicist #BillGates called for a ‘national tracking system’ similar to #SouthKorea, saying that “in #Seattle, the #UniversityofWashington is providing thousands of tests per day but no one is connected to a national tracking system”\nEvery time I write an article on eugenicist Bill Gates and his desire to control the global population, I always get a visit from the folks over at NewsGuard, the Liberal “fact checking” group financed by Microsoft and embedded in their Edge web browser. The entire agenda of NewsGuard is to promote the Liberal position seen over at fake news MSNBC, while at the same time preventing Christians and Conservatives from having a voice online. Sorry, NewsGuard, we won’t be silenced by you or anyone else. We are in the publishing business, take a look. “That I may publish with the voice of thanksgiving, and tell of all thy wondrous works.” Psalm 26:7 (KJB)\nLast week we told you all about #Event201, if you haven’t read it, stop, and go and read it right now. Today’s article will make much more of an impact on you if you know what Bill Gates and Event 201 is all about. So Bill Gates went on Reddit to participate in a coronavirus #AskMeAnything, and during the course of that Q&A, some pretty astonishing things came out.\nFirst, Bill Gates wants a ‘national tracking system’ to track the spread of the virus, but you can’t track the virus without tracking the people, so what is he really calling for? A national tracking system for people. When you add that to something called #ID2020, you’re off to the end times races. ID2020 calls for, you guessed it, an implantable tracking device that’s tied to a, you guess it again, vaccination.\nThe ID2020 Alliance has launched a new digital identity program at its annual summit in #NewYork, in collaboration with the Government of #Bangladesh, vaccine alliance Gavi, and new partners in government, academia, and humanitarian relief.\nBIG PHARMA AND MICROSOFT ARE TEAMING UP IN SOMETHING CALLED THE ‘ID2020 ALLIANCE’ THAT WILL COMBINE VACCINATIONS WITH IMPLANTABLE MICROCHIPS TO CREATE YOUR DIGITAL ID 🖐🏾More in comments👇🏾#MarkOfTheBeast #Technocracy #SocialEngineering",
    "tags": [
        "Bill Gates"
    ],
    "year": "3"
}