{
    "filename": "B-gUe6QFtyF.jpg",
    "description": "Four #Christian professional #athletes are #encouraging #Americans to use the downtime presented to them by #coronavirus lockdowns to grow closer to #God and be intentional about strengthening their #family units. \nRecently retired National Football League tight end Benjamin Watson moderated the inaugural episode of the Fellowship of Christian Athletes “Huddle Up!” YouTube series sponsored by Pro Athletes Outreach last Friday. \nThe 37-minute discussion also featured retired #NFL quarterback Luke McCown, #LosAngelesRams star receiver Brandin Cooks, and #StLouisCardinals #allstar pitcher Adam Wainwright talking about how they are using the unexpected downtime to grow in their faith. “As #Christians, we are called to be the light,” Wainwright, who is also leading a one-year online #Bible study for over 16,000 Twitter followers, said. “In this time, there is a lot of negativity around. This is time that we can spend encouraging others to make us look different.”\nAs the coronavirus #pandemic has shut down the sports world for the time being and many states and countries have issued stay-at-home orders, the panelists each spoke about how they are using this time to better their relationship with #spouse, their #children and the #Lord. \nMcCown, a Louisiana Tech standout who played 10 seasons primarily as a backup quarterback with five different NFL teams, stressed that it's important to realize that God either allowed or ordained this pandemic to happen. “This is intentional. God doesn’t do anything by accident, even all the things that you read about in Job,” McCown, 38, contended. “God either ordains or allows every circumstance or situation. He ordains it, meaning that He makes it happen. Or He allows it; He gives #permission for it to happen. This is just one of those things.”\n“I can’t help but think that we have gotten so busy in our lives, whether it's just going from #ballgame to ballgame or ball practice to ball practice or [taking] the kids to dance recitals and this and that and the other, that there is an element that we are missing.” McCown, a father of six, then referenced something he heard California megachurch pastor Greg Laurie say a few weeks 👇🏼",
    "tags": [
        "Other"
    ],
    "year": "4"
}