{
    "filename": "B-h4awGnU6H.jpg",
    "description": "Hey friends. I’m Rachael. This feels like a big deep breath and a wave to everyone else sailing by. I don’t want to just post whatever for the sake of likes or engagement— been waiting for the time to take care. Waiting for that peace & focused time. It’s scarce. I don’t want to always be scarce or quiet, waiting to say everything, because there’s almost too much on my heart to condense into one post, sooo if I open the floodgates bit by bit, it’ll come easier. 🌊\nBeen quite a while since I took the time to write a caption — IG has frozen the past two times I poured my heart out — and I almost never have time to focus for more than 5-10 min on anything. Nursing a teething toddler round the clock. I have her and a 3 year old, both with big energy levels who rarely nap. They keep me pouring out 24/7 for sure 😅😅\nMy worship pastor husband @rockthesales and I recently got a home on wheels we’re renovating to move into full-time in the next 2~ weeks. 🚐\nGot some health things — chemical & mold toxicity due to current rental — hence the move soon.\nBut in spite of the crazy day-to-day, and the chaotic world outside, we’re taking this time as a family to REST and draw nearer to Yeshua with our prayer and constant worship.\n—\nThese days may seem like the whole world is out of sorts — which they are, and like with any virus, it’s signifying a deeper cleanse going on globally. I don’t know the full scope, but I will say —\nYahweh’s drawing us nearer to His heart, up out of the previous captivities and idolatry, into REVIVAL. I’m giddy with excitement to think of all He’s doing in each of our hearts — stirring, awakening, convicting, pruning, cleansing, refining — sparking a new era of Church from a FAMILY level.\n—\nI’ll save other thoughts for later, but .....! If you’ve read this far, tell me a little about you and why did you decide to follow along?",
    "tags": [
        "Other"
    ],
    "year": "4"
}