{
    "filename": "B-hhbMjhQQW.jpg",
    "description": "The #UnitedNations is demanding sovereign nations pay the equivalent of at least 10% of the annual income of the entire planet to a new “fund” announced by Secretary-General António Guterres that will hold approximately $8.7 trillion USD, an unprecedented amount of money that would be 2,900 times greater than the UN’s annual budget.\nUN Secretary-General Guterres announced the creation of the fund for addressing the global #coronavirus pandemic, described as a massive “human-centered, innovative and coordinated stimulus package,” which would effectively create a new world superpower, with the global agency, presumably the UN itself, in charge of propping up the economies of sovereign nations during the crisis.\nAlthough Guterres doesn’t state it explicitly, he seems to be connecting the new fund, which he calls a “dedicated #COVID19 Response and Recovery Fund,” with the massive stimulus package plan, announcing both measures in the same press release.\nLifeSiteNews reports: Guterres also wants 100 billion USD for the #WorldHealthOrganization, whose president has been blamed for helping to cause the coronavirus pandemic by repeating in January the #Chinese government’s false claim that COVID-19 is not transmissible to humans.\nHe also wants the same organization to build an “interconnected Global Health Emergency System for data, workforce, and supplies.” Guterres says that the money would be channeled “not only to the business sector and lead firms, but to the workers and SMEs worldwide that underpin the global economy.” “It is not enough to protect major businesses: we need to protect their suppliers, and the global consumer demand – the household income – that will usher the global economy back to life,” writes Guterres in his report, called “Shared responsibility, global solidarity: Responding to the socio-economic impacts of COVID-19.” 🖐🏾More in comments👇🏾#SocioEconomicReformation #Technocracy #Event201 #GlobalHealthSecurityAgenda",
    "tags": [
        "Bill Gates"
    ],
    "year": "4"
}