{
    "filename": "B-IrixeBMbM.jpg",
    "description": "#ThePentagon is assuming the #coronavirus epidemic in the #UnitedStates will last at least several months, and that some countries are at risk of \"\"\"\"\"\"\"\"political chaos,\"\"\"\"\"\"\"\" its top officials said Tuesday. \"\"\"\"\"\"\"\"I think we need to plan for this to be a few months long at least,\"\"\"\"\"\"\"\" US Defense Secretary Mark Esper said, judging from the experience of countries like #China, #SouthKorea and #HongKong.\nEsper and General Mark Milley, the chairman of the Joint Chiefs of Staff, addressed questions from members of the US military around the world in a virtual online event.\nThe questions were submitted in advance and read to the #Pentagon's top two civilian and military leaders by a department official.\nMilley said all indications are that the US is looking at \"\"\"\"\"\"\"\"eight to 10, maybe 12 weeks, something like three months.\"\"\"\"\"\"\"\" \"\"\"\"\"\"\"\"That may or may not apply to the United States. It may or may not apply to all the different countries, different circumstances. But we'll see,\"\"\"\"\"\"\"\" he said. \"\"\"\"\"\"\"\"If it does apply, you're looking at probably late May, June, something in that range. Maybe it could be as late as July, something like that. But we will get through it,\"\"\"\"\"\"\"\" he added.\nThe two men warned that the pandemic could destabilize some countries, to the point where they could present a threat to the United States.\nThe pandemic \"\"\"\"\"\"\"\"could lead in some cases... to sort of breakdowns. It could lead to political chaos in certain countries. We have to be attuned to that,\"\"\"\"\"\"\"\" Milley said.\nHe noted that shortages of masks, gloves and respirators could have \"\"\"\"\"\"\"\"severe internal consequences to certain countries that go well beyond the immediate medical issues.\"\"\"\"\"\"\"\" The US will aid its allies, said Esper, but \"\"\"\"\"\"\"\"with potential adversaries or adversaries (the coronavirus) may cause them to act out in different ways, in ways that impact our security posture, our readiness.\"\"\"\"\"\"\"\" \"\"\"\"\"\"\"\"So we need to be very conscious and be on the lookout for that as this unfolds,\"\"\"\"\"\"\"\" he said. #Event201 #GlobalHealthSecurityAgenda #OperationGothamShield #ThunderstormSpiral #Agenda21 #Agenda2030 #ScientificDictatorship #Technocracy",
    "tags": [
        "Bill Gates"
    ],
    "year": "3"
}