{
    "filename": "B-KsDmyn174.jpg",
    "description": "Is Jared The Antichrist? *Part 2*\n\nHere's where it's going to get real interesting..\n-\nSo Jared Kushner has two jobs at the White House. Senior Advisor to the President & head to the White House Office of American Innovation. Kushner hired publicist Josh Raffel, who worked for Blumhouse Productions. Blumhouse Productions produced films like Paranormal Activity, Get out & The Purge. Doesn't it seem odd that Jared put movie producer, Josh Rafeel in charge of running communications for the Office of American Innovation? Oh wait! But now it's starting to make sense! He helped produce the movie \"\"The Purge - Keep America Great\"\", the same slogan Trump is using for the 2020 presidential bid.\n\nThe theme behind The Purge is that America is great again, because the population has diminished, & it has diminished because people are allowed one night per year to murder other people legally & all emergency services are deliberately suspended to facilitate the purge.\n\nDo I believe Jared Kushner is the antichrist? I don't know. But he is a good candidate for it.\nRegarding President Donald Trump being on our side or not... Christians, we should take heed, continue praying & watching. While I am considering that Trump has to rely on government agencies & appointed officials, many of whom are still in place since Obama left. The Luciferian Liberals, Democrats, are all over the place & still oppressing conservatives from different factions of government....\nWhat really bothers me is that Trump has Jared so close to him when it couldn't be anymore obvious that Jared is a heartless man. (Watch Netflix documentary Dirty Money, Episode 3 Slumlord Millionaire) -\n-\nJesus says to the saints of the last days, “I know your works, tribulation and poverty (but you are rich) and I know the blasphemy of those who say they are Jews, and are not, but are a synagogue of satan” Revelation 2:9.\n-\n“Indeed, I will make those of the synagogue of satan, who say they are Jews and are not, but lie – indeed, I will make them come and worship before your feet and to know that I have loved you” Revelation 3:9.\n\n#youcantstopthetruth #antichrist #endtimes #thepurge #keepamericagreat #wakeupsheeple #stayvigilant",
    "tags": [
        "Other"
    ],
    "year": "3"
}