{
    "filename": "B-M3cPQB2lX.jpg",
    "description": "Former #British Prime Minister Gordon Brown has called on world leaders to create a new order by forming a “temporary” #globalgovernment to tackle the medical and economic crises caused by the #Covid19 pandemic.\nAccording to Brown, the global government is necessary to make sure the efforts of central banks are coordinated.\nThe leftist former prime minister, who was in power during the near-meltdown of the banks in 2008, said there is an urgent need for a taskforce involving world leaders, health experts and the heads of international organizations that must assume “executive powers” to coordinate the response to the “emergency” on a global scale. “This is not something that can be dealt with in one country,” he said. “There has to be a coordinated global response.” Brown said the #coronavirus crisis is different to the 2008 financial crisis and requires a more #draconian and #internationalist approach. “That was an economic problem that had economic causes and had an economic solution. “This is first and foremost a medical emergency and there has to be joint action to deal with that. But the more you intervene to deal with the medical emergency, the more you put economies at risk.” Former British PM Gordon Brown has called for a global government to tackle COVID-19, arguing that it should be clear to world leaders that there is no possibility of a go-it-alone approach working.\nGuardian report:\nBrown said his proposed global taskforce would fight the crisis on two fronts. There would need to be a coordinated effort to find a vaccine, and to organise production, purchasing and prevent profiteering.\nMany countries have announced economic packages in the past two weeks but Brown said a taskforce could: make sure the efforts of central banks were coordinated; take steps to prevent the record flight of capital from emerging market economies; and agree a joint approach to the use of government spending to boost growth. 🖐🏾More in comments👇🏾#Event201 #GlobalHealthSecurityAgenda #Technocracy #ScientificDictatorship #Agenda21 #Agenda2030",
    "tags": [
        "Bill Gates"
    ],
    "year": "3"
}