{
    "filename": "B-moqsOlSRH.jpg",
    "description": "😷So far, I've learned a lot. I've learned that if I put duoderm under my eyes the goggles are less likely to bruise.\nI've learned that I tend to get claustrophobic and sweaty at about the 30 minute mark, but that it's normal, & if I slow my breathing I can calm myself & keep going. \nI've learned that if we start intubating patients with Covid-19 at 6L nasal cannula, at 5 litres it's already hard for patients to talk, so I need to find out if they have pets at home when they are at 4 liters, just in case we need to find someone go to their home & rescue/feed the pets if they live alone, since it's possible that the patient will be on a ventilator for at 2 weeks+. I've learned that no matter how many times I've donned/doffed my PPE I study the chart on the door concerned that one wrong move can put myself, my family or co workers at risk for exposure.\nI've learned to master clustering my care to maximize my time at the bedside/minimize PPE changes.\nI've learned that the call light is my best friend when I am in the patient room & need additional supplies (we don't have vocera).\nI've learned that the bottom of the gown we wear worries me, since it's loose & the aeresolized particles can live on surfaces. \nI've learned that on my days off I stuggle to sleep at night worrying about colleagues at work on shift. \nI've learned that if the patient has that (almost constant \"\"\"\"Covid cough\"\"\"\") & hospital policy will allow it, put a mask on the patient while performing care, because the cough aerosolizes, & most policies do not account for that as an aerosolization requiring an n95. This isn't a perfect fix, but it's at least an additional barrier... I've learned that calling my patient's family and having them tell my patient good night/ talk strong to them on speaker, even if the patient can't respond, makes the family feel connected & less anxious.\nI've learned that I can have real nightmares about improprly doffing my PPE.\nI've learned that frontline nurses are some of the bravest people I have ever met. 🙌🏻\n@nurse.tami @shesinscrubs @traumacam @jrey_rn @cherokeeuniforms #covid19update #covid19 #medical #covidfighter #healthcareheroes",
    "tags": [
        "Other"
    ],
    "year": "4"
}