{
    "filename": "B-nP7KNnpgc.jpg",
    "description": "In Oct\n-\nThoughts?\n\nNot long before #Chinese coronavirus started making global headlines, The #JohnsHopkins Center for Health Security, in partnership with the #WorldEconomicForum and the #BillandMelindaGatesFoundation, held a high-level pandemic exercise called “#Event201” that seems to have been a predictive blueprint for what’s now transpiring with the #coronavirus outbreak.\n\nOn October 18, 2019, representatives from each of the aforementioned groups descended on #NewYorkCity to discuss how they would respond to “a severe pandemic” much like the one we’re now being told is spreading across China and into the West.\n\nThe exercise “illustrated areas where public / private partnerships will be necessary during the response to a severe pandemic in order to diminish large-scale economic and societal consequences,” an official announcement from Event 201 reads. “In recent years, the world has seen a growing number of epidemic events, amounting to approximately 200 events annually,” the announcement goes on to explain. “These events are increasing, and they are disruptive to health, economies, and society.” According to the event’s organizers, a pandemic like the one we could be seeing form right now before our very eyes requires “cooperation” among governments, industries, and “key international institutions” – the latter presumably referring to organizations like the Bill and Melinda Gates Foundation.\n\nIs coronavirus yet another ploy to thin the “herd” and sell more vaccines?\n\nThe timing of Event 201 is nothing short of suspicious in light of the fact that coronavirus is all the media is talking about right now. It’s even eclipsing President Trump’s impeachment proceedings in the Senate, with news about entire cities in China that are home to tens of millions of people being put under mandatory quarantine.\n\nWe’re also seeing headlines about coronavirus popping up in major U.S. cities like Seattle, Houston and Chicago, which is starting to generate panic here in our own country about how far this thing will go before either fizzling out – a best-case scenario – or spreading like wildfire. #GlobalHealthSecurityAgenda\n♻️ @freedom_faction",
    "tags": [
        "Bill Gates"
    ],
    "year": "4"
}