{
    "filename": "B-pNGy5F3fw.jpg",
    "description": "Reposted from @real__analysis_ read full and give a double tap-\nWuhan businessman Fang Bin began posting videos about the outbreak to \"\"\"\"report on the actual situation here\"\"\"\", promising to \"\"\"\"do his best\"\"\"\" in the reporting.\n\nHe uploaded his first video on 25 January to YouTube, which is banned in China but accessible through virtual private networks (VPN).\nHis first few videos - mostly featuring him driving around the city and showing the situation in different places - managed slightly more than 1,000 views.\n\nThen on 1 February he filmed a video which got people to sit up and take notice. The clip, which has been viewed almost 200,000 times, appears to show eight corpses piled in a minibus outside a hospital in Wuhan.\n\nFang alleges that police barged into his home on that same night and interrogated him about his videos. He was taken away, warned, but eventually released.\n\nBut on 9 February, he posted a 13-second video with the words \"\"\"\"all people revolt - hand the power of the government back to the people\"\"\"\". After that, the account went silent.\nChen, a former human rights lawyer turned video journalist, was already relatively well known in the activist space. He built his reputation through his coverage of the Hong Kong protests last August.\n\nThat coverage, he later alleged, led to him being harassed and ultimately muzzled by Chinese authorities following his return to the mainland. His Chinese social media accounts, which reportedly had a following of more than 700,000, were deleted.\n\nBut he could not be kept quiet.\nIn October, he created a YouTube account which now has some 400,000 subscribers. He also has over 265,000 followers on Twitter.\n\nIn late January he decided to travel to Wuhan to report on the worsening situation. after his reporting he never seen again.\n\nfollow for more information-\n@real__analysis_\n#conspiracytheorist #conspiracy#conspiracytheory #conspiracytheories#conspiracies #conspiracyfact #conspiracyfiles#theory #theories #theoryconspiracy#unsolvedmysteries #mysteries #mystery#scarystories #creepystories #creepystory#scaryfact #scaryfacts #creepyfact#creepyfacts #unknownfact #creepy #spooky#unknown #horrify",
    "tags": [
        "Other"
    ],
    "year": "4"
}