{
    "filename": "B-pWUQ2BWA_.jpg",
    "description": "Thoughts?\nA doctor in #LosAngeles is reporting remarkable success in treating #COVID19 patients with a combination of #zinc and the Trump-touted anti-malarial drug #hydroxychloroquine.\nDr. Anthony Cardillo, an ER specialist and the CEO of #MendUrgentCare, has been prescribing the combination of drugs to patients experiencing severe symptoms of the disease after contracting the novel #coronavirus. \"\"\"\"\"\"\"\"Every patient I've prescribed it to has been very, very ill and within 8 to 12 hours, they were basically symptom-free,\"\"\"\"\"\"\"\" Cardillo said in an interview Sunday with KABC-TV. \"\"\"\"\"\"\"\"So, clinically I am seeing a resolution.\"\"\"\"\"\"\"\" He added that combining the drug with zinc has been the key to the success. The hydroxychloroquine, he said, \"\"\"\"\"\"\"\"opens the zinc channel\"\"\"\"\"\"\"\" allowing the zinc to enter the cell, which then \"\"\"\"\"\"\"\"blocks the replication of cellular machinery.\"\"\"\"\"\"\"\" Cardillo was careful to note that the drug should only be prescribed for patients who are extremely sick and in urgent need so as to not blow through the limited supply of the drug, which is used to treat other illnesses, as well. \"\"\"\"\"\"\"\"We have to be cautious and mindful that we don't prescribe it for patients who have COVID who are well,\"\"\"\"\"\"\"\" he said. \"\"\"\"\"\"\"\"It should be reserved for people who are really sick, in the hospital or at home very sick, who need that medication. Otherwise we're going to blow through our supply for patients that take it regularly for other disease processes.\"\"\"\"\"\"\"\" The U.S. Food and Drug Administration fast-tracked hydroxychloroquine and chloroquine for the treatment of COVID-19 late last month after three separate studies showed the pair of anti-malaria drugs to be a potentially promising remedy against the infectious disease.\n#PresidentTrump has been optimistic about hydroxychloroquine's efficacy against the virus despite warnings from some health officials, including Dr. Anthony Fauci who sits on the White House coronavirus task force, that evidence of its effectiveness is anecdotal.\nRead More: [https://www.theblaze.com/news/la-doctor-hydroxychloroquine-zinc-coronavirus] #Event201 #GlobalHealthSecurityAgenda",
    "tags": [
        "Bill Gates"
    ],
    "year": "4"
}