{
    "filename": "B-qn1K6DDrw.jpg",
    "description": "⁣⁣\nMY PAGE LIKES ARE GOING DOWN, BUT THAT’S OKAY.⁣⁣\n⁣⁣\n(The ones on my facebook business page.)⁣⁣\n⁣\nLook what has been revealed! I posted this last friday on my facebook page. Since then they have mentioned the underground tunnels and human trafficking! The truth is revealing itself slowly, but surely👍⁣\n⁣\nThis is what I wrote...⁣\n⁣⁣\nMy page is about coming into WHOLENESS through self-LOVE.⁣⁣\n⁣⁣\nHowever, love DOESN’T end with us. As we love and respect ourselves, we won’t be able to look away when someone else suffers, especially innocent children💜👼💜⁣⁣\n⁣⁣\nThis isn’t anything political either. This is about humanity. Our lives as ONE.⁣⁣\n⁣⁣\nI share my beliefs with you guys. Just take what resonates with you☺️⁣⁣\n⁣⁣\nThis has been heavy on my heart the past few weeks...⁣⁣\n⁣⁣\nThousands of children are being rescued from slavery, abuse and torture. Some will have never seen sunlight😞⁣⁣\n⁣⁣\nThe big white ships are sent out to aid in their rescue... called MERCY and COMFORT🙏⁣⁣\n⁣⁣\nI don’t know how they can heal from what they experienced, but all my LOVE goes out to them.⁣⁣\n⁣⁣\nMillions have been victim to human trafficking in underground tunnels (there are maps you can find about this).⁣⁣\n⁣⁣\nIt’s a worldwide problem. And if it takes this lockdown to do all this work, I honor staying at home.⁣⁣\n⁣⁣\nThe U.S. military, Trump and others involved are helping with this rescue.⁣⁣\n⁣⁣\nAs much DARKNESS there is in this world, there is just as much LIGHT💜💜💜",
    "tags": [
        "Other"
    ],
    "year": "4"
}