{
    "filename": "B-vdK8Ih4f0.jpg",
    "description": "Thoughts?\n\nIn a recent press conference, Donald Trump stated that the coronavirus was an “artificially induced” virus. Obviously, his comments are open to interpretation, and we’ve seen nothing but the ridicule of Donald Trump from mainstream media news sources since he took office. As a result, it’s hard for many people who tune in to these networks and use them as regular sources of information to take anything that he says seriously, at all. But Trump is not alone in his thoughts, that being said, again, it’s hard to really know exactly what he meant. This does not mean that we “support” Trump. In fact, the entire idea that someone who we supposedly elect can make any significant change on this planet is odd. We seem to put our power and faith into one person instead of realizing that we, humanity, ourselves, together, as one are the real solution. Electing and looking to one person for change seems to take the power away from ourselves, and place it into another.\n\nEarlier on in the pandemic, Trump referred to the virus as a “hoax.” I thought when he stated that  he meant it was created and released, intelligently, for multiple purposes. The media took his statements as him implying that the virus itself is not real, and that there is no issue. He then explained that he meant that certain people are simply trying to politicize the issue, and use the crises to their advantage. Specifically, the Democrats.\n\nWhen it comes to the new coronavirus, we are seeing a massive censorship of opinion. Dr. Ron Paul, for example, had his opinion article on the coronavirus flagged as “fake news.” When I saw this, I was curious as to how someone’s opinion can be ‘fake’ at all? In his article, he was encouraging people to ask themselves  whether this coronavirus “pandemic” could be a big hoax, with  regards to the actual danger of the disease massively exaggerated by those who seek to profit – financially or politically – from the ensuing panic. He emphasized his statements were not to say the disease is harmless... 🖐🏾More in comments👇🏾",
    "tags": [
        "Other"
    ],
    "year": "4"
}