{
    "filename": "B-Vl_eIDqn4.jpg",
    "description": "“Military men are just dumb, stupid animals to be used as pawns in foreign policy.” -Henry Kissinger, former U.S. Secretary of State & National Security Adviser •\nThe military oath of enlistment (re-enlistment) is fairly straightforward for most military personnel. It's administered by a superior officer, & carried out like most traditional oaths, with the officer reading the oath & the person being sworn repeating it.\n“I, (NAME), do solemnly swear (or affirm) that I will support & defend the Constitution of the United States against all enemies, FOREIGN & DOMESTIC; that I will bear true faith & allegiance to the same; & that I will obey the orders of the President of the United States & the orders of the officers appointed over me, according to regulations & the Uniform Code of Military Justice. So help me God.” •\nThe Bill of Rights is the first 10 Amendments to the Constitution. It spells out Americans’ rights in relation to their government. •\nIt guarantees civil rights and liberties to the individual—like freedom of speech, press, and religion. •\nIt sets rules for due process of law and reserves all powers not delegated to the Federal Government to the people or the States. •\nAnd it specifies that “the enumeration in the Constitution, of certain rights, shall not be construed to deny or disparage others retained by the people.”\n•\nThe First Amendment provides several rights protections: to express ideas through speech and the press, to assemble or gather with a group to protest or for other reasons, & to ask the government to fix problems. It also protects the right to religious beliefs and practices. It prevents the government from creating or favoring a religion. •\nThe Second Amendment protects the right to keep and bear arms. •\nThe Third Amendment prevents government from forcing homeowners to allow soldiers to use their homes. Before the Revolutionary War, laws gave British soldiers the right to take over private homes. •\nThe Fourth Amendment bars the government from unreasonable search & seizure of an individual or their private property. •\nThe Fifth Amendment provides several protections for people accused of crimes.\nCont’d👇🏽",
    "tags": [
        "Other"
    ],
    "year": "3"
}