{
    "filename": "B-x79nsFVPn.jpg",
    "description": "BEWARE WHEN YOU NOTICE ALL THESE IN YOUR LIFE.\n1. Beware! When prayer becomes a difficult thing for you.\n2. Beware! When fasting is becoming a history in your spiritual\ntimetable.\n3. Beware! When you no longer enjoy reading the word of God.\n4. Beware! When attending church programme is becoming a\nburden rather than a blessing for you.\n5. Beware! When living a life of holiness is appearing like\nextremism.\n6. Beware! When sinful living becomes a lifestyle in the name of\ngrace.\n7. Beware! When you crave for earthly things rather than the things\nof God.\n8. Beware! When waking up in the night to pray is becoming a\nthing of the past.\n9. Beware! brethren, when your heart no longer desires to see the\nLord Jesus one day.\n10. Beware! when you eat more than pray\n11. Beware! when you no longer share the word with others.\n12. Beware! When u start diluting the preaching Word of God to\nkeep people around you.\n13. Beware! of all these, brethren, Satan isn't resting. We too must\nbe vigilant.\n14. Beware! When you spend more time on Facebook, whatsapp,\ntwitter, and internet. These things become idols and take the place\nof God.\nPerhaps you're not even interested in the contents\nLets prepare, Jesus is coming soon to take those who are eagerly\nwaiting for him.\nPLEASE DON'T LET SHARING THIS BECOME A BURDEN\nLET US ALL BE CONSCIOUS OF THE LAST DAYS.\n Revival Lord, help us to fear and obey U 🙏\nI cry for revival and restoration Lord...\nMercy O Lord, Mercy Jesus!!!\nYou are Loved... That's the reason for this Message...! Follow my page...for further  counsel and direction keep in touch.\n⛪️\n🦁\n⛪️\n🦁\n⛪️\n🦁\n@lionofjudah_christianity\n#God #Jesus #LionOfJudah #Christianity #JesusChrist #Church #Bible #Love #Scripture #Rapture #EndTimes #Prophecy \n#Yahweh #Yeshua #Messiah #2ndComing\n#MarriageSupperOfTheLamb #Tribulation\n#Revelation #MarkoftheBeast",
    "tags": [
        "Other"
    ],
    "year": "4"
}