{
    "filename": "B-xBcy8ntXa.jpg",
    "description": "I find it incredibly pathetic how people are so quick to use the term #ConspiracyTheorist when they simply can't refute something and instead of admitting they are clueless about the subject and maybe actually going and researching it for themselves, they go on to name call like toddlers in attempt to discredit the person or message.\n.\nBY FAR, the average person in the world does absolutely no independent research on any given subject and simply believes whatever the mainstream or \"\"authority\"\" tells them without question or concern because they're too busy watching tv, playing videogames or keeping up with the kardashians to care about anything going on in THE REAL WORLD.\n.\nThese people then go on to parrot information that they hear from celebrities and politicians(because when all you do is watch tv these are your idols) without ever formulating their own opinions based on independent research and simply jump on bandwagons out of emotional reaction and sensationalism creating and fueling the dreaded #HerdMentality 🐑\n.\nNow combine that dynamic with the fact that any information that goes against said mainstream and \"\"authority\"\" is now being censored and labeled as #falseinformation or #conspiracytheory which only goes to prove the point that much of what is being branded as #conspiracytheories is in all actuality the truth of what is going on beyond the illusions and deception broadcasted by the TELL-LIE-VISON if people would only \"\"go down the rabbit hole.\"\"\n.\nI feel the biggest barrier to people actually figuring out what is going on in the the world, ie government, corporation & economic corruption; is that they want to maintain a fantasy of what they believe to be true irregardless of how much proof or evidence indicates otherwise because of the egocentric worldview that most people, especially in the western world, maintain as well as the entitled attitude that comes along with it which creates this \"\"I want to feel good and anything that doesn't make me feel good I'll push away and ignore\"\" mentality that is a plague in the first world.\n.\nThe positive side of everyone being on house arrest and having all their rights taken away in the name of this \"\"pandemic\"\"⬇⬇",
    "tags": [
        "Other"
    ],
    "year": "4"
}