{
    "filename": "B-yFVg2lTLp.jpg",
    "description": "A nursing home in Kirkland, #Washington was #groundzero for the initial deadly spread of the #Coronavirus in the U.S., but one of its older residents felt #God #heal her as she hovered #neardeath.\nThe Life Care Center facility in Kirkland became the source of the first major outbreak of #COVID19, with 101 of its senior residents #diagnosed with the potentially deadly #pestilence and 34 ultimately succumbing.\nOne of its residents, Geneva Wood, 90, had spent several months there recovering from a #stroke. Only a few days before she was to return home, the #disease struck many within its walls and the administrators placed the residents on #lockdown.\nA few days later, Wood began to feel #feverish. “I didn’t know that I had the virus until I had the #virus. I had no #symptoms of it before,” Wood told CBN.\nWood credits God for her #survival. “If it hadn’t have been for my #faith in God and my #family and their #prayers and all their families and the church and everything…the faith and prayers pulled me through,” Wood explained.\nEven while she was alone, in isolation, she felt God with her. On one particular dark night she thought she was #dying.\n“I could feel #Godspresence. His hands were on my body and I could feel His #presence and I’d wake up and I could feel these hands and I’d go back to sleep. Through the night, ’cause I’d wake up, I couldn’t see His face, but I could feel His hands and I knew He was with me and I made it through the night,” Wood told CBN.\nThe hands of #Jesus brought #healing, just as they did in the pages of the New Testament. “Until you’ve felt God’s presence and his hands on you, it’s something else. If it hadn’t have been for Him, I couldn’t have done it. And I wasn’t alone because He was with me all the time,” she continued.\nOne doctor at the facility brought her a #Bible and spent time reading her favorite #scriptures. “At first all I said was Psalm 23, but he would read to me every morning,” she told CBN.\nWood’s family called her turnaround “#miraculous.”\nAs the Jewish people gather around the world to celebrate #Passover tomorrow, it is worth considering that God sheltered Geneva Wood in his arms from the deadly plague, just as he 👇🏼",
    "tags": [
        "Other"
    ],
    "year": "4"
}