{
    "filename": "B-YUNpzh_eE.jpg",
    "description": "The Department of Defense (DoD) announced a grim milestone Monday — it's total number of #COVID19 cases among US service members, civilian contractors, on-base civilian staff, and family dependents of troops has surpassed 1,000. “Total DoD Cases (current, recovered and deaths) is 1,087,” according to DoD fact sheet released on Monday. The numbers are as follow: • 569 military cases • 220 civilian cases • 190 dependent cases • 64 contractor cases\n\n#ThePentagon said 569 service members have been infected, among these 26 hospitalizations, and 34 have recovered.\n\nThe remainder of total cases involve civilian contractors working on military bases and/or at the Pentagon, as well as dependents. This number is up significantly from Friday's total DoD number of 600.\n\nBut it appears we are fast heading toward a near total reporting blockage in terms of DoD-wide cases, and specifically where they originate, and in what branches of the US armed services. As Stars & Stripes reports:\n\nThe Defense Department has ordered commanders at all of its installations worldwide to stop announcing publicly new coronavirus cases among their personnel, as the Pentagon said Monday that more than 1,000 U.S. military-linked people had been sickened by the virus.\n\nThe order issued by Defense Secretary Mark Esper on Friday is meant to protect operational security at the Defense Department’s global installations, Jonathan Hoffman, the Pentagon’s chief spokesman, said in a statement Monday. He said Defense Department leaders worried adversaries could exploit such information, especially if the data showed the outbreak impacted U.S. nuclear forces or other critical units.\n\nThis constitutes perhaps the clearest admission thus far throughout the crisis that the #coronavirus pandemic is a serious threat to US defense readiness and national security.\n\nCurrently at least two aircraft carriers are battling outbreaks in their midst - both are in the Pacific Ocean and likely have seen their operational readiness deeply compromised as commanders try to contain the spread, with the #USSTheodoreRoosevelt already being diverted to #Guam days ago.",
    "tags": [
        "Other"
    ],
    "year": "3"
}