{
    "filename": "B-Zs7uuB7SV.jpg",
    "description": "#YaleUniversity pandemic expert Frank Snowden has declared that “#globalization” led to the #coronavirus spreading rapidly around the world from #China, where the deadly virus originated.\nSnowden, a pandemic historian, argues that the #Chinese coronavirus “is emphatically a disease of globalization.” In a recent interview with the Wall Street Journal, Snowden outlines how the #coronaviruspandemic is threatening the #globalist worldview of free movement of people and free trade.\nThe interview finds the Journal‘s Jason Willick seemingly admit that the coronavirus is tainting #globalism.\nWillick writes:\nYet while the [bubonic] plague saw power move up from villages and city-states to national capitals, the coronavirus is encouraging a devolution of authority from supranational units to the nation-state. \nThis is most obvious in the #EuropeanUnion, where member states are setting their own responses. \nOpen borders within the EU have been closed, and some countries have restricted export of medical supplies.\nThe virus has heightened tensions between the U.S. and China, as #Beijing tries to protect its image and Americans worry about access to medical supply chains. [Emphasis added]\nBreitbart.com reports: Snowden told the Journal the coronavirus is a direct result of the globalization of the #American economy after nearly four decades of free trade policy initiatives:\nThe coronavirus is threatening “the economic and political sinews of globalization, and causing them to unravel to a certain degree,” Mr. Snowden says. He notes that “coronavirus is emphatically a disease of globalization.” The virus is striking hardest in cities that are “densely populated and linked by rapid air travel, by movements of tourists, of refugees, all kinds of business people, all kinds of interlocking networks.” [Emphasis added]\nGlobalization, Snowden notes, has driven the coronavirus to majorly impact the wealthiest of Americans. 🖐🏾More in comments👇🏾#Event201 #GlobalHealthSecurityAgenda",
    "tags": [
        "Bill Gates"
    ],
    "year": "3"
}