{
    "filename": "B-zY20thVnT.jpg",
    "description": "Thoughts?\nAttorney General William Barr says he is “very concerned” about the draconian ‘Digital Vaccine Certificates‘ plan being pushed by Bill Gates in response to the #coronavirus pandemic.\nIn an interview Wednesday with Fox News’s Laura Ingraham, Barr assured that the federal government is “keeping an eye” on the temporary restrictions imposed by state and local governments during the outbreak, and warned that officials should be “very careful to make sure that the #draconian measures that are being adopted are fully justified.” “When this period of time, at the end of April, expires, I think we have to allow people to adapt more than we have, and not just tell people to go home and hide under their bed, but allow them to use other ways — social distancing and other means — to protect themselves,” he said.\nInfoWars.com reports: Interestingly, Barr said he was actually concerned about the “tracking of people” proposed by Bill Gates and others:\nIngraham: Bill Gates, the Gates Foundation are in favor of developing digital certificates that would certify that individuals, #American citizens, have an immunity to this virus and potentially other viruses going forward to then facilitate travel and work and so forth. What are your thoughts from a civil libertarian point of view about these types of – what some would say tracking mechanisms that would be adopted going forward to reopen our broader economy?\nBarr: Yeah, I’m very concerned about the slippery slope in terms of continuing encroachments on personal liberty. I do think during the emergency, appropriate, reasonable steps are fine.\nIngraham: But a digital certificate to show who has recovered or been tested recently or when we have a vaccine who has – of people who’ve received it. That’s his answer in a Reddit ask me anything. They had a little forum.\nBarr: Yeah, I’d be a little concerned about that, the tracking of people and so forth, generally, especially going forward over a long period of time.\nRead More: [https://newspunch.com/ag-barr-concerned-about-bill-gates-vaccine-certificates-plan-draconian-lockdown-must-end/] #MarkOfTheBeast #Event201 #GlobalHealthSecurityAgenda",
    "tags": [
        "Bill Gates"
    ],
    "year": "4"
}