{
    "filename": "B-Zz2gBhGWB.jpg",
    "description": "Thoughts?\nA #Trump White House-led airlift in '#ProjectAirbridge' of urgently needed medical supplies arrives in #NewYorkCity #Coronavirus #COVID19.\nA planeload of desperately needed medical supplies arrived in #NewYork from #China on Sunday, the first in a series of flights over the next 30 days organized by the #WhiteHouse to help fight the coronavirus, a Trump White House official said.\nWay back in 1986, in New York City, there was an ice skating facility known as the Wollman Rink that was badly in need of repair. The city had not only gone way over budget but when the renovations were done it still didn’t work right. No company, it seemed, could figure out how to fix the ice making problem, having spent $13 million dollars and six years in a vain attempt to get it working again. It rapidly became a national joke. Then Donald Trump stepped in and said he had the answer, and he did. In just 4 months time, Trump finished the job at a final cost 25% below the budget. He had done what New York City could not do for themselves. Now in 2020, he is doing it again.\nWhat you will read about here in today’s article is truly spectacular, and proof that #PresidentTrump is absolutely in charge as much as any president could be during this coronavirus crisis. Trump has created something called ‘Project Airbridge‘, and it is the largest movement of medical supplies through the air in modern human history, perhaps larger even than supplies that were moved on D-Day during WWII. The first flight carrying it’s massive payload of 12 million gloves, 130,000 N95 masks, 17.6 surgical masks, 50,000 gowns, 130,000 hand sanitizer units, and 36,000 thermometers has already landed, and there are 21 more such flights that will take place over the next 30 days.\nWhy haven’t you heard about this amazing event? The #fakenews media is working overtime to make sure you don’t. 🖐🏾More in comments👇🏾#Event201 #GlobalHealthSecurityAgenda",
    "tags": [
        "Bill Gates"
    ],
    "year": "3"
}