{
    "filename": "B638VnHlU4R.jpg",
    "description": "RUMORS OF WARS:\n\nIRAN has vowed to \"\"\"\"turn day into night\"\"\"\" after Donald Trump taunted the country after assassinating General Qasem Soleimani, sparking fears of World War Three breaking out.\n\nMr Trump said earlier today that that slain general should have been \"\"\"\"taken out many years ago\"\"\"\" on Twitter.\n\nAhman Khatami, an adviser to Iran's Supreme Leader Ayatollah Ali Khamenei, said in a chilling threat to the US troops in Middle East that it is \"\"\"\"time to clear the region from these insidious beasts\"\"\"\". He added: \"\"\"\"I am telling Americans, especially Trump, we will take a revenge that will change their daylight into a nighttime darkness.\"\"\"\" President TrumpÂ first began his twitter tirade by posting the American flag without comment, shortly after it was revealed that General Soleimani had been killed by US airstrikes.\n\nAt around 12.45pm today he followed with another tweet: \"\"\"\"Iran never won a war, but never lost a negotiation!\"\"\"\" General Soleimani had landed after travelling from either Syria or Lebanon at around 12.30am when he was met by Abu Mahdi al-Muhandis, deputy commander of the pro-Iran Popular Mobilization forces in Iraq.\n\nAs the cars passed through a cargo area for an access road leading out of the airport, the vehicle was struck by at least two missiles byÂ a US MQ9 Reaper drone which was being controlled remotely.\n\nAt least two missiles were fired at the vehicles - killing the general and others on board.\n\nThe drone strike came days after protesters attacked the US embassy in Baghdad, clashing with US forces at the scene.\n\n#JesusIsComing #GodIsInControl #Repent #Tukkit #NewWorldOrder #ComingSoon #MartialLaw #AreYouReady #Preparedness #Prepare #SeekJesus #MarkOfTheBeast  #USEmbassy #Israel #Truth #LastDays #Awakening #Apocalypse #WakeUp #EndTimes #EndOfDays #Iran #MiddleEast #Economic #Unrest #DonaldTrump #SignsOfTheTimes #Protest #Bagdad",
    "tags": [
        "New World Order"
    ],
    "year": "1"
}