{
    "filename": "B68j385H5Vp.jpg",
    "description": "“Many have wondered why New Jersey State Senate President Stephen Sweeney has been so adamant in regards to passing Senate Bill S2173, to the extent that he would remove Health Committee Board Members to push this Bill and then to try to influence other Senators to Vote Yes to the most controversial bill that New Jersey has seen in decades. We investigated and found that there is one constant when Sweeney becomes defiant, those are the bills that he is protecting or pushing that George Norcross has demanded. Welcome to the swamp of New Jersey politics. General Majority is the George Norcross run Super Pac pushing politicians into their positions. New Jerseyans see thru the Millions that Norcross has spent to put his personally selected order takers into office. He has been buying votes and influence to steer Insurance contracts to his firm for years. He has used the Quid Pro Quo to Build his firm and is now doing the same thing for other Companies who need influence and are looking to get laws passed that will help their Net Profits. George Norcross and Stephen Sweeney have crossed the line. We are putting our politicians on notice, we are watching you and we will be investigating your connections. We the people will not only vote you out, but we will push for the complete overhaul of politics. We need representation from men and women who are just and will uphold the constitution, we need less government, not more. Today you can make a choice as a connected politician, will you stand for the people you took an oath to serve, or will you continue to serve greed and corruption and justify your positions as the cost of doing business. We love our Great State of New Jersey, there is a reason we are fighting for what is right, we just want the politicians to do the same thing they said they would do when they were sworn in. Is that too much to ask?” Watch video now: http://bit.ly/2QLgyfy\n.\n.\n.\n.\n\n#parentalrights #vaccinationchoice #medicalfreedom #betweenmeandmydoctor #dothereasearch #medicalfreedomofchoice #protruth #vaccines #childrenshealth #immunizations #medicalexemption #medicalrights #doctorsofcalifornia #californiadoctors #californiapidoctors",
    "tags": [
        "Other"
    ],
    "year": "1"
}