{
    "filename": "B69fLPBlfRt.jpg",
    "description": "It’s January. A year after SC DSS showed up on our doorstep and I’m still working through the trauma. The other evening during dinner G said “who’s here mama?” And my body responded instantly, my heart started racing and my palms got sweaty. No one was actually in our driveway but the thought of someone showing up unannounced makes me panic because that’s exactly what happened around dinner time in January 2019. ⁣\n⁣\nWe had SC DSS show up at our door claiming they got a call that our children weren’t being cared for properly. Their term: Medical Negligence. They asked who our doctors were and weren’t thrilled when I listed off our Chiropractor and Craniosacral Therapist. Ironically, G had 30 minutes of craniosacral THAT DAY! 🤦🏻‍♀️⁣\n⁣\nAfter over an hour of questioning and me showing all of our supplements, organic food, basically our entire home etc. the workers left and I LOST IT. So many tears. Tears of frustration, hurt, and anger. How could someone do this to my family?!?! There are people who legitimately need the services of DSS and CPS, and that’s what they’re there for. BUT US?! Our children are healthy and so happy. I felt scared, vulnerable, and terrified at the thought that someone who follows me on social media is out to get my family. 🤬⁣\n⁣\nHere’s what I learned through this experience:⁣\n♥️ There is so much good in the world, our DSS worker was an angel. She was understanding and kind. I know they aren’t all like this, we were very blessed to receive her as our worker. (I was prepared if this wasn’t the case, but thankfully it was)⁣\n⁣\n👏🏻 I’m doing everything right. We immediately scheduled the boys for MD appointments and dentist appointments. They are literally in PERFECT health. #grateful⁣\n⁣\nThis journey comes with a cost. I am so passionate about sharing truth and #savingallthebabies. But standing up for what’s right and sharing the truth of an industry with so much evil comes with a cost. Am I ready to pay that cost?! Why is it so high?! Why ME?! (these questions plagued me for weeks. I barely slept)⁣\n⁣\nAll is well now, our case was dropped on unfounded allegations. OBVIOUSLY. . . Cont. in comments",
    "tags": [
        "Other"
    ],
    "year": "1"
}