{
    "filename": "B6_ocIdBub0.jpg",
    "description": "At a press conference in #MexicoCity on Friday, #Mexican President Andrés Manuel Lopez Obrador called for imprisoned #Wikileaks journalist #JulianAssange to be “pardoned and freed.” President Obrador also called for an end to the “torture” of Assange.\n\nResponding to a question on Assange and the diplomatic cables WikiLeaks published in 2010, Obrador said (in Spanish, original below): “I express my solidarity [with Assange] and hope that he is pardoned and freed. I don’t know whether he has said that his actions were confrontational to norms or to the political system, but what the cables demonstrated is the workings of the global system and its authoritarian nature, these are like state secrets that have became known thanks to this investigation, thanks to these cables, and I hope that this is taken into consideration and he is freed and he is no longer tortured.” The reporter’s question and the President’s remarks can be viewed here (from the 44:00 mark). Barry Pollack, representing Assange in the #UnitedStates, said: “President Obrador today expressed the grave concerns that everyone who values a free press and open democracy should share. The United States has always set an example for the world with its #FirstAmendment values. The unprecedented indictment by the United States of a publisher for Espionage is contrary to those principles.” Thursday the European Federation of Journalists denounced the “continued arbitrary detention and psychological torture of Julian Assange”, in a statement joining the National Union of Journalists and the International Federation of Journalists to oppose Assange’s persecution. “We believe that the arbitrary detention and criminal prosecution of Julian Assange set an extremely dangerous precedent for journalists, media actors and freedom of the press,” said EFJ General Secretary Ricardo Gutiérrez. 🖐🏾More in comments👇🏾#FreeJulianAssange",
    "tags": [
        "Other"
    ],
    "year": "1"
}