{
    "filename": "B6wrSOthS68.jpg",
    "description": "The former girlfriend of convicted pedophile #JeffreyEpstein believes she can dodge prosecution in the elite pedophile ring she is alleged to be a part of because she has “serious dirt” on powerful people, a friend of #British socialite’s family told the Sun. \n#GhislaineMaxwell has long been accused of procuring underage girls for her boyfriend and their wealthy friends but has, thus far, evaded prosecution.\n\nThe Internet has appeared to be far more concerned with Maxwell’s whereabouts than authorities, especially after Epstein allegedly killed himself at the #MetropolitanCorrectionalCenter in #NewYorkCity on August 10.\n\nIn August, the Daily Mail reported that Maxwell was hiding out in #NewEngland at the home of her wealthy boyfriend, Scott Borgerson. However, Borgerson disputed that claim.\n\nAround the same time, the New York Post released the first photo of Maxwell in three years in which she appeared to be sitting at an In-n-Out Burger, sparking numerous theories as to her whereabouts. Shortly after, however, the Daily Mail concluded that the photo was staged by her friend, attorney Leah Saffian.\n\nAnd now, the Sun is reporting inside information from Maxwell family friend, Laura Goldman, a former stockbroker who was involved with both Epstein and Maxwell before severing their relationship after Epstein’s 2008 arrest. It remains to be seen if this inside information will soon be proven or alleged to be false, throwing those following the case, once again, into darkness when it comes to Ghislaine Maxwell’s current status.\n\nAccording to Goldman, Maxwell is currently in hiding but actively texting wealthy and well connected friends whom she is “totally convinced” will be able to protect her.\n\nGoldman told the Sun on Monday: “Ghislaine and her sister Isabel remain totally convinced that she’ll escape any criminal convictions and will eventually clear the family name and return to high society once the dust has settled.\n\nShe has wealthy connections who hide her and even pay some legal fees. She can stay out of the public eye as long as she wants.” 🖐🏾More in comments👇🏾#EpsteinDidntKillHimself #LolitaExpress",
    "tags": [
        "Other"
    ],
    "year": "1"
}