{
    "filename": "B71NE_7Jelk.jpg",
    "description": "This is just my take on the Corona virus as many of you were asking for my opinion or some content regarding it. I’ve seen the fearful posts especially those portrayed by mainstream media. Let’s not get ahead of ourselves and bury our graves before its time.\n——\nHow can one protect themselves? I’m going to list some foods you can research that are believed to increase immune system function: - citrus fruits (lemons, limes, oranges, grapefruits) as vitamin C is essential. - Garlic, ginger, broccoli, turmeric, all carry essential anti-oxidants.\n\nGetting your organs and glands functioning properly again is essential. One may achieve this by firstly detoxifying the body - ridding the body of parasites, heavy metals, and toxic waste. This is the first step towards wellness - then one should replenish the body with foods that enhance energy, keep the lymph system moving and the immune system strong - fruits are great. They are your friends.\n\nTo stay updated with non-biased and non-government/big pharma funded news - subscribe to We Are Change on YouTube - World Alternative Media also. These are people funded media channels. I’m sure there are more so comment below some good recommendations 👇🏽\n—\nMy good people, lets stay vigilant, stay informed, stay conscious and give fear the “🖕🏽”\n—\nFollow my personal 👉🏽 @itsazeem\nFollow my other 👉🏽 @foundverity\n——\n#populationcontrol #staywoke #nwo #population #newworldorder #elite #explorepage #pinealgland #wakeuppeople #truthseeker #thirdeye #wakeupsheeple #anonymous  #conscious #secretsocieties #mindcontrol #consciousawareness #politics #selfaware #freedomthinker #illuminati #truthseeker  #conscious #awareness #peoplepower #depopulation #conspiracy #wakeup #coronavirus #bigpharma",
    "tags": [
        "New World Order"
    ],
    "year": "1"
}