{
    "filename": "B76hH_shfnp.jpg",
    "description": "Want to know why more people are sick this year and dying from the #flu? The answer might surprise you, it's because of the #fluvaccine and the most recent research from the National Academy of Sciences proves that people who are vaccinated spread the virus more, are not protected, and prior vaccination is harming people's immunity!\n\nDoes the #fluvaccine protect you or those around you? Well according to the research, the opposite would be true. The findings of the study found that those individuals who had received the flu vaccine were \"\"\"\"shedding\"\"\"\" 6.3 times more virus than the unvaccinated!\n\nStraight from the research: \"\"\"\"Self-reported vaccination for the current season was associated with a trend (P < 0.10) toward higher viral shedding in fine aerosol samples; vaccination with both the current and previous year's seasonal vaccines, however, was significantly associated with greater fine-aerosol shedding in unadjusted and adjusted models (P < 0.01). In adjusted models, we observed 6.3 (95% CI 1.9-21.5) times more aerosol shedding among cases with vaccination in the current and previous season compared with having no vaccination in those two seasons.\"\"\"\" \"\"\"\"The association of current and prior year vaccination with increased shedding of influenza A might lead one to speculate that certain types of prior immunity promote lung inflammation, airway closure, and aerosol generation. This first observation of the phenomenon needs confirmation. If confirmed, this observation, together with recent literature suggesting reduced protection with annual #vaccination, would have implications for #influenza vaccination recommendations and policies.\"\"\"\" Let me break it down in plain language.\nHigher viral shedding means that those who were vaccinated were breathing out more influenza virus and would be spreading it more than the unvaccinated... 🖐🏾More in comments👇🏾#VaccineAgenda #GlobalHealthSecurityAgenda",
    "tags": [
        "Other"
    ],
    "year": "1"
}