{
    "filename": "B79URejBr5t.jpg",
    "description": "Thoughts?\n\nThe #WorldHealthOrganization has declared a “public health emergency of international concern” over the outbreak of the 2019nCoV, or the #Wuhancoronavirus. The international body didn't recommend travel and trade restrictions.\n\nWHO Director-General Tedros Adhanom Ghebreyesus called the #coronavirus “a previously unknown pathogen, which has escalated into an unprecedented outbreak” at a press conference on Thursday, but said the WHO was not recommending restrictions of trade or travel with China, where the virus originated.\n\nTedros pointed out that the declaration was \"\"\"\"not a vote of no confidence in China,\"\"\"\" but made out of concern for other countries, with \"\"\"\"weaker\"\"\"\" healthcare systems.\n\nChina’s response to the outbreak has been “very impressive,” the WHO chief added. “So is China’s commitment to transparency and to supporting other countries.\"\"\"\" China is actually setting a new standard for outbreak response.\n\nWhile the majority of coronavirus cases have been registered in China, the WHO confirmed there were 98 confirmed cases elsewhere in the world – including eight cases of direct transmission in #Germany, #Japan, #Vietnam and the US.\n\nThe “vast majority” of cases outside of China have either traveled to Wuhan or been in contact with someone who has, the WHO officials noted. “The only way we will defeat this outbreak is for all countries to work together in a spirit of solidarity and cooperation,” Tedros said. “We are all in this together, and we can only stop it together.” Coronavirus is the unofficial name of the pathogen, which the WHO is referring to by its interim name, 2019-nCoV. The condition caused by it is being called “2019-nCoV acute respiratory disease.” 🖐🏾More in comments👇🏾#GlobalHealthSecurityAgenda",
    "tags": [
        "Other"
    ],
    "year": "1"
}