{
    "filename": "B7_Yq8eBYeE.jpg",
    "description": "#HillaryClinton’s team have finally accepted legal documents in connection with a $50 million defamation lawsuit bought by 2020 Democratic presidential candidate #TulsiGabbard, the #Hawaii congresswoman’s lawyer told Fox News on Thursday night. “We look forward to finally moving forward on the merits” of the case, said Brian Dunne, lead attorney representing Gabbard, who is suing over #Clinton indirectly smearing her as a “#Russian asset” during an October interview.\n\nFox report: The development comes after Hillary Clinton and her representatives refused to accept the papers in three previous attempts to serve them, Dunne said. “Today, after the media picked up this story, Ms. Clinton’s lawyer changed course and agreed to accept service,” Dunne told Fox News in a statement. “We would have preferred that Ms. Clinton just accept federal judicial process in the first instance, without having to be called out by the press, but in any event, Tulsi Gabbard’s lawsuit against her will now be moving forward.” Fox News left written and phone messages late Thursday for Clinton attorney David Kendall of the Washington law firm Williams & Connolly LLP but did not receive a response.\n\nAt a campaign event in Portsmouth, N.H., on Thursday evening, Gabbard hadn’t yet heard that Clinton’s team accepted the legal papers. “The latest that I’ve heard is that it’s what’s been reported, that she has refused to be served the documents related to the lawsuit,” Gabbard told reporters. “I think this is unfortunate, you know. No one is above the law. This lawsuit is about accountability – not just for me but for all service members and for the #American people.” Clinton had said in an October 2019 interview that one of the Democratic presidential candidates was “the favorite of the Russians” and was being groomed as a third-party candidate for the 2020 general election in November.\n\nClinton never mentioned Gabbard by name, but when asked to confirm whether the former first lady was referring to Gabbard, Clinton spokesman Nick Merrill responded at the time, “If the nesting doll fits … ” a reference to popular Russian dolls. 🖐🏾More in comments👇🏾#HillaryForPrison",
    "tags": [
        "Other"
    ],
    "year": "1"
}