{
    "filename": "B7DnB9-HmHN.jpg",
    "description": "New Hampshire state employees will now be able to take part in a program that will allow them to take their infant children to work, Gov. Chris Sununu said Monday.\n\nSununu signed an executive order allowing parents and eligible guardians of infants between the ages of 6 weeks and 6 months to bring their child to work, so long as their state agency or department has elected to participate; the worker receives prior written authorization from the agency’s human resource officer; the worker has completed an individualized plan for the infant; there’s no safety hazard or concern to the parent of the infant; and there is limited disruption in the workplace.\n\nSununu said over 20 state departments and agencies have chosen to participate so far. The program will be based on programs in several other states, including Arizona, Vermont and Washington. “This initiative can provide working families with options to give their kids the healthiest possible start to life while allowing them to remain in the workforce if they choose to do so,” Sununu said at a news conference.\n\nWhen asked how many state employees this could affect currently, Sununu said “it’s not that many, to be honest, but part of doing this is we hope it’s more. We’re trying to encourage and attract young people into the workforce.” The policy says that “habitually disruptive or sick infants are not permitted in the workplace“ and that parents participating in the program are required to comply with current state regulations governing child immunizations. The infants shall not be brought to meetings unless approved in advance by the agency’s human resource officer and the meeting organizer.\n.\n.\n.\n.\n.\n\n#parentalrights #vaccinationchoice #medicalfreedom #betweenmeandmydoctor #dothereasearch #medicalfreedomofchoice #protruth #vaccines #childrenshealth #doctorpatientrights #informedconsent #immunizations #medicalexemption #medicalrights #doctorsofcalifornia #californiadoctors #californiapidoctors",
    "tags": [
        "Other"
    ],
    "year": "1"
}