{
    "filename": "B7l3RM-BdFL.jpg",
    "description": "A petition to recall #Virginia Gov. Ralph Northam for his tyrannical attempt at “infringing on U.S. Constitution #2ndamendment rights” as well as the Virginia Constitution has achieved its target in record time.\n\nAccording to the petition, “We the people of The Commonwealth of Virginia feel Governor Ralph Northam should be recalled from office. Governor Northam has presented a state wide gun ban that would disarm law abiding citizens, infringing on constitutional rights granted by the U.S Constitution 2nd Amendment as well as Virginia Constitution Article 1 section 13. This kind of proposition is unconstitutional and should not be allowed.” The petition was started by Josh Bratton and had an initial goal of 75,000 signatures. This number was reached within hours. The sky is currently the limit, considering the depth of feeling in Virginia and the #UnitedStates regarding Gov. Northam’s unconstitutional behavior.\n\nClearly, when one cites the law, which should unite all #Americans, and in this case, all Virginians, it is clear that Gov. Northam is attempting to disregard the Constitution of the United States of America, making him a tyrant and a traitor to the people he is supposed to protect and serve. “His plan for implementing and enforcing such a ban would be using local #lawenforcement and National Guard soldiers to gather guns,” the petition continues. “Doing so would also be taking privately owned weapons from the ones ordered to enforce the new law.” It would also be a violation of the protections of the Fifth Amendment that grants due process before one loses, among other things, personal property. “Law enforcement and the citizen soldiers have taken oath to uphold the Constitution of the United States,” the petition adds. “Governor Northam’s proposition to ban privately owned and registered weapons would violate such an oath.” 🖐🏾More in comments👇🏾",
    "tags": [
        "Other"
    ],
    "year": "1"
}