{
    "filename": "B7oamudhh5O.jpg",
    "description": "More left-wing journalists are waking up to the fact that unaccountable #SiliconValley corporations are ranking #Americans with a system that bears a growing resemblance to #China’s #totalitarian “#socialcredit” system — almost a year after Breitbart Tech pointed out the same thing.\n\nChina’s “social credit” system assigns citizens with a “score” based on good or bad behavior, which is in part determined by one’s compliance with #Beijing’s totalitarian communist value system. Those who fall below a certain score are excluded from basic services. There’s no escape, either; to track everyone’s behavior, China subjects its citizens to mass surveillance, powered by a network of facial recognition cameras all across the country. Chinese citizens literally can’t escape their #socialcreditscore — low scores blocked 23 million Chinese citizens from traveling via train or airplane in less than one year, as reported by the Guardian.\n\nIn an article for Engadget, left-wing writer Violet Blue notes that big tech companies have developed a system that is remarkably similar to China’s, ranking the behavior of users — and arbitrarily kicking them off their services — according to Silicon Valley’s own set of subjective values, including what it considers to be “conscientious” and “open” behavior. She takes particular aim at Airbnb:\n\nThe Evening Standard reported on Airbnb’s patent for AI that crawls and scrapes everything it can find on you, “including social media for traits such as ‘conscientiousness and openness’ against the usual credit and identity checks and what it describes as ‘secure third-party databases’.” Blue makes the connection to China, where similarly invasive surveillance is used to build a profile and a social credit score on every citizen:\n\nThe most famous #socialcreditsystem in operation is that used by China’s government. It “monitors millions of individuals’ behavior (including social media and online shopping), determines how moral or immoral it is, and raises or lowers their “citizen score” accordingly,” reported Atlantic in 2018. 🖐🏾More in comments👇🏾#Technocracy #SurveillanceState #NewWorldOrder #MarkOfTheBeast",
    "tags": [
        "New World Order"
    ],
    "year": "1"
}