{
    "filename": "B7ohPYFhcUz.jpg",
    "description": "Some #Catholics consider #PopeFrancis to be a #Marxist, but he is using his position and organization to orchestrate the entire planet into full-blown #SustainableDevelopment, aka #Technocracy.\n\nIn his sponsorship of a March 2020 economic summit, “Economy of Francesco”, Francis calls for a “different kind of economy”, “new economy” and Sustainable Development.\n\nIn Laudato Si’, the word “sustainable” was used 21 times to convince readers that UN-style Sustainable Development, aka Technocracy, holds the future of the world. However, in a true application of the #HegelianDialectic, Francis attacks the “Technocratic Paradigm” by stating “The technocratic paradigm also tends to dominate economic and political life.” Two key Vatican documents to read:\n\nLaudato Si’ Encyclical (May 24, 2015)\n“Economy of Francesco” 2020 summit (May 1, 2019)[ The author of the following article only sees Marxism, but readers of Technocracy News & Trends understand that Marxism is only the necessary stepping-stone to Technocracy and not the end in itself. This was originally postulated by Zbigniew Brzezinski in his 1970 book, Between Two Ages: America’s Role in the Technetronic Order.\n\nAs if there needs to be further evidence that the current occupant of St. Peter’s Chair in Rome is a Marxist, the announcement of an upcoming conference at Assisi entitled the “Economy of Francesco” should convince any skeptic otherwise.\n\nIn his invitation letter to “young economists and entrepreneurs worldwide,” Bergoglio sets the agenda for the Leftist confab quite clearly which is virulently anti-market, a call for massive redistribution of wealth, and a reordering of the current economic systems of the world with a healthy dose of #climatechange nonesense: . . . a different kind of economy: one that brings life not death, one that is inclusive and not exclusive, humane and not dehumanizing, one that cares for the environment and does not despoil it.* 🖐🏾More in comments👇🏾#Agenda21 #Agenda2030 #Agenda2050",
    "tags": [
        "Other"
    ],
    "year": "1"
}