{
    "filename": "B7R_Xo_he15.jpg",
    "description": "In a shocking drug approval last year, the U.S. #Foodand DrugAdministration (FDA) approved a #ketamine-based #nasalspray for treating #depression. The news was surprising considering the history that the substance has as a snortable club drug and the strict policy of drug prohibition and regulation in the U.S. However, in the short time since, Ketamine is slowly becoming more respected as a legitimate treatment for depression in clinical settings.\n\nMeanwhile, other nasal sprays for drugs that were once considered illicit are beginning to reach the market as well.\n\nAs the Mind Unleashed reported last month, a pharmaceutical company called #SiloWellness announced that they were developing a nasal spray for #psilocybin, the active ingredient in many of the most popular “#magicmushrooms.” The psilocybin-based spray is also intended to be used as a treatment for depression.\n\nNow, in the most shocking FDA approval yet, the agency has approved a cocaine-based nasal spray for use as an anesthetic.\n\nIn a January 13 press release, Lannett Company Inc. announced that the FDA approved a New Drug Application (NDA) for the #cocaine-based nasal spray which is intended to be used as a local anesthetic for surgeries in the nose cavities.\n\nThe drug is called #NUMBRINO and is comprised of a patented nasal solution which contains cocaine.\n\nLannett CEO Tim Crew says that the company is planning full clinical trials to prove the effectiveness of the drug. “The FDA’s approval of our Cocaine HCl product, the first NDA approval to include full clinical trials in the company’s history, marks a major milestone in Lannett’s 70+ years of operations. We believe the product has the potential to be an excellent option for the labeled indication. We expect to launch the product shortly, under the brand name NUMBRINO®,” Crew said in the press release.\n\nVariations of the cocaine-based solution were tested on 159 patients during the interventional clinical trial. In the treatment of these patients the investigators tested a placebo topical solution against cocaine hydrochloride 4% or 10% as an aesthetic prior to a diagnostic procedure, according to MDMag. 🖐🏾More in comments👇🏾",
    "tags": [
        "Other"
    ],
    "year": "1"
}