{
    "filename": "B7Rdc7KB8Fb.jpg",
    "description": "Thoughts?\n\nIf your new home isn’t #carbonneutral, an #ElizabethWarren presidency might not let you build it. And if that means no new homes get built in the #UnitedStates, the #Massachusetts senator and Democrat presidential nominee says she’s fine with that.\n\nIs this crop of Democrat presidential nominees deliberately trying to lose the 2020 election?\n\nIn October, Warren unveiled her plan to address “#environmentalracism” and “#environmentalinjustice”, by announcing a $1 trillion payout for “minority communities” affected by pollution and #climatechange.\n\nWarren’s new plan to ban non carbon neutral houses is a step even further in the direction of far-left Crazytown.\n\nIn an appearance on MSNBC’s “Morning Joe” on Wednesday, the Massachusetts senator and Democrat presidential candidate talked about her Thunberg-lite plan to help end climate change — and destroy the United States’ economy in the process.\n\nWesternJournal report: During her appearance Warren was asked what she’d do to “change the tide of U.S. policy on the issue of climate change” and acted as if she’d been thrown the softball of all softballs.\n\nShe promised “to do everything a president can do all by herself, that is, the things you don’t have to do by going to #Congress.” This includes putting an end to energy mining and drilling on federal lands or offshore and “not having a coal lobbyist as head of the #EnvironmentalProtectionAgency.” You might not be surprised to learn that’s a dig at Andrew Wheeler, #PresidentDonaldTrump’s EPA administrator, who was previously an attorney representing a coal producer.\n\nElizabeth Warren then moved on to her plan for housing, which she said was borne out of the dire predictions scientists have been making. “What scares me is every time you go back to the scientists, they tell you two things,” the senator said. “It’s worse than we thought, and we have less time. “That means we’ve got to be willing to do things, for example, like regulation. By 2028, no new buildings, no new houses, without a zero carbon footprint.” And she’s coming for your car and electricity bill, too. 🖐🏾More in comments👇🏾#Agenda21 #Agenda2030 #Agenda2050 #GreenNewDeal #SustainableDwve",
    "tags": [
        "Other"
    ],
    "year": "1"
}