{
    "filename": "B7RDvY3hXkg.jpg",
    "description": "During a recent interview with Fox News’ Laura Ingraham, U.S. #PresidentDonaldTrump made some telling comments about the true motives behind the foreign policy of the #UnitedStates. When speaking optimistically about the country’s diplomatic relationship with #SaudiArabia, Trump bragged bout how much the oil-rich dictatorship paid the U.S. for military support. “Saudi Arabia is paying us for [our troops]. We have a very good relationship with Saudi Arabia. I said, listen, you’re a very rich country. You want more troops? I’m going to send them to you, but you’ve got to pay us. They’re paying us. They’ve already deposited $1 billion in the bank,” Trump said.\n\nIn effect, Trump was suggesting that U.S. troops are acting as mercenaries for Saudi Arabia. “We are going to help them, but these rich countries have to pay for it. South Korea gave us $500 million… I said, ‘You gotta help us along. We have 32,000 soldiers in South Korea protecting you from North Korea. You’ve gotta pay’,” he added.\n\nAnti-war conservative Rep. Justin Amash, who recently split from the Republican Party, was quick to point out this gross misuse of military power.\n\nAmash has been a critic of Trump’s foreign policy for the duration of his presidency and was equally critical of Obama. Amash was one of the few Republicans who supported the recent measure to impeach President Trump. On Meet the Press in October, Amash spoke of this specific practice of hiring troops out to countries like Saudi Arabia. “There are people who support the president, who believe things he says, but it’s pretty clear he’s not bringing home the troops. He’s just moving them to other parts of the #MiddleEast. He’s moving troops back into #Iraq, he’s moving other troops into Saudi Arabia and using our forces almost as mercenaries, paid mercenaries who are going to come in, as long as Saudi Arabia pays us some money, it’s good to go,” Amash said. 🖐🏾More in comments👇🏾",
    "tags": [
        "Other"
    ],
    "year": "1"
}