{
    "filename": "B7rYBnWBILg.jpg",
    "description": "It was reported this week that #thePentagon made $35 trillion — with a ‘T’ — in accounting adjustments in 2019 alone. That number is larger than the entire U.S. economy and is up from $30.7 trillion in 2018. The figure also dwarfs the Congressional approved military budget of $738 billion. Naturally, no one cares and #Pentagon officials dismiss this black hole of spending as accounting errors. “Within that $30 trillion is a lot of double, triple, and quadruple counting of the same money as it got moved between accounts,” said Todd Harrison, a Pentagon budget expert with the Center for Strategic and International Studies.\n\nThe “combined errors, shorthand, and sloppy record-keeping by DoD accountants do add up to a number nearly 1.5 times the size of the U.S. economy,” said Representative Jackie Speier, who asked the Government Accountability Office to investigate. The report shows the Pentagon “employs accounting adjustments like a contractor paints over mold. Their priority is making the situation look manageable, not solving the underlying problem,” she said.\n\nThis problem is only getting worse too. As Bloomberg reported, the Defense Department acknowledged that it failed its first-ever audit in 2018 and then again last year, when it reviewed $2.7 trillion in assets and $2.6 trillion in liabilities. Despite the shame of failing—twice—the accounting “errors” have grown.\n\nImagine running a company in which you accounted for spending like they do at the Pentagon. If you were the CFO, you’d be fired, if and only if the entire business didn’t already collapse. However, because these morons have an unlimited pool of tax revenue and #FederalReserve dollars from which to draw resources, they are allowed to continue down this unaccountable path toward unsustainable debt and spending.\n\nIn the meantime, Democrats and Republicans alike remain silent as questioning the #militaryindustrialcomplex is akin to a thought crime. The war machine must go on and continue to expand or else they’ll find themselves out of a job... 🖐🏾More in comments👇🏾",
    "tags": [
        "Other"
    ],
    "year": "1"
}