{
    "filename": "B7SgyInhqip.jpg",
    "description": "Let's talk about shame for a moment. How about failure and regret. That's my bucket of tears.⁠⠀\n.⁠⠀\nI've always been someone who loves to research. Who gathers information. Who doesn't follow norms for the sake of norms. I've also (in my adult years) been on a pursuit of full health. I would go to the naturopath before the doctor. I birthed with midwives in tubs and birthing centres. I cloth diapered my babies and breastfed as long as possible. I didn't use soap on my babies. Didn't feed rice cereals or grains for babies. Delayed first foods. My babies slept in my bed .... and one still does. ⁠⠀\n.⁠⠀\nHow did I miss this? How did I not question vaccines as much as the birthing process? How did I remove the natural?⁠⠀\n.⁠⠀\nWhy was I not as big an advocate of lead in lipstick AND aluminium being injected in to babies? The latter is worse. The effects detrimental.⁠⠀\n.⁠⠀\nI advocate for toxin reform day in and day out - but didn't do the due diligence to read the excipient list on vaccines.⁠⠀\n.⁠⠀\nI missed the target. I felt like an imposter. I often still do. How can you trust me when I made such a huge mistake? How can I trust myself?⁠⠀\n.⁠⠀\nThe thing is: it's not about me. It's about you. I'm owning my story. You will need to own yours. I want to use the story I wish we didn't have - so that you can learn and make informed choices yourself. ⁠⠀\n.⁠⠀\nWhere do I wish I had started? 1) the excipient list. 2) the book called \"\"Dissolving Illusions\"\" 3) @believemothers instagram because it connects story to people. ⁠⠀\n.⁠⠀\nWhere will you start?⁠⠀\n.⁠⠀\nPhoto credit @heima_photography ⁠⠀\n.⁠⠀\n.⁠⠀\n.⁠⠀\n.⁠⠀\n.⁠⠀\n..⁠⠀⁠⠀\n⁠⠀⁠⠀\n.⁠⠀⁠⠀⁠⠀\n.⁠⠀⁠⠀⁠⠀\n.⁠⠀⁠⠀⁠⠀\n.⁠⠀⁠⠀⁠⠀\n.⁠⠀⠀⁠⠀⁠⠀⁠⠀⁠⠀⁠⠀\n.⠀⁠⠀⁠⠀⠀⁠⠀⁠⠀⁠⠀⁠⠀⁠⠀\n⠀⁠⠀⁠⠀⠀⁠⠀⁠⠀⁠⠀⁠⠀⁠⠀\n#zerowaste #recycle #saveourworld #carbonfootprint⠀⁠⠀⁠⠀⠀⁠⠀⁠⠀⁠⠀⁠⠀⠀⁠⠀⁠⠀⠀⁠⠀⁠⠀⁠⠀⁠⠀⁠⠀\n#realmamahood #autoimmune #detox #beauty #toxinfree #greenbeauty #informedconsent #freedomkeepers #wildandfree #thatsdarling #darlingdaily #thehappynow #livethelittlethings #believemothers #freedomkeeper #momlife #enchatedchildhood #motherhoodblog #thecreativecollective #yycmoms #beautyblogger⁠⠀⁠#thisisredding⁠⠀⁠.⁠⠀",
    "tags": [
        "Other"
    ],
    "year": "1"
}