{
    "filename": "B7Zd-QyB_hg.jpg",
    "description": "The infamous UK Police department #ScotlandYard is refusing to reveal #PrinceAndrew’s location on the night that he is accused of being with #VirginiaGiuffre, one of the young girls trafficked by #JeffreyEpstein who was underage at the time she claims the Duke had sex with her.\n\nMembers of the royal family are regularly accompanied by police guards in their day to day activities and there are records of where and when the officers were sent—or at the very least a record of which officers worked on which day. If these records were to be made available investigators could easily determine where Prince Andrew was on the night in question, but police are saying that handing over such information could pose a threat to national security.\n\nDuring his disastrous BBC interview, Andrew claimed that he was at a #PizzaExpress in Woking on the night then 17-year-old Giuffre (then Roberts) says the pair visited a club and later had sex. If the Duke is indeed telling the truth, then his claims could be very easily corroborated by whichever guard was on duty at the time. Unfortunately, Scotland Yard has not been willing to cooperate.\n\nIn a statement responding to the inquiry, Scotland Yard said that revealing information about the disgraced prince’s whereabouts on the night in question could “undermine the safeguarding of national security,” according to the Sun. “It would allow those with a criminal intent to gain an operational advantage over the MPS and place those who the MPS have confirmed are afforded protection, as well as protection officers, and members of the public at risk,” the statement continued.\n\nThe investigation into Prince Andrew’s location on that night of the alleged crime is part of a case involving numerous Epstein victims who have been seeking justice for many years. As the Mind Unleashed reported last month, lawyers representing the victims have said they intend to subpoena Prince Andrew so he is forced to testify in court about his relationship with Epstein and his victims. 🖐🏾More in comments👇🏾#PedoGate #PizzaGate #SpiritCooking #LolitaExpress #LittleStJamesIsland #StopHumanTrafficking",
    "tags": [
        "Qanon"
    ],
    "year": "1"
}