{
    "filename": "B7ZeIJsHwku.jpg",
    "description": "~Queen A-Lizard-Birth, The Case of 50,000 Missing Children~ “Queen Elizabeth had direct involvement in the kidnapping and death of aboriginal children” it was reported on the ITCCS website. “Royal Family members also appeared to regularly participate in Ninth Circle Satanic Cult rituals at the Mohawk Indian School in Brantford, Ontario, Canada.” The order to arrest Queen Elizabeth was issued in 2013 by six judges of the International Common Law Court of Justice in Brussels.\nAfter nearly a year of litigation, Queen Elizabeth and her husband, Prince Phillip, were found guilty in the disappearance of ten native children from the Catholic-run Kamloops residential school in British Columbia. Grieving parents haven’t seen their children since they left for a picnic with the Royal couple on Oct. 10 1964. The ITCCS successfully prosecuted Queen Elizabeth’s kidnapping, along with 50,000 cases of other missing children.In April, a second international trial began in Brussels on global elite members of the Ninth Circle Satanic Cult.\nA court document had been filed indicating that in Jan. 2012 UK Archbishop of Canterbury Justin Welby acted under the direction of Queen Elizabeth to destroy forensic remains of a Ninth Circle Satanic Cult child homicide. Two eyewitnesses have testified that as children they were present during this same murder of a native child.\nThe satanic rite evidently occurred in a sub basement catacomb under the west wing of the Canadian Branton Ontario Mohawk Indian residential school. The two eyewitnesses alleged that they saw a young girl being bound to an altar. The five or six year-old child was gagged, repeatedly raped, killed, disemboweled and dismembered. Her blood was consumed by nine red-robed figures that included  members of the British Royal Family.\nLink to Public Letters of Demands for 10 missing Native Children, from Eye Witnesses: (Note: William Arnold Combes was killed after his Statement)\nhttps://m.dailykos.com/stories/2010/7/3/881519/- Full Story on Queen Elizabeth's murders of Witnesses.\nhttps://steemit.com/itccs/@paulocouto/queen-elizabeth-found-guilty-in-missing-children-case-whistle-blowers-incarcerated",
    "tags": [
        "Other"
    ],
    "year": "1"
}