{
    "filename": "B81KUEqlegy.jpg",
    "description": "This is me breaking down. Yea I was hysterical crying on the phone with my husband telling him I can’t deal with this anymore. ⁣\n⁣\nWhat am I talking about?⁣\n⁣\nI get labeled a lot. And I get judged and unfollowed people that are important to me (or so ai thought). I get pinpointed in reposting of hurtful articles and it weighs heavy in my heart.⁣\n⁣\nI have lost friends and dynamics of family members have changed because of judgment. ⁣\n⁣\nI’m not posting this for anyone to feel bad. I’m posting this because something has to fucking change. ⁣\n⁣\nEarlier last year the state of Florida was proposing mandated vaccines for all children (and eventually adults) without regard to predisposed issues. ⁣\n⁣\nSo, I did something brave, and became vocal. It’s not the governments place to take away medical rights. I don’t care if you vaccinate or not. ⁣\n⁣\nI did something that put me in a position of hateful opinions and severance of relationships (not on my end). I started to share my truth and my decisions. This was because I broke down ingredient by ingredient what was in vaccines today (which is very different from when I was even a kid). And I did this because I watched my second child suffer. ⁣\n⁣\nMy point in this post is that it’s never OK to emotionally judge or label someone. That’s exactly what’s wrong with our society and this generation. We all feel that it’s our way or the highway and the fact of the matter is that life is beautiful with so many choices and it’s not black-and-white. ⁣\n⁣\nI will never shame, or judge anyone for their choices as long as they’re doing it for the betterment of themselves or family. If you don’t agree that’s fine, I’m in no way shape or form telling you your wrong. What I’m saying is it’s just not right for us... and that has nothing to do with you. So why does that trigger you?⁣\n⁣\nI’m sick of feeling like an outcast. I’m sick of feeling different. I’m sick of feeling labeled and judged. This is very heavy for me. It makes me want to seclude and recluse. It’s lonely and dark. But, I’m just sharing my truth... and honesty is what you’ll get here. .\n.\n.\n.\n.\n#medicalfreedom #floridafreedomfighter #medicalrights #humanrightsactivist",
    "tags": [
        "Other"
    ],
    "year": "2"
}