{
    "filename": "B89gyU0BArJ.jpg",
    "description": "#HarveyWeinstein has been found guilty of rape in the third degree and criminal sexual acts in the first degree, bringing his seven-week #NewYork trial to a conviction in the central criminal case of the #MeToo movement.\n\nThe conviction in the cases of Miriam Haley and Jessica Mann could see Weinstein spend the rest of his life in prison – the charges carry maximum sentences of up to 25 years. He also faces a sexual misconduct trial in #LosAngeles involving two women, one of whom – Lauren Marie Young – testified in New York to bolster the Haley and Mann cases.\n\nThe jury found him not guilty of sexual predatory assault.\n\nWeinstein’s New York trial covered five criminal counts, including two of predatory sexual assault, one involving Haley and actress Annabella Sciorra, the other count involving Sciorra and Mann. The jury had to unanimously agree on each count that Weinstein assaulted two women, with each count carrying a possible prison sentence of 10 years to life.\n\nIn addition to the predatory counts, Weinstein was charged with one count of criminal sexual assault (against Haley), and two counts of rape (one in the first degree, one in the third, both involving Mann). Those first-degree crimes carry possible prison sentences of five to 25 years; the third degree crime, up to four years in prison.\n\nHaley, now 42, was a #ProjectRunway production assistant in 2006 when, she says, Weinstein forcibly performed oral sex on her in his Soho apartment on a July night in 2006. (That allegation resulted in a charge of criminal sexual assault in the first degree; Haley’s account of having sex with Weinstein later that month at the TriBeCa Grand Hotel, under duress but not physically forced, did not produce criminal charges.) Mann, 34, a former actress, model and hairstylist, claimed Weinstein raped her on March 18, 2013 at the #DoubleTreeHotel in #MidtownManhattan. 🖐🏾More in comments👇🏾",
    "tags": [
        "Other"
    ],
    "year": "2"
}