{
    "filename": "B8cKk7VhAFy.jpg",
    "description": "Here are the true colors of #Agenda21, #Agenda2030 and #SustainableDevelopment, aka #Technocracy, which I have repeatedly warned is anti-human and anti-civilization. This professor has just laid it out in plain sight.\n\nA #Cambridge academic has proposed a radical new way to solve #climatechange – letting humanity become extinct.\n\nPatricia MacCormack, a professor of continental philosophy at #AngliaRuskinUniversity, has just released her new book The Ahuman Manifesto, which will officially be launched in Cambridge today (Wednesday, February 5). The book argues that due to the damage done to other living creatures on Earth, we should start gradually phasing out reproduction. But rather than offering a bleak look at the future of humanity, it has generated discussion due to its joyful and optimistic tone, as it sets out a positive view for the future of #Earth – without mankind.\n\nIt also touches on several hot-button topics, from religion and veganism to the concept of identity politics, tying these into how the creation of a hierarchal world among humans has left us blind to the destruction we are causing to our habitat and other forms of life.\n\nSpeaking to CambridgeshireLive, Professor MacCormack outlined how she came to this point of view, and how these ideas are not as provocative as they may initially sound.\n\nShe said: “I arrived at this idea from a couple of directions. I was introduced to philosophy due to my interest in #feminism and #queertheory, so reproductive rights have long been an interest to me – this led me to learn more about animal rights, which is when I became #vegan. “The basic premise of the book is that we’re in the age of the Anthropocene, humanity has caused mass problems and one of them is creating this hierarchal world where white, male, heterosexual and able-bodied people are succeeding, and people of different races, genders, sexualities and those with disabilities are struggling to get that. “This is where the idea of dismantling identity politics comes in – they deserve rights not because of what they are, but because they are. 🖐🏾More in comments👇🏾",
    "tags": [
        "Other"
    ],
    "year": "2"
}