{
    "filename": "B8eRVZOB9fl.jpg",
    "description": "Thoughts?\n\nHumans must “phase out reproduction” and make ourselves extinct in order to defeat #globalwarming and #climatechange, according to a liberal professor.\n\nDr. Patricia MacCormack, who works at #AngliaRuskinUniversity in the #UnitedKingdom as a professor of continental philosophy and is also a proselyting vegan, made the radical suggestion in her new book “The Ahuman Manifesto.” “Mankind is already enslaved to the point of ‘zombiedom’ by capitalism, and because of the damage this has caused, phasing out reproduction is the only way to repair the damage done to the world,” according to a Cambridgeshire Live article summarizing the professor’s work.\n\nDr. Patricia McCormack says the human race must make itself extinct in order to fight climate change.\n\nThe indoctrination of radical left-wing ideas in our schools, colleges and universities is infecting the minds of our youth to the point where self-loathing and hatred is becoming the new ideal.\n\nIt started decades ago with the concept that straight, white, Christian males should stand down and learn to despise themselves while shamefully accepting the blame for all of the world’s problems.\n\nNow that the new left-wing religion of climate change has gone mainstream, at least one liberal professor believes the only solution is for humans to make themselves extinct.\n\nProf. Patricia MacCormack’s bio on the school’s website claims that she “has published extensively in the areas of Continental philosophy, #feminism, queer theory, posthuman ethics, animal studies and horror films.” “Her work has been cited and reviewed internationally resulting in many invites to HEIs to speak both to Faculty and public lectures. “Her monographs Cinesexuality, Posthuman Ethics and The Animal Catalyst collection have been key reading on curricula internationally,” it says.\n\nRead More: [https://newspunch.com/liberal-professor-human-race-must-go-extinct-fight-climate-change/]",
    "tags": [
        "Other"
    ],
    "year": "2"
}