{
    "filename": "B8Hc6qylXiD.jpg",
    "description": "God was a yeller, or so #KathyIreland thought.\nAt the #church she grew up in, the pastor preached a screechy, judgmental message and she superimposed the image of her pastor on #God. She thought that God must be like that.\n“There was a part of me that was kind of scared of God,” Ireland says on an I am Second video. “The church that I attended as a child, the leader there would kind of yell.”\nShe jumped into modeling at age 16 and was featured in #Vogue, #Cosmopolitan, #Forbes, #Mademoiselle and the racy #SportsIllustrated swimsuit edition multiple times.\nIreland flew off to Paris to start modeling at age 18. “It sounds so much more glamorous than it was,” she admits.\nHer mother, who had accepted Jesus when Ireland was a teen, slipped a #Bible in her luggage. She didn’t feel comfortable staying at a home provided in #Paris. She often locked herself in her room, and other models who stayed there ominously called it “the dungeon.”\nOne night, lonely, bored, jet-lagged, Ireland found the Bible and began to thumb through its pages, a novelty for her.\n“I randomly opened up to the #Gospel of Matthew,” Ireland says. “As I read, my life was forever changed.”\nIreland had been a rebellious teenager who questioned authority. She wondered about #truth and what was right and wrong.\nWhen she examined the Bible for the first time, she realized it contained the truth.\n“I think one of the things that grabbed a hold of me was that #Jesus wasn’t anything like I thought,” Ireland continues. “He wasn’t condemning. He wasn’t yelling. Instead, He was loving, and He was leading.”\nIreland discovered that #modeling is a world flush with #exploitation. “Particularly as a young woman out in the world for the first time, in a world that often times felt dominated by men of questionable character, it gave me such #comfort to know that Jesus loves women and honors them,” she says.\nJesus became Ireland’s #Lord, #Savior and best friend.\nShe now says that she remained a “baby #Christian” for a very long time — and she regrets it.\n“I would continue to read the word,” Ireland says. “But I would just read the same verses over and over.”\nThere were other verses that she would come across that she 👇",
    "tags": [
        "Other"
    ],
    "year": "2"
}