{
    "filename": "B8jt3sOhqjo.jpg",
    "description": "Thoughts?\n\nThe topic of #pedophilia and the trafficking of children has gained a lot of attention within the past year alone, more so than we’ve ever seen from the mainstream. This is in large part due to the entire #JeffreyEpstein and #PrinceAndrew Saga, which brought even more attention to the issue and awareness to the fact that this type of activity is going on in places of high power amongst many people who seem to be above the law. Another great example is the recent conviction of the #Vatican’s #CardinalGeorgePell for sexually abusing children, or the rampant #childporn sharing that’s been happening within #thePentagon.  The list goes on and on, and is quite large. In fact, more details have emerged suggesting that one of Epstein’s main jobs was to entrap high profile people.\n\nWhen it comes to #Hollywood specifically, #HarveyWeinstein and recent #KevinSpacey allegations have been responsible for bringing even more awareness to the problem of sexual abuse, and it’s not surprising that Weinstein roamed within the same circles as Epstein. Smallville actress #AllisonMack was also ‘outed’ for being a member of a sex cult and working in a management capacity also brought attention to the issue, she worked for someone named #KeithRaniere, who owned a company called #NXIVM, which supposedly offers executive success programs, but clearly, that wasn’t the case.. He was arrested, along with Mack, in March 2018 in #Mexico on charges of sex trafficking. This group also has strange connections to the powerful elite, as Billionaire Clare Bronfman was indicted on racketeering charges.\n\nThe Rolling Stone reported: “There are strange political connections as well. Mark Vicente, a documentary filmmaker and former high-ranking member of the group, testified at the trial of NXIVM head Keith Raniere that Clare Bronfman, the billionaire Seagram’s heiress and alleged benefactor of the organization, approached him and a few other members of the group to help her make a contribution to a Clinton campaign.” (source) 🖐🏾More in comments👇🏾#PedoGate #PizzaGate #SpiritCooking #StopHumanTrafficking #LolitaExpress #EpsteinDidntKillHimself #SatanicRitualAbuse",
    "tags": [
        "Qanon"
    ],
    "year": "2"
}