{
    "filename": "B8ruvVcB4Ek.jpg",
    "description": "#PrinceAndrew stayed with a billionaire who has been accused of raping 10 teenagers at his #Bahama’s mansion.\n\n#Canadian fashion magnate #PeterNygard is the second of #PrinceAndrew’s associates to be accused of sex crimes, following his link to billionaire paedophile #JeffreyEpstein.\n\nThe victims have filed a civil lawsuit against 77 year old Nygard.\n\nAccording to the lawsuit, Nygard “recruited, lured and enticed young, impressionable and often ­impoverished children and women, with cash payments and false ­promises of lucrative modelling ­opportunities to assault, rape and sodomise them”. The Mail Online reports: A lawsuit filed in the Southern District of #NewYork claimed that Nygard plied his subjects with alcohol and drugs before they were violently assaulted, raped and sodomized.\n\nThe case could prove embarrassing for Prince Andrew – who once stayed at Nygard’s mansion – linking him to another high profile billionaire accused of sexual abusing young women.\n\nThe #DukeofYork has already faced intense scrutiny for his relationship with paedophile Jeffrey Epstein. \nIn the latest case, the teenagers have launched a class action lawsuit in #Manhattan federal court, claiming to have been a part of what was essentially a ‘sex trafficking ring.’ The suit alleges the girls would be entertained at so-called ‘pamper parties’ where Nygard would have bartenders at his Mayan-themed vacation home spike their drinks with the ‘date-rape drug’, known as #Rohypnol. \nNygard’s staff were instructed to find young women for the weekly parties, the lawsuit claims. \nAs guests arrived and checked-in, their details would be placed into a database with the photos sent to Nygard to look over. \nNygard would then use this information to select his potential victims for the night,’ the suit states.\n\nThe lawsuit details how one of the victims who was 15-years-old at the time had been taken to Lyford Cay, Nygard’s estate, which was once featured on the TV show Lifestyles of the Rich and Famous. 🖐🏾More in comments👇🏾#LolitaExpress #PedoGate #PizzaGate #StopHumanTrafficking #EpsteinDidntKillHimself",
    "tags": [
        "Qanon"
    ],
    "year": "2"
}