{
    "filename": "B8ZpYJyBwzl.jpg",
    "description": "#DeepState actors responsible for the #Russiancollusion investigation are “gonna go to jail,” Sen. Lindsay Graham warned Sunday during an interview with Judge Jeanine Pirro on Fox News Channel.\n\nSen. Graham assured Judge Jeanine the traitors behind the Russian collusion hoax and attempted coup of the Trump presidency will not go unpunished.\n\nThe #SouthCarolina Senator fired a warning shot at former #presidentBarackObama, stating that he is going to call former FBI leaders as witnesses to testify before Senate committees regarding FISA abuses and investigate right up to the Obama White House.\n\nSen. Graham: Half the People behind the Russian investigation are gonna go to jail, and Trump was cleared…\n\nJeanine Pirro: When? Hopefully.\n\nSen. Graham: Well, just hang tight…\n\nSpecial Counsel Robert Mueller’s investigation took two years, cost tens of millions of dollars, and wasted everybody’s time. Mueller ultimately found no collusion between President Trump or any #American and Russians attempting to interfere with the 2016 presidential election.\n\n#WashingtonDC, also known as the Swamp, is infested by political weaponization of government, law enforcement, and media, the likes of which #America has never before seen — all coordinated and perpetrated by the Democrats, the mainstream media and their Deep State comdrades.\n\nAccording to The New York Times, the FBI secretly investigated President Trump based on fabricated claims that he was working with the Russians against American interests.\n\nDue to media pressure, they officially launched the “investigation” — which they had long been running unofficially — after the President rightly and justifiably fired James Comey.\n\nAs a pathetic excuse, the disgraced and fired former FBI Assistant Director Andrew McCabe and Agent Peter Strzok focused on isolated and innocuous statements made by Donald Trump regarding Russia during and after the 2016 campaign. 🖐🏾More in comments👇🏾",
    "tags": [
        "Deep State"
    ],
    "year": "2"
}