{
    "filename": "B8Zz_Ieh9Bv.jpg",
    "description": "While #Coronavirus has officially reached 28 countries, with over 40,000 people officially infected and over 900 fatalities, #NorthKorea - which has a woefully ill-prepared medical infrastructure, is concealing a massive outbreak of the disease, according to the Daily Beast.\n\nThere have been reports filtering out about North Koreans falling prey to coronavirus despite Kim Jong Il sealing its 880-mile border with #China, \"\"\"\"most of it along the #YaluRiver into the Yellow Seat to the west,\"\"\"\" as well as its 11-mile border with Russia.\n\nOne sure sign of the regime’s fears is that it failed to stage a parade in central #Pyongyang on Saturday, the 72nd anniversary of the founding of the country’s armed forces. Last year, Kim Jong Un himself presided over the procession that displayed the North’s latest missiles and other fearsome hardware along with goose-stepping soldiers in serried ranks.\n\nThis year, nothing about the nation’s nuclear warheads, much less the “new strategic weapon” that Kim has vowed to unveil. Rodong Sinmum, the newspaper of the ruling Workers’ Party, merely cited the armed forces’ supposed success combating “severe and dangerous difficulties”—and said nothing at all about the parade. -Daily Beast\n\nSouth Korean news outlet Daily NK, meanwhile, reported that five people had died in the northwestern city of #Sinuiju - which borders the key trade border town of #Dandong, the largest Chinese city in the region located along the Yalu River. The Daily, relying on sources within North Korea, reports that authorities had \"\"\"\"ordered public health officials in Sinuiju to quickly dispose of the bodies and keep the deaths secret from the public.\"\"\"\" The #novelCoronavirus is suspected to have crossed into North Korea via the porous Yalu River border despite attempts to #quarantine the country.\n\nOne of the first patients in North Korea reportedly was hospitalized in Sinuiju “with symptoms similar to a cold and was given fever reducers and antibiotics,” said Daily NK, but the patient died as the fever rose. Two more patients died two days later in another hospital in Sinuiju and another two in a nearby town. 🖐🏾More in comments👇🏾",
    "tags": [
        "Other"
    ],
    "year": "2"
}