{
    "filename": "B9DfZQqBfsq.jpg",
    "description": "#JulianAssange’s lawyer claimed this week in court at his extradition hearing that the U.S. wanted to murder the #WikiLeaks founder and make it look like an accident. \n#American spies teamed up with #UCGlobal, a #Spanish company contracted by #Ecuador to provide security at the embassy, to help plant “intrusive and sophisticated” secret surveillance of Assange, his attorney stated during the court hearing. Assange was even filmed meeting with his legal team and was so paranoid about constant surveillance that he started sleeping in a tent inside his bedroom, the Telegraph reported. “There were conversations about whether there should be more extreme measures contemplated, such as kidnapping or poisoning Julian Assange in the embassy,” Assange’s attorney, Edward Fitzgerald, told the court, according to the Daily Mail.\n\nUC Global’s owner David Morales, was exposed by a mysterious whistleblower known only as “Witness Two,” the report stated.\n\nWitness Two revealed that Morales “said the #Americans were desperate and had even suggested more extreme measures could be applied against the guest to put an end to the situation,” Fitzgerald told the court according to the Mail.\n\nMorales was actively working with “the dark side—in other words, US intelligence agencies,” Fitzgerald claimed, according to the report. Assange was spied on in the Ecuadorian Embassy and the suspects at the time had tried to extort 3,000,000 million euro from the journalism organization for the destruction of the videos and pictures, which included videos of private situations such as doctors visits and lawyers meetings while he was in the embassy, Reuters reported.\n\nSince then, police have made at least one arrest. Ring leader Jose Martin Santos, previously convicted for fraud, was arrested in Alicante for trying to bribe WikiLeaks with millions in exchange for private videos of Assange.\n\nThat plot was later tied to the CIA, who hired UC Global S. L. and its founder David Morales to spy on Assange according to court documents that were presented to Spain’s High Court, El País reported. 🖐🏾More in comments👇🏾#FreeJulianAssange",
    "tags": [
        "Other"
    ],
    "year": "2"
}