{
    "filename": "B9hEk5aHTQS.jpg",
    "description": "Philip Schneider worked as a geological engineer, contracting for the U.S government in the construction of the program Deep Underground Military Bases (DUMBs). Area 51, one of the many highly classified subterranean bases allegedly inhabited by the \"\"\"\"\"\"\"\"alien\"\"\"\"\"\"\"\" Greys doing experiments on humans & hybrid creatures. According to Schneider, these bases are interconnected through subterranean tunnel system spanning across the U.S. Eventually tensions built resulting in a firefight exposing the lower levels of Dulce base. After Phil released this interview disclosing the truth about the government's cover up of aliens & UFO'S, he was assassinated.\nThis is the narrative they want us to believe...☝️\nWhat is the truth though? If the earth is flat with a impenetrable firmament according to Dr. John Mack, Department of Defense & Brett Salisbury ex US Intelligence. If it divides & holds the waters above the FIRMmament according to the Book of Genesis. \nThen who are these beings Phil claims the government is hiding from us? The video is much longer but in this part Phil is revealing that many alien beings exist, including this highly intelligent benevolent being with 6 fingers. In the Bible men with 6 fingers are the offspring of angel/human, a race of giant Nephilim humanoids.\n2 Samuel 21:20 And there was yet a battle in Gath, where was a man of great stature, that had on every hand six fingers, and on every foot six toes.\nThe government is purposely pushing this notion of alien races from other worlds. Meanwhile the Bible tells us these are the offspring of the angels that rebelled. Do you see how everything connects? Flat Earth & the Bible is the missing piece of the puzzle & they don't want us to piece it together. Did I mention that Aliester Crowley summoned a demon by the name of Liam? Crowley also drew a picture of that demon. Guess what it looked like. The very same Grey Alien Phil encountered.\nVideo credit @pineal_activator\n#aliensaredemons #aliestercrowley #alien #area51 #ufo #newmexico #roswell #greyalien #thor #giants #nephilim #hybrid #humanoid #flatearth #genesis #firmament #dumbs #undergroundbases #philschneider #usgovernment #wakeupsheeple",
    "tags": [
        "Other"
    ],
    "year": "3"
}