{
    "filename": "B9s5A9tBshm.jpg",
    "description": "Federal judge Anthony Trenga ordered a jail in #Alexandria, #Virginia, to release #UnitedStates #Army whistleblower #ChelseaManning. The order came after the grand jury investigating #WikiLeaks was dismissed.\n\nManning was confined for 365 days or one year after being held in civil contempt because she refused to testify before a grand jury empaneled to investigate WikiLeaks. She attempted to commit suicide on March 11.\n\nDuring her time in jail, Manning accumulated $256,000 in fines. She faced a fine of $500 per day for 30 days. That increased to $1,000 per day until she was released.\n\nTrenga refused to waive these fines. She will still owe over a quarter of a million dollars.\n\nIn August, Trenga ruled, “Manning has the ability to comply with the court’s financial sanctions or will have the ability after her release from confinement. Therefore, the imposed fines of $500 per day after 30 days and $1,000 per day after 60 days is not so excessive as to relieve her of those sanctions or to constitute punishment rather than a coercive measure.” Manning’s legal team challenged the court. “She has no personal savings, an uncertain speaking career that has been abruptly halted by her incarceration, and is moving her few belongings into storage, as she can no longer afford to pay her rent.” Furthermore, according to her legal team, Manning attempted to share her financial records with the federal court in an effort to show that she has debt and a “compromised earning capacity,” which has “left her balance sheets near zero.” But the court apparently never completed a financial assessment of her ability to pay fines.\n\nWhile Manning was in jail, #UnitedNations Special Rapporteur on Torture Nils Melzer condemned the U.S. government’s “coercive measures” against Manning. 🖐🏾More in comments👇🏾#FreeJulianAssange",
    "tags": [
        "Other"
    ],
    "year": "3"
}