{
    "filename": "B9Su5tFhmJ9.jpg",
    "description": "Thoughts?\n\nGiven the state of media watchdogs these days, I will say right off the top, I am not claiming that #VitaminC can cure or protect you from coronavirus/#COVID19, nor is the doctor featured in this article. Regardless, I do believe when it comes to journalism and helping people explore how to thrive, stories should be told.\n\nWe have been receiving a great deal of requests to write about various Coronavirus stories to help spread the word on different cases. We have shied away from some due to the strong-arming of fact-checkers. Some stories we looked into simply didn’t hold up, and others we felt were worth sharing to help create a conversation around various therapies that may show promise.\n\nBefore we get into the story below, note that having fear, stress or panic about contracting any virus is not going to help your immune system, and so the first thing you can do is utilize various techniques to maintain calm if the coronavirus news happens to be inducing stress. Breathing techniques, for example, can be helpful in reducing stress. Breathe in for 4 seconds, hold for 4 seconds, breathe out for 4 seconds, hold for 4 seconds. Repeat.\n\nAt the moment, there is a lot of effort being put in by mainstream media, the WHO, tech giants and fact checkers to claim that any mention of vitamin C as a possible treatment is “fake news.” This is the case even when content isn’t claiming that Vitamin C is a cure, but instead simply shares information and poses questions.\n\nThis is simply not true, as clinical trials examining the efficacy to treat the the virus have already begun. According to the doctor in the video below, three in China have already begun, as he states on his Youtube channel in multiple videos that he has posted.\n\nCNBC article discussing how big tech and the WHO works to shut down talks about vitamin C.\n\nRegardless of that, it’s important to continue to have this conversation even if that means having your reach and revenue cut down as a publisher. Although it shouldn’t be, we are not claiming anything here but rather presenting information from a Doctor that is currently in China and directly involved with investigations.",
    "tags": [
        "Other"
    ],
    "year": "3"
}