{
    "filename": "B9U_HIPnWaz.jpg",
    "description": "This post is so controversial. I realize that. I have prayed that as I share this you realize I’m doing so out of love. Out of a desire to protect. I would hate to hurt anyone with these words. But I’ve realized that I would hate even more for people whom I love to suffer the consequences that our family has suffered because we just didn’t know. And I wish someone I knew would have shared this with me. So here it goes. ⁣⁣⁣\n⁣⁣⁣\nThis is my six-year-old. Samson. He loves to snuggle, jump, build, read, explore, and so much more. He is full of life. He also has Type One Diabetes. Here he is showing off his continuous glucose monitor that he wears at all times. This disease is 24/7. There are no breaks. It threatens his life each day. His diagnosis came a few months after he received a some vaccines at 18 months. At almost two-years-old he had been onset for a while, and we just hadn’t known what was wrong. At the time no one made the connection. No one suggested that the diagnosis could have been linked to a vaccine. We were told it was a totally random disease.⁣⁣⁣\n⁣⁣⁣\nI believe that the people who told us that believe it. I do not think they lied or withheld information from us. But they were wrong. They were misinformed. The things the learned about vaccines were taught by the very ones who profit from them. The same ones who skipped the crucial step of conducting medical trials, and they can because vaccines aren’t technically a “medication”. ⁣⁣⁣\n⁣⁣⁣\nI’ve researched this so much that I feel like I could explode with medical jargon and statistics. I could ramble on forever about it, but I will finish up with just a few thoughts. ⁣⁣⁣\n⁣⁣⁣\nFirst, do your research. Look into these things that you’re putting into your body and the bodies of your children. Even if you have a different opinion. It’s always good to know the other side. After all, I used to vaccinate my children⁣⁣⁣\n⁣⁣⁣\nSecond, if you want to talk to me about this personally PLEASE do! I know it is controversial, but it doesn’t have to be hostile. I’d be so happy to discuss this calmly with anyone who would like to. ⁣⁣⁣(cont. in comments)👇🏼",
    "tags": [
        "Other"
    ],
    "year": "3"
}