{
    "filename": "B9wd6nhpTGq.jpg",
    "description": "We need to spread this message!!! You are panic buying and reacting to fear which is feeding the whole cycle of panic buying, you see other people doing it, you do it! You see shelves empty, you panic and stock up on what you can get your hands on! And you don’t need to! \nSocial media, tv, scare mongering and fear is the cause of all this! .\nI appreciate the worry for the elderly for this virus and it’s very concerning for them (over 70yrs old), but again what about those that can’t get to the shops, those that are working, those that are getting on with normal lives but still being cautious and just trying to do there normal weekly shop. All this fear is just feeding the whole cycle and causing more problems! .\nFar more people have died from accidents, car accidents, illnesses of other kinds, and more but we don’t worry daily not knowing when we go out to work everyday, if we are going to come home to our families! We don’t panic buy do we! .\nWe need to help share this fear of running out of food and stop it!, and other things when clearly we are being told not to do it! I fear for people me and how they get on in life because everyone has gone “mad” and there is no such need! (I class myself as a vulnerable person with having previous cancer treatment, and a recent operation and I’ve not been well!) no I’m not a hero! I’m just not worried in the slightest because clearly as it stands, if I catch it....Ill deal with it! The only thing people are worried about stock piling there house, and not the actual virus itself! .\nIt just shows how selfish the general public actually is and it’s unfair for those that will go without!!!” .\nI might be wrong with what I’m saying, but It just shows what the power of social media can do and the fear monger! We all need to stay positive, remain vigilant and work together! #positivity .\n#tomsnutrition #coronavirüsü #coronavirus #panicbuying #stoppanicbuying #aldi #asda #tesco #sainsburys #homebargains #marksandspencer #lidl #foodshopping #foodshop #stockpile #healthandsafety #positivityiskey #shopping #fearmongering #news #groceryshopping #foodshopping #weeklyshop #mealprep #foodplan",
    "tags": [
        "Other"
    ],
    "year": "3"
}