{
    "filename": "B_2aqO3j5Sn.jpg",
    "description": "I’m seeing a lot of Articles (one recently published by The New York Times) linking protesters and the “Anti Vax” movement. Have these journalists ever considered that the SAME people who fought, lobbied & peacefully protested against UNCONSTITUTIONAL government overreach like FORCED medical mandates, would also protest against other unconstitutional forced government overreach issues?\n⠀⠀⠀⠀⠀⠀⠀⠀⠀\nDo not be manipulated my friends! The reason they are beginning to link “ANTI VAXXERS” to this topic is so they can convince YOU that you should welcome the pending, planned and RUSHED Coronavirus vaccine, they are going to FORCE on you and your family!\n⠀⠀⠀⠀⠀⠀⠀⠀⠀\nIf you don’t blindly accept this vaccine or you raise questions and pause (like I did) you will be labeled an ANTI VAXXER, a CONSPIRACY THEORIST, a MURDERER, and a TRUMPISTS and any other nasty, derogatory and discriminatory terms they will inevitably come up with to publicly shame you into conceding to their demands!\n⠀⠀⠀⠀⠀⠀⠀⠀⠀\nWAKE 👏🏼 THE 👏🏼 F 👏🏼UP👏🏼\n⠀⠀⠀⠀⠀⠀⠀⠀⠀\nInstead of a Medical Freedom Advocate they will call you a ANTI VAXXER.\n⠀⠀⠀⠀⠀⠀⠀⠀⠀\nInstead of a Free Thinker and Researcher they will call you a CONSPIRACY THEORIST. ⠀⠀⠀⠀⠀⠀⠀⠀⠀\nInstead of a financially struggling mother or father, business owner, unemployed/ inessential worker they will call you a MURDERER.\n⠀⠀⠀⠀⠀⠀⠀⠀⠀\nInstead of a fed up Liberal, Democrat, Independent, or republican (many of whom hated trump) they will call you a TRUMPIST and then a RACIST.\n⠀⠀⠀⠀⠀⠀⠀⠀⠀\nAnd then lastly when you wake up and become an advocate and and activist they will call you a ANARCHIST and eventually they will label you a TERRORIST.\n⠀⠀⠀⠀⠀⠀⠀⠀⠀\nBe ready!\n⠀⠀⠀⠀⠀⠀⠀⠀⠀ #medicalfreedom #womensrights #informedconsent #advocatelikeamother #childadvocate #healthfreedom #educatebeforeyouvaccinate #idonotconsent #learntherisk #mybodymychoice #reproductiverights #reproductivejustice #justasking #justaskingcampaign #believemothers #freedomkeepers #prayforcalifornia #civilrights #civilrightsmovement #conspiracyrealist #billgates #inthistogether #coronavirus #gavinnewson",
    "tags": [
        "Bill Gates"
    ],
    "year": "5"
}