{
    "filename": "B_3v70kBY1T.jpg",
    "description": "#China has refused to allow international experts into the country to investigate the source of #COVID19 until a \"\"final victory\"\" is secured over the virus, according to #Beijing's UN ambassador Chen Xu.\n\nAccording to France 24, China's first priority is beating the pandemic, then countering \"\"absurd and ridiculous\"\" claims by the #UnitedStates that the virus likely escaped from a Wuhan lab known for experimenting with bat #coronaviruses - which were modified for transmissibility to humans in highly criticized experiments. \"\"The top priority, for the time being, is to focus on the fight against the pandemic until we win the final victory,\"\" said Chen, adding \"\" We need the right focus and allocation of our resources.\"\" Chen hit back against claims that China was against the international probe, insisting that Beijing isn't \"\"allergic to any kind of investigations, inquiries or evaluations,\"\" according to the report. \"\"We need to race with time to save lives as much as we can,\"\" he added. \"\"For whether or how the invitation will take place, we need to have the right priority setting at this moment, and on the other hand, we need the right atmosphere.\"\" US #PresidentDonaldTrump has been increasingly critical, saying last week he had seen evidence linking Covid-19 to a maximum-security virology lab in Wuhan and threatening new trade tariffs.\n\nUS Secretary of State Mike Pompeo on Wednesday renewed criticism of Beijing’s handling of the outbreak. \"\"China could have spared the world a descent into global economic malaise. They had a choice but instead – instead - China covered up the outbreak in Wuhan,\"\" Pompeo told reporters. \"\"China is still refusing to share the information we need to keep people safe,\"\" Pompeo added. -France 24\n\nThis past weekend, Secretary Pompeo said there was \"\"enormous evidence\"\" that the coronavirus escaped from the Wuhan lab. On Wednesday, China said Pompeo \"\"doesn't have any\"\" evidence. \"\"I think this matter should be handed to scientists and medical professionals, and not politicians who lie for their own domestic political ends,\"\" said foreign ministry spokeswoman Hua Chunying during a press briefing in Beijing. 🖐🏾More in comments👇🏾#Event201",
    "tags": [
        "Bill Gates"
    ],
    "year": "5"
}