{
    "filename": "B_5PFinhC9I.jpg",
    "description": "Peter Nilsson, a professor of internal medicine and epidemiology at #LundUniversity, warns that the economic devastation caused by lockdowns will cause more deaths than the #coronavirus itself.\n\nNilsson was commenting on #Sweden’s approach to coronavirus, which unlike virtually every other western country in the world didn’t impose a lockdown to fight #COVID19.\n\nThe tactic appears to have worked, with Sweden’s ‘R’ rate of infection being roughly the same as the UK’s, a country which did impose a lockdown. The country also now has much more widespread #herdimmunity and didn’t sacrifice its economy, meaning deaths from poverty will be reduced.\n\nOpining that he thinks this will “prove to be a good strategy in the long run,” Professor Nilsson said the approach had succeeded in preventing a spike in unemployment. “It’s so important to understand that the deaths of COVID-19 will be far less than the deaths caused by societal lockdown when the economy is ruined,” said Nilsson. “Why? Because of unemployment and all the social problems with it. A bad economy will hurt and kill people in the future.” Mikael Rostila, professor at the Department of Public Health Sciences at the #StockholmUniversity, echoed Nilsson’s sentiments in arguing that Sweden is now in a much better position than other countries. “Sweden could reach heard immunity earlier than other countries which means that the spread of the virus and the number of deaths will decrease since a majority of the population will be immune,” said Rostila. “Other countries that start to reopen now may experience a second wave of the virus. So it might be that they have just postponed a severe outbreak.” As we previously highlighted, a data analyst consortium in South Africa found that the economic consequences of the country’s lockdown will lead to 29 times more people dying than the coronavirus itself.\n\nMeanwhile, people across the #UnitedKingdom are demanding their own lockdown be continued indefinitely, with the hashtag #KeepTheLockdown trending number one on Twitter. #Event201",
    "tags": [
        "Bill Gates"
    ],
    "year": "5"
}