{
    "filename": "B_EF_SKnEbh.jpg",
    "description": "On April 13, 2020, the following report was released: \"\"\"\"In a stunning turn of events, Surgeon General Jerome Adams explained in an interview on live XM radio, that the Coronavirus Task Force has, effectively, dumped the Bill Gates/CDC/WHO predictive contagion model, and is now working with the real data. He explained on the Sirius XM’s Breitbart News Daily host Alex Marlow, that given the new data, businesses will begin to re-open as early as May, others in June.  This runs contrary to the out-and-out fear-mongering of Dr. Fauci and Bill Gates who have made a media tour, threatening the public that businesses may not re-open for six months to a year, or until and unless governments purchase their conveniently patented, big-pharma vaccination. According to Dr. Adams: “What the American people need to know now is we actually have data, and so we’re tracking that data,” Dr. Adams was working with’predictive models’, created by the Gates dominated WHO and CDC. Dr. Fausti’s control over the CDC has been criticized for its for-profit motive in handling a range of illnesses from HIV to H1NI. In those inflated, ‘fear-based’ models, the deaths of millions worldwide, and hundreds of thousands in America, were touted. Many experts have termed this a ‘grossly disproportionate response‘. Models predicting deaths of millions and hundreds of thousands in America appear to be overblown, as real-time data showing death count much lower.\"\"\"\" That's assuming the numbers reported are accurate. Even if accurate, they are still below the average flu season and this years flu season. With false positives, change in criteria to attribute death to Covid-19 despite other significant co-morbidity, and misreporting by the media, the numbers would be even lower.  Click link in profile for more resources. Pass this on. Part 2 tomorrow\n#covid_19 #covid #conspiracy #conspiracytheory #corona #patriots #patriot #patriotic #patrioticnation #DrButtar #AHEADMAP #AdvancedMedicine #AdvancedMedicineConference #IADFW #Fitness #Longevity #livelonger #livehealthy #power #facts #knowledg #truth #empowerment #freedomwriters #livefree #livefreeordie #populationcontrol #whistleblower #soldiers #endlockdown",
    "tags": [
        "Other"
    ],
    "year": "4"
}