{
    "filename": "B_EWkxbBY_Q.jpg",
    "description": "#Michigan Governor Gretchen Whitmer faces at least two federal lawsuits challenging her April 9 executive order to combat the #coronavirus outbreak, including requirements that residents stay at home and most businesses close.\nIn complaints filed on Tuesday and Wednesday, several Michigan residents and one business accused the Democratic governor of violating their constitutional rights by imposing her \"\"\"\"#StayHome, #StaySafe\"\"\"\" order.\n\nThe plaintiffs in Wednesday's lawsuit \"\"\"\"reasonably fear that the draconian encroachments on their freedom set forth in this complaint will, unfortunately, become the 'new norm,'\"\"\"\" according to their complaint.\n\nWhitmer's office did not immediately respond on Thursday to requests for comment.\n\nThe governor's order provides that residents cannot leave their homes except for essential services such as food or medical supplies, or engage in outdoor physical activity. It also bans travel to second homes and vacation properties.\n\nBusinesses, meanwhile, cannot require workers to leave their homes unless they are necessary for basic operations or to \"\"\"\"sustain or protect life,\"\"\"\" like grocery store and healthcare workers, and law enforcement. The order lasts through April.\n\nBoth lawsuits say Whitmer's order deprives residents of their constitutional right to associate with other people under the #FirstAmendment and their right to due process.\n\nOne lawsuit says the order amounts to an #unconstitutional taking, while the other says the closing of gun shops violates the #SecondAmendment right to bear arms.\n\nWhitmer is among several state governors, including both Democrats and Republicans, who have in some public opinion polls received high marks for their responses to the pandemic.\n\nThe plaintiffs in Tuesday's lawsuit filed in Detroit include four Michigan residents. One owns a landscaping business, and another said he is forbidden to see his girlfriend of 14 years because they live in different homes.\n\nTwo lawyers and the owner of a different landscaping business are plaintiffs in Wednesday's lawsuit, which is being handled in #GrandRapids. #PowerToThePeople",
    "tags": [
        "Other"
    ],
    "year": "4"
}