{
    "filename": "B_ho2MNgZDi.jpg",
    "description": "3,000 followers!! 🎉🙌🏼. .\n.\n\nWelcome to everyone new here and thank you to those who have been following along and giving me awesome feedback over the past year as I have stretched my wings and become more and more confident sharing on controversial topics. Informed Consent is so important to me and I love how many people are interested in these topics and open minded enough to keep learning and searching for the truth. Y’all inspire me. ✨. .\n.\n\nFor a short introduction, hi my name is Beth! I’m a Christian, a wife to an amazing husband, mama of two boys, and also an RN since 2012. I work on a medical-surgical-telemetry floor in a small town hospital. I grew up an MK in beautiful Honduras in a children’s home my parents were a part of for 12 years. I’ve always wanted to help people and health is a huge passion of mine and something I am constantly learning about and realizing how little I was actually taught about it in nursing school. I want to eventually quit nursing and do something that aligns more with my values, but so far, have not found what exactly that looks like. In the meantime, I find much fulfillment in sharing knowledge here. .\n.\n.\n\nI have a wealth of information on this account. My IGTV section covers a myriad of topics and my highlights contain brief information on every CDC recommended vaccine for here in the US along with the infections they protect against, the notice and resultant communication between ICAN and HHS concerning vaccine safety (the most comprehensive documents on this topic available to date), along with many other related topics. Feel free to watch and ask questions if anything is unclear. .\n.\n.\n\nLove to you all and may God bless you with a love of knowledge, responsibility in owning that knowledge, and finding the truth! ♥️🙏🏼✨\n———————————————\n#informedconsent #nursesformedfreedom #believemothers \n#medicalfreedom",
    "tags": [
        "Other"
    ],
    "year": "4"
}