{
    "filename": "B_i-AillUnj.jpg",
    "description": "Did you know that the federal government of the United States of America has paid out over 4 billion dollars since 1986 to individuals and families of individuals who have suffered due to harm or death from vaccinations? ⁣\n⁣\nYet mothers who are brave enough to come forward and say that their child had a reaction to a vaccine are mocked and gas lighted until they are silenced on the daily. ⁣\n⁣\nI think Eli Wiesel said it best in his book Night when he said, \"\"They are committing the greatest indignity human beings can inflict on one another; telling people who have suffered excruciating pain and loss that their pain and loss were illusions.\"\" ⁣\n⁣\nBut isn't this what is happening? ⁣\n⁣\nThese doctors who dismiss mothers who come in crying because their child stopped talking, or walking, or worse, are now in a hospital bed clinging to life hours or days after a routine shot that was promised to be \"\"safe and effective.\"\" ⁣\n⁣\nIs the science really settled? ⁣\n⁣\nI certainly know it is not. ⁣\n⁣\nWhy do we have a society that bullies these mothers who have nothing to gain and everything to lose (their dignity, reputation, friends, maybe even family) by choosing to come forward? ⁣\n⁣\nI know I have felt this same judgement when my own child was injured.  How is it that society is so brainwashed that they can't see what is right in front of them?  How do we change this? ⁣\n⁣\nI am not sure what the answer is, but I know we must do something.  We must share, we must educate, we must respectfully debate those who say we are wrong. ⁣\n⁣\nBecause if we allow them to silence us, not only are we allowing them to deem our pain as an illusion, but we are giving them the power to decide if it is valid. \nIt’s time to use your voice mamas. Even if it shakes a little. 💪🏻🇺🇸",
    "tags": [
        "Other"
    ],
    "year": "4"
}