{
    "filename": "B_IdphdFk81.jpg",
    "description": "🛑 NO NEW NORMAL. SAY NO TO BILL GATES.\nI don’t usually get involved in politics especially in my social media platforms but I can’t sit back and watch this happening and not speak out and stand up for what myself and many others believe in.\nDo you know what this man is trying to do?! He has literally stepped down from his seat on the board at Microsoft to invest in “philanthropy”\nHe held an event called “event 201” which was a pandemic simulation of a “coronavirus” before the current outbreak. 🤔 He fricken owns 15% of the WHO, he has funded the lab in Wuhan, he is behind the pandemic movie on Netflix which coincidentally.... came out right as the virus did. And most importantly he funds huge HUGE amount of money and profits even more off va**ines.\nHe has openly spoke about population control where he said “with the proper use of new va**ines, public health and reproductive health services we should be able to lower the population by 10-15%” He is the head of the coronavirus task force! I mean.. really!\nHe is pushing ID2020 which is a microchip that is implanted so we can be scanned so they can keep track of our va**ine status. As well as social security #, name, address, and even bank account info.\nOH and guess what!? He is pushing and funding this new coronavirus va**ine and threatening we should open our country without it!\nI simply cannot understand how we have arrived at a position where Bill fu$&i!? Gates is controlling all the medical data, and determining global health policy simply because he has fat pockets. \nWorse than that is the fact there are only a small amount of the millions of global health professionals standing up to this complete lie we are being fed. \nDoes personal integrity mean that little to so many? \nA house of cards designed to instil fear, anxiety and depression through the media indirectly making trillions for the pharmaceutical giants. \nBefore you pump poisonous toxins into your children stop and look at the bigger picture. We are being funnelled with fake data from 1 source! Who is challenging that?\nI AM. @robertfkennedyjr I stand with you, and with all the others. #saynotobillgates #nonewnormal #standwithus #educatey",
    "tags": [
        "Bill Gates"
    ],
    "year": "4"
}