{
    "filename": "B_IEHM9nIpv.jpg",
    "description": "A New York Times reporter asked Robert F. Kennedy Jr. about the “conspiracy theory” that Bill Gates is developing an injectable chip to store vaccine records.\nRepost @robertfkennedyjr\n\nHere are the facts:\nThe Bill and Melinda Gates Foundation invested more than $21 million to perfect a “microneedle technology” that embeds, under the skin, a vaccination record visible by infrared light that can be read by a “minimally-adopted smartphone technology.” The technology will allow health officials to scan U.S. citizens to detect their vaccination compliance. A study funded by the Bill and Melinda Gates Foundation and published in December 2019 by researchers from MIT, the Institute of Chemistry of the Chinese Academy of Sciences, and the Gates-funded Intellectual Ventures Laboratory in Bellevue, WA, describes how “near-infrared quantum dots” will be implanted under the skin along with a vaccine to encode information for “decentralized data storage and bio-sensing.” Gates’ technology uses a tattoo-like mechanism to inject invisible nanoparticles subcutaneously. Gates’ researchers are now testing the implant with a vaccine against the COVID-19 virus.\n\nThe Gates-funded report boasts that the chip system will allow “house-to-house” compliance searches to be conducted by government enforcement teams with “minimal training,” and will “open up new avenues for decentralized data storage and biosensing.” The MIT paper is entitled “Biocompatible near-infrared quantum dots delivered to the skin by microneedle patches to record vaccination.” Gates began funding implantable tracking chips and ratio biotechnology in 2011 with a grant to TransDerm Inc. Gates is currently making multiple investments to develop different versions, including grants to Vaxxas Pty Ltd, Micron Biomedical Inc, Georgia Institute of Technology, and Vaxess Technologies Inc.\n\nI urge you to contact Bill Gates on his social media. Gently explain that tagging & tracking humans may appeal to his government cronies in totalitarian China, but those activities are inconsistent with American values & traditions.\n. . . \nNo conspiracy theory here. Just facts. More at Children’s Health Defense (link in bio).",
    "tags": [
        "Other"
    ],
    "year": "4"
}