{
    "filename": "B_k-BRKhYEU.jpg",
    "description": "Five businesses have filed a lawsuit against #Michigan Gov. Gretchen Whitmer and Michigan Department of Health and Human Services Director Robert Gordon, accusing them of violating #constitutionalrights by imposing a #stayathome order to curb the spread of #COVID19, the disease caused by the CCP (#ChineseCommunistParty) virus.\n\nLaw firm Butzel Long filed the suit (pdf) at the U.S. District Court, Western District of Michigan—Southern Division, on Monday. It claims Whitmer’s “Stay Home, Stay Safe” order, recently extended through May 15 though in an amended form that loosened some restrictions, is based on unproven assumptions about how deadly the CCP virus really is. “Based on speculative modeling on the infectiousness and lethality of a new coronavirus, Governor Whitmer has issued executive orders that have shuttered civil society, placed 10 million people under house arrest, and taken jobs away from nearly 1.2 million people, all without due process of law,” the plaintiffs allege in the complaint. “The Governor has not disclosed the data or methodology used to create the modeling that purportedly justifies this extreme action,” they claim.\n\nFurther, the claimants argue that by suspending the #FreedomofInformationAct through June 4, Whitmer has stymied efforts at assessing whether the models that predict COVID-19 case and death counts in the state of Michigan are sound.\n\nThey also argue that since Whitmer’s executive order was based on the goal of flattening the epidemic curve, meaning reducing the rate of new infections and deaths, by extending the lockdown despite the fact that Michigan’s COVID-19 curve has flattened, is unreasonable and unnecessary.\n\nThe plaintiffs—which include a residential brokerage, an executive property maintenance company, and an exporter of architectural and automotive glass—are seeking “a declaratory and injunctive relief,” meaning a relevant judicial statement and corresponding action... 🖐🏾More in comments👇🏾#OperationGridLock #PowerToThePeople",
    "tags": [
        "Other"
    ],
    "year": "4"
}