{
    "filename": "B_MOFN2HF6a.jpg",
    "description": "•\n•\n#saynotobillgates ✋\n#nonewnormal\n•\n•\n☝️Keine Regierung der Welt überweist so viel Geld an die Weltgesundheits-Organisation (WHO) wie die Gates-Stiftung. Wer hat dann das Sagen?..\nIm Gegenzug empfiehlt die Stiftung der WHO, ihre Aufträge an Pharmakonzerne zu vergeben. Hier schliesst sich der Kreis: Auch die besagten Pharma-Uternehmen erhalten offenbar Millionenspenden von Bill und Melinda Gates. (Hoppala)..\n☝️Statt in Afrika die umweltfreundlichen Kleinbauern zu unterstützen, wird stattdessen Landwirtschafts-Konzernen ermöglicht, mit teurem Saatgut Kasse zu machen. Die weltweit bekannte Umweltaktivistin Vandana Shiva nannte die Stiftung die \"\"grösste Gefahr für die Bauern in den Entwicklungsländern\"\". Grüne Revolution: Fehlanzeige.\n☝️Der Welt wird der Mythos verkauft, dass private Wohltäter (Philantropen) wie Gates, Buffet, Elon Musk und Co. Lösungen für die Probleme der Welt bereit halten. Doch in Wahrheit drängen sie die Welt viel mehr in viele falsche Richtungen.\n•\n⚠️Die Strategie der BILL UND MELINDA GATES STIFTUNG sieht vor, die Rolle multinationaler Unternehmen im Bereich der globalen Gesundheit und insbesondere in der Landwirtschaft zu stärken, obwohl genau diese Unternehmen massgeblich für die Armut und Ungerechtigkeit verantwortlich sind⚠️\n•\nFINDE DEN FEHLER !!!\n•\nMach mit und teile das Bild mit dem Hashtag von oben.. •\nIch danke für Deine Aufmerksamkeit 😊\n•\n#weltfrieden\n•\n•\n•\n•\n•\n•\n•\n#gibgateskeinechance\n#solidaritypledge #billundmelindagatesstiftung #stayawake #traurig #machmit #fitness #fitfamgermany #fitfam #deutschland #berlin #nürnberg #bremen #dresden #köln #information #freiheit #liebe #nwo #chicago #johannesburg #südtirol #münchen #bamberg #gesundheit",
    "tags": [
        "Bill Gates",
        "New World Order"
    ],
    "year": "4"
}