{
    "filename": "B_NaVjHhgxm.jpg",
    "description": "#BillGates is funding the development of a #contraceptive microchip that will control women’s fertility wirelessly, via remote control.\n\nWhile the idea may be reminiscent of something out of a disturbing sci-fi movie, the technology is currently in development, with Bill Gates pouring millions of dollars into the project.\n\nIf Gates has his way, the day when women are implanted with the hormone-emitting human microchip is not far away.\n\nIt’s been six years now since the #Microsoft founder, a vocal proponent of #populationcontrol, announced plans for the development of a human microchip designed to control women’s fertility.\n\nResearch and development into the technology remains in progress, with Microchips Biotech listing the Bill and Melinda Gates Foundation as donors on the front page of their website: “With the support of the The Bill & Melinda Gates Foundation in the form of approximately $17.9 million in grant funding to date, and the potential for up to an additional $2.5 million in grant funding in 2020, Microchips has been developing an implantable long-acting, reversible contraceptive application of the technology.“ Townhall report: Measuring just 20 mm x 20 mm x 7mm, the tiny chip would be implanted under the skin, and automatically deliver a daily 30 microgram dose of the hormone levonorgestrol, via controlled release.\n\nIf a woman decides at some point that she would like to conceive a child, she is said to be able to deactivate the device with a remote control.\n\nThe microchip is designed to prevent pregnancy for up to 16 years.\n\nPeople familiar with the work of the Bill and Melinda Gates Foundation will not be surprised to learn that the wirelessly-controlled contraception device was purportedly Bill Gates’ idea.\n\nDuring Gates’ 2014 visit to an MIT laboratory, Bill asked if the microchip originally designed in the 1990s to deliver drugs to osteoperosis patients might also be developed into a long-term birth control plan. The company Microchips stepped up to the plate.\n\nThe Bill and Melinda Gates Foundation has a long history of advocating for population control, particularly in developing countries. 🖐🏾More in comments👇🏾",
    "tags": [
        "Bill Gates"
    ],
    "year": "4"
}