{
    "filename": "B_NJqNlhCM-.jpg",
    "description": "#ThisIsNotAHoax⁣\n⁣\nI can’t believe we even have to say this.⁣\n𝐁𝐮𝐭 𝐂𝐨𝐯𝐢𝐝-𝟏𝟗 𝐢𝐬 𝐧𝐨𝐭 𝐚 𝐡𝐨𝐚𝐱⁣\nThis pandemic is real and real lives are being lost⁣\n⁣\nDid you know there is a campaign on Twitter called #FilmYourHospital where people drive by their hospitals and film how quiet and empty they are to prove that this whole thing is made up? It’s one of the stupidest theories I have ever heard, but people seriously believe that the government and media are making all of this up and empty hospitals prove it. I don’t even have the patience to explain how stupid this really is.⁣\n⁣\nThe healthcare system is hemorrhaging right now. They are hemorrhaging money, resources, and their most valuable assets: their employees. If we had a broken healthcare system before, consider what this is going to do to it. We are going to hurt for a long time after this, BUT we will continue as long as necessary because as healthcare workers, we know what is right and what needs to be done to control this.⁣\n⁣\nWomen are delivering babies alone, loved ones are sick with no visitors for support, healthcare workers are getting sick without enough protective equipment, and people are dying. 𝘙𝘦𝘢𝘭 𝘱𝘦𝘰𝘱𝘭𝘦 𝘢𝘳𝘦 𝘥𝘺𝘪𝘯𝘨.⁣\n⁣\nThis is real and this is scary for us all.⁣\nPlease stay home. Please take this seriously⁣\n⁣\nThank you to my dear friend @drjenniferlincoln for starting this conversation. I encourage you to share your own stories with the hashtag #thisisnotahoax and read the stories of the true frontliners who are terrified to go to work every day.⁣\n⁣\n⁣\n⁣\n⁣\n⁣\n⁣\n#coronavirus #covid19 #stayhome #stayathome #physicaldistancing #socialdistancing #healthcareworkers #frontline #protectourdoctors #ppe #hospitals #believescience #factsoverfear",
    "tags": [
        "Other"
    ],
    "year": "4"
}