{
    "filename": "B_NqTtGBvin.jpg",
    "description": "Thoughts?\n\nFacebook has removed several pages promoting protests against state quarantine orders designed to slow the spread of coronavirus.\n\nThe social media giant acknowledged removing the posts promoting protests in California, New Jersey and Nebraska which violated measures taken by governors to slow the spread of COVID-19.\n\nFacebook has been the main main hub for the coordination and promotion of these events, bringing together anti-government and conspiracy-minded fringe activists, including militia groups, religious fundamentalists and anti-vaccination proponents, with the common cause of ending state and federal efforts to restrict freedom of movement to halt the coronavirus’ spread. -NBC News \"\"\"\"Unless government prohibits the event during this time, we allow it to be organized on Facebook,\"\"\"\" said Facebook. \"\"\"\"For this same reason, events that defy government's guidance on social distancing aren’t allowed on Facebook,\"\"\"\" said Facebook spokesman Andy Stone in a statement to the Washington Post. \"\"\"\"We do classify that as harmful misinformation and we take that down,\"\"\"\" said Facebook CEO Mark Zuckerberg on Monday during an appearance on ABC, adding \"\"\"\"At the same time, it’s important that people can debate policies so there’s a line on this, you know, more than normal political discourse. I think a lot of the stuff that people are saying that is false around a health emergency like this can be classified as harmful misinformation.\"\"\"\" The move by Facebook comes after dozens of protests were held in various states in recent weeks - with smaller gatherings marked by \"\"\"\"dozens or hundreds of protesters\"\"\"\" gathering in front of state capitols and governors' mansions while waving American flags and signs suggesting that the lockdown has infringed on their rights, according to NBC News.\n\nState governments have asked people not to attend the protests, as the groups have assembled without adhering to social distancing guidelines, and could risk infecting more people and lengthening the state shutdown measures. 🖐🏾More in comments👇🏾",
    "tags": [
        "Other"
    ],
    "year": "4"
}