{
    "filename": "B_nSEXqhKbz.jpg",
    "description": "Teenage #climatechange activist Greta Thunberg has sprung into action again, this time launching a fundraising campaign to help the children of the world survive #Covid19.\n\nPartnering with a Danish foundation, her campaigns aims to help finance the U.N. childrens’ agency’s emergency program to fight the #coronaviruspandemic.\n\nThe seventeen year also called on people everywhere “to step up and join me in support of UNICEF’s vital work to save children’s lives, to protect health and continue education.” She also reminded governments to keep fighting climate change during the pandemic. “Like the #climatecrisis, the #coronaviruspandemic is a child rights crisis” Thunberg was quoted as saying in the #UNICEF announcement.\n\nRT reports: The project will see the young activist partner with #Denmark’s #HumanActFoundation to pledge $100,000 each to the #UnitedNations International Children’s Emergency Fund (UNICEF), which brings humanitarian aid to children around the globe.\n\nThough the Covid-19 outbreak has largely spared the young, Thunberg nonetheless branded the pandemic a “child-rights crisis” in a statement announcing the new initiative on Wednesday, calling on people everywhere to “step up and join me in support of UNICEF’s vital work to save children’s lives.” Thunberg earned her bona fides as a climate soldier at the age of 15 after spearheading a school strike in her native Sweden to demand more aggressive action on climate change, but has since skyrocketed to worldwide fame, touring the planet to angrily lecture ‘adults’ on the dangers of petroleum-addiction. \nSome critics might argue that the virus – given her vision of “climate action” at any cost – is achieving precisely what she has always dreamed of: curtailing production, grinding air travel to a halt, slashing carbon emissions and reducing air pollution. Yet Thunberg has now made it her job to take on the coronavirus pandemic as well, calling on the world to “tackle two crises at once.” #Agenda21 #Agenda2030 #Agenda2050 #GreenNewDeal #GreenAgenda #Technocracy",
    "tags": [
        "Other"
    ],
    "year": "4"
}