{
    "filename": "B_O6ri9HUIH.jpg",
    "description": "This is why I'm unsympathetic toÂ conspiracyÂ theory: nobody is minding the store.\n\nEverybody is getting rich, so they don't have time to advance the Aryan race or the council of Zion or any of this fantasy and illusion that haunts the world ofÂ conspiracyÂ theory.\n\nRather, everything is being left to develop on its own because we're afraid to grab or touch the levers and buttons in the control room of the historical vehicle.\n\nWhat that means then is that people can cut through these many, many illusions: the illusion of materialism, of business as usual, of benevolent institutions carefully guiding us to reasonable destinies.\n\nIf you cut through all that, if you disabuse yourself of all that, you'll empower yourself to eventually be able to stand up in delicate social and political situations and just say: Bullshit! That's bullshit!\n\nWe've waited til the last moment of the last hour. The house is burning down around us and we rouse ourselves from the stupor of materialism, of religion, of scientism.\n\nIf we don't rouse ourselves from this stupor, the momentum toward extinction is practically irreversible.\n\nThere's a tremendous obligation upon us to attempt to deconstruct the bomb that we've inherited.\n\nBusiness as usual at this point is a death sentence on the human race.\n\nWhat has to be done is self-empowerment through deconditioning from propaganda, through deconditioning from the phobia that holds everyone within the preprogrammed molds being handed down from Madison Avenue and Hollywood.\n\nIt means actually realizing that your life is your own. Your destiny is your own, it isn't within the confines of the culture because the culture is dissolving, and to the degree that the word is put out, that phenomenon will accelerate.\n\nWe're in an extraordinary transition. Everything that has worked now doesn't. Meaning global economic systems, control of the spread of epidemic disease, and so on.\n\nAll these systems are breaking down, and yet the new systems are not yet in place.\n\nSo this is a situation of extraordinary malleability and a situation in which people of great vision can make tremendous impact. - Taxonomy of Illusion, 1993",
    "tags": [
        "Other"
    ],
    "year": "4"
}