{
    "filename": "B_OGpcQhaZi.jpg",
    "description": "Because of the underlying mutual links between #globalwarming hysteria and the #COVID19 panic, it is no wonder that green groups would make statements like this. Greening the world for #SustainableDevelopment, aka #Technocracy, is the red meat of the pandemic.\n\nWorking from home and other measures to help stem the spread of the #coronavirus outbreak in #Britain show how quickly the country could change its ways to address climate change too, participants in the Climate Assembly UK said on Sunday. “With coronavirus, (the government) has had to act because they had no choice in the matter. With climate change, they need to act in the same way,” said Marc Robson, 46, a British Gas installer and one of the 110 members of the citizens’ assembly.\n\nAs with the response to the COVID-19 respiratory disease, “people will die if we don’t do it”, the Newcastle resident warned in a video interview. “And we all need to buy into this as well. It needs to be explained to the public that if we don’t change what we’re doing, it’s going to cost us, big time.” The assembly, chosen to reflect Britain’s diverse geographic and demographic makeup, as well as different viewpoints on climate change, has met once a month in #Birmingham since January to hear from experts on climate science and policy.\n\nIt is expected to submit over the summer its recommendations to the government on how Britain should meet a legally binding goal to cut its climate-heating emissions to net zero by 2050.\n\nBut with coronavirus restrictions now in place on public gatherings, the assembly this weekend was held for the first time online – a change some assembly members saw as a “test run” for potential climate-smart shifts they had been discussing. “This has opened up my mind that we can make these changes, like working at home,” Robson told the Thomson Reuters Foundation.\n\nSarah Allan, the head of engagement at Involve UK, a charity helping run the assembly, said some members of the group had asked to discuss coronavirus during this weekend’s event and reflect on “how it makes them feel about what they’ve heard”. 🖐🏾More in comments👇🏾#Agenda21 #Agenda2030",
    "tags": [
        "Other"
    ],
    "year": "4"
}