{
    "filename": "B_oQvz-g1eG.jpg",
    "description": "• • • • • •\nLos Angeles, California\n\nEnough with the overreach- tyranny!!! If WEED and LIQUOR stores are considered essential and they can figure out how to remain open and protect their safety and those of their clients, what makes @gavinnewsom or @mayorofla think that small business owners aren’t smart, resourceful, responsible or care enough to do the same for themselves, their people and clients?\n\nThis is our livelihood and ability to care for ourselves and our families and yet these jerks continue to get paid regardless of their lousy decisions and short sightedness. Some of us are facing dwindling if not empty savings accounts, bankruptcies, loan payments, loosing business etc.\n\nI have yet to receive my “stimulus check,” submitted for an SBA loan 3/29 it’s still in “process,” the EDD no response yet and I’ve haven’t had work since 3/5 - I’m sure there are thousands more in my position, so grateful for my family and friends and my savings that are 💸. I would much rather CHOOSE to take my risks, be responsible and get back to work now before this government welfare plan!\n\nWe can’t even take walks at the wide stretches of beach because Newsom things were too stupid to stay 6ft apart or take any responsibility for our own health?! And wait sunlight is one of the things that kills this virus and we need Vitamin D which helps boost our immunity. Explain that to me?\n\nAnd for those of you that are immuno compromised (such as my mom) or choose to stay in quarantine I respect your decision by all means do what is necessary to maintain your health and well being and I will do the same.\n.\n#Repost @linda2744\n.\n.\n.\n\n#reopencalifornia \n#protests #wedonotconsent #opencalifornia #reopenamerica  #reopen #tyranny  #notmyvirus #California \n#givemelibertyorgivemedeath  #endthelockdown  #flattenthecurve #WeAreTheNewsNow  #openamerica #operationgridlock #londonrealarmy #maga #constitution #billofrights #openamericanow  #endmedicaltyranny #nonewnormal #digitalsoldiers #Repost #fucknewsom #fuckBillGates #firefauci #smallbusiness",
    "tags": [
        "Qanon",
        "Bill Gates"
    ],
    "year": "5"
}