{
    "filename": "B_pcbQojWEF.jpg",
    "description": "@georgedotnews - Follow me @the_real_jaysonlara For more\n・・・⠀\nDenied and Sued! 💥 The Michigan House of Representatives declined to extend Gov. Gretchen Whitmer’s state of emergency another 28 days, and instead voted on Thursday to sue her.⠀\n⠀\nWhitmer’s initial state of emergency order, which is separate from the stay-at-home order, expires on Thursday and requires legislative action to be lengthened.⠀\n⠀\nNegotiations on that front fell apart on Wednesday when Whitmer refused to make any concessions on the matter, asserting she has the ultimate control of emergencies.⠀\n⠀\nSo the House voted to authorize Speaker Lee Chatfield to sue the governor, saying Whitmer’s “unchecked and undemocratic approach” is not the best way, ABC 12 reported. “The current status quo relies on one-size-fits-all edicts that unfairly punish millions of people across the state without giving them any recourse or voice in the process,” Chatfield said. “The people deserve a better solution, and we can provide it.” The House also passed a resolution restricting a governor’s state of emergency declarations to 14 days. Whitmer has vowed to veto that legislation.⠀\n⠀\nHundreds of protesters gathered outside the capitol and demanded the state be reopened. “We want Michigan open, we want Michigan back to work,” Jason Howland, one of the protest organizers, told Fox 17. “We put the event together, we put it on Facebook, and we heard that they were taking down events that had to do with protests or rallies against the wishes of Whitmer,” he said.⠀\n⠀\n#protests #wedonotconsent #reopenamerica #reopennyc #liberate #reopencalifornia #reopen #tyranny #filmyourhospital #notmyvirus #givemelibertyorgivemedeath #endthelockdown #flattenthecurve⠀\n#WeAreTheNewsNow #opencalifornia #openamerica #operationgridlock #londonrealarmy #maga #constitution #billofrights #openamericanow #yoga #endmedicaltyranny #nonewnormal #digitalsoldiers #tuckercarlson #fuckBillGates #firefauci",
    "tags": [
        "Qanon",
        "Bill Gates"
    ],
    "year": "5"
}