{
    "filename": "B_qHXRVh0Ht.jpg",
    "description": "Starting in March in #California, paranoid citizens began calling their local police departments via 911 to report their neighbors — for coughing. Fast forward to this week, however, and we now have hotlines set up across the country designed to take calls from people just like the ones in California who call the cops to report their neighbors for coughing or improper #socialdistancing. In #NewYork, an NYPD whistleblower reportedly told the NY Post that cops are being forced to prioritize 311 snitching calls of social distancing over 911 emergency calls. “311 is more [of a] priority than someone getting robbed at gunpoint,” an NYPD source told The Post. “The NYPD is making it mandatory to answer 311 within 45 minutes, otherwise [the commanding officer] is gonna have to explain himself,” the source went on.\n\nAccording to the Post, not one but three NYPD cops have come forward to say they are being forced to prioritze snitching calls over actual emergencies. “People getting jumped, robbed, assaulted…. doesn’t matter…. my captain asks about why a 311 job is almost reaching 45 minutes [and] not being closed out yet,” the source said.\n\nNaturally, this is a claim the mayor’s office vehemently denies. “These claims are false and dangerous. It is a slight to the hardworking men and women of the NYPD to imply that they would not respond to a 911 emergency with anything but the utmost urgency,” City Hall spokeswoman Olivia Lapeyrolerie said.\n\nHowever, as the Post reports, commanding officers are under pressure to get 311 calls answered within 45 minutes to deal with surging social-distancing complaints, making it difficult for officers on the ground to accomplish that while also responding to 911 emergencies in a timely manner, according to sources.\n\nOn Monday, according to the report, a 911 call for a death inside a home took 5 hours for police to respond while the 45 minute mandate has been continually accomplished. “If the dead body was a 311 call, a unit would have responded in 45 minutes,” the source told the Post. 🖐🏾More in comments👇🏾",
    "tags": [
        "Other"
    ],
    "year": "5"
}