{
    "filename": "B_qjCi-hQun.jpg",
    "description": "Thoughts?\n\nAttorney General William P. Barr said Friday that it is time to curtail some of the restrictive #coronavirus measures imposed by local and state governments. “It is time to start rolling back some of these restrictions in an orderly and sensible way and the president has provided his Opening the United States Again plan that provides a sensible approach — framework — to that,” Mr. Barr said in a question-and-answer session on Twitter.\n\nMr. Barr revived his frequent criticism of rules put in place to mitigate the spread of the coronavirus. He has slammed some of the restrictions as “#draconian” and last week directed U.S. attorneys to take legal action if a state or legal measure violates #American’s constitutional rights.\n\nThe nation’s top cop said the government “unquestionably” has broad emergency powers during a pandemic, but cautioned that doesn’t mean it can get away with suspending civil liberties. “The Bill of Rights doesn’t go away during a crisis like this, but what it does do is it requires the government to justify any restrictions as truly necessary and ensure there are not other ways of addressing the government’s interests that are less burdensome on our rights,” he said Friday.\n\nHe said when the pandemic first struck, it was appropriate to impose social distancing and other measures because the virus “was very contagious and we didn’t want it to overwhelm our health care system.” But now the curve has been flattened and the hospitals are not overwhelmed, it is time to end some of the restrictive measures, he said.\n\nMr. Barr also said the Bureau of Prisons has released 5,000 federal inmates since the pandemic began and 1,000 more releases are in the pipeline.\n\nHe said only nonviolent inmates are being released and the government is ensuring all recently released offenders have a place to stay.",
    "tags": [
        "Other"
    ],
    "year": "5"
}