{
    "filename": "B_QlM3wD5pR.jpg",
    "description": "I’m about to go off, which we all have the right to speak about the things we care about.\n.\nLet’s clear the air. I respect and love everyone who has lost a loved one due to COVID-19. I am truly sorry for your loss and I so wish you weren’t experiencing such grief and pain. It truly is a heartbreak, and it’s painful. .\nI am forever thankful and grateful to those of you who are risking your life to help others get well and are then making the sacrifice to not be able to be with the people you love. I could never do what you do! So, thank you to all healthcare workers and first responders. 💜\n.\nHere’s what I’m angry about. The estimated numbers of new cancer cases and deaths in 2020. The estimated cancer cases are 1.8 million new cancer cases diagnosed and 606,520 cancer deaths in the United States. It is estimated that 1 in 3 people will be diagnosed with cancer in the year 2020 - statistics taken from the American Cancer Society. Yet, the government and big pharmaceutical companies continue to sell us the products that cause these deaths and new cases. They don’t stop production. IN FACT, they pump out more. They don’t test the safety of the chemicals, chemicals haven’t had safety testing since 1976. More people will die from cancer (and have been for years) yet they’re not telling the American people to stop using and buying Lysol, Clorox, Febreeze, Tide, perfumes, colognes, body lotions, hand soaps, Johnson & Johnson Baby Powder, wax melts, candles, dyer sheets, over the counter drugs, prescribed drugs, etc., oh and our food. ( let’s not even go there) The things that the FDA KNOWS CAUSES CANCER, yet you can buy them in any store.\n.\nHi, there is a documentary on Netflix called Stink. Do yourself and your children a HUGE favor, and watch it. Now. Then message me so we can go off together 🙌🏻 .\nOnly 5% of cancer is genetic. 90-95% of cancer is outside of your genes - it’s environmentally. From what we eat, breathe in, apply topically, clean our homes with, wash our bodies in, wash our clothes in and so fourth. .\nWHY AREN’T WE MAKING THIS A BIG DEAL?! *continued in the comments*\n#saynotobillgates #nonewnormal",
    "tags": [
        "Bill Gates"
    ],
    "year": "4"
}