{
    "filename": "B_qS1nZBfPC.jpg",
    "description": "After one of the worst mass shootings in recent #Canadian history in April (leaving 22 people dead), #JustinTrudeau has made a shock announcement on Friday afternoon that his government has banned assault-style weapons, reported The Guardian. \"\"\"\"These weapons were designed for one purpose and one purpose only: to kill the largest number of people in the shortest amount of time. There is no use and no place for such weapons in Canada,\"\"\"\" said Trudeau. \"\"\"\"Effective immediately, it is no longer permitted to buy, sell, transport, import or use military-grade assault weapons in this country.\"\"\"\" The #massshooting in #NovaScotia last week has been deemed the worst shooting in the country's history and has given Trudeau the cover to \"\"\"\"strengthen gun control.\"\"\"\" This was one of his major campaign promises, and he has seized the opportunity in a crisis. \nThe new ban is expected to prevent shootings like the one in Nova Scotia. The Royal Canadian Mounted Police believe the gunman did not have a license to purchase the weapons used in the shootings and were likely obtained illegally. \nTrudeau said there would be a two-year \"\"\"\"amnesty period\"\"\"\" to allow current gun owners to comply with the law. The ban covers more than 1,500 models. \nIn 2015, Trudeau promised that a Liberal government would restrict gun owners from certain types of rifles, including \"\"\"\"military-style assault weapons.\"\"\"\" \"\"\"\"As long as Canadians are losing their loved ones to gun violence, not enough has changed,\"\"\"\" Trudeau said in September. \"\"\"\"We know you do not need a military-grade assault weapon, one designed to kill the largest amount of people in the shortest amount of time, to take down a deer.\"\"\"\" Currently, Canada's Firearms Act does not make a clear distinction between \"\"\"\"military-style\"\"\"\" weapons and long guns. The new law will clear that up.\n\nAccording to a poll from the Angus Reid Institute, 80% of Canadians support the ban. However, there will be an uproar in the gun community that will see this latest gun grab as entirely unacceptable. And, keep in mind, the ban on assault-style weapons is coming during a virus pandemic. Is there are a larger agenda at play? #GunControl",
    "tags": [
        "Other"
    ],
    "year": "5"
}