{
    "filename": "B_SiPTBhpz8.jpg",
    "description": "As reported in my April 7, 2020, article \"\"\"\"\"\"\"\"#VitaminsC and D Finally Adopted as #Coronavirus Treatment,\"\"\"\"\"\"\"\" the largest hospital system in #NewYork, #NorthwellHealth, has been giving #COVID19 patients admitted into #intensivecare 1,500 milligrams of intravenous vitaminC three to four times a day in conjunction with the antimalarial drug #hydroxychloroquine and the antibiotic #azithromycin, both of which have shown promise in coronavirus treatment.\nAccording to Dr. Andrew G. Weber, a pulmonologist and critical-care specialist affiliated with two Northwell Health facilities on #LongIsland, \"\"\"\"\"\"\"\"The patients who received vitamin C did significantly better than those who did not get vitamin C. It helps a tremendous amount, but it is not highlighted because it's not a sexy drug.\"\"\"\"\"\"\"\" Curiously, Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases (NIAID) and the face of the #WhiteHouse coronavirus response team, is now saying life probably will not go back to normal until we have the ability to vaccinate the entire global population against COVID-19.3\nI say \"\"\"\"\"\"\"\"curiously,\"\"\"\"\"\"\"\" as just four short years ago, in a Washingtonian article,4\"\"\"\"\"\"\"\"How to Avoid Getting Sick When You're Around People All Day,\"\"\"\"\"\"\"\" Fauci touted vitamins C and D as being good for boosting your immune system and fighting infectious disease.\nVitamin C \"\"\"\"\"\"\"\"can enhance your body's defense against microbes,\"\"\"\"\"\"\"\" he said — a statement backed by recent research showing vitamin C supplementation lowers your risk of the common cold.5 At the time, Fauci said he was taking 1,000 milligrams (mg) of vitamin C, himself, every day. \"\"\"\"\"\"\"\"Many people also do not get enough vitamin D, which affects a lot of body functions, so that would be helpful, too,\"\"\"\"\"\"\"\" he added.\nYet, in a March 26, 2020, interview with RealClear Politics,6he changed his tune, saying there was \"\"\"\"\"\"\"\"no definite proof\"\"\"\"\"\"\"\" that the vitamins work, even though some studies show they do. What changed? Why did he say vitamins C and D help boost immune function and ward off infectious disease four years ago, only to deny it now? 🖐🏾More in comments👇🏾#GlobalHealthSecurityAgenda #VaccineAgenda #Event201",
    "tags": [
        "Bill Gates"
    ],
    "year": "4"
}