{
    "filename": "B_St9DghHcM.jpg",
    "description": "The state of #Missouri has filed a lawsuit against the #Chinese #communist government over the #coronavirus pandemic, claiming #China is responsible for the outbreak that has caused “enormous death, suffering, and economic losses they inflicted on the world, including Missourians.” The lawsuit, filed in the U.S. District Court for Eastern Missouri on Tuesday, alleges Chinese officials silenced whistleblowers and lied to the world about the nature of the coronavirus. ‘The Chinese government lied to the world about the danger and contagious nature of #COVID19, silenced whistleblowers, and did little to stop the spread of the disease,’ Republican Attorney General Eric Schmitt’s office said in a written statement. ‘They must be held accountable for their actions.’ ‘An appalling campaign of deceit, concealment, misfeasance, and inaction by Chinese authorities unleashed this pandemic,‘ the suit says.\n\nDailyMail report: This marks the first time a state has sued China over its handling of the COVID-19 outbreak. \nWorld leaders including #PresidentDonaldTrump, German Chancellor Angela Merkel, #French #PresidentEmmanuelMacron, #Australia’s Foreign Minister Marise Payne have expressed concerns over #Beijing’s transparency amid the virus.\n\nOn Monday 22 Republican lawmakers requested that the #Trumpadministration bring a case against China to the International Court of Justice for the country’s actions in the coronavirus pandemic. \nThe Wuhan Institute of Virology has been at the centre of conspiracy theories, which suggest that the killer virus originated there. The above picture, taken on January 31, 2015, shows researchers taking part in a drill at the newly-completed virus lab\nSchmitt’s office accuses China of negligence and claims the pandemic cost Missourians possibly tens of billions of dollars in economic damage. \nSchmitt’s office is seeking unspecified damages for deaths in Missouri and the hit the virus has taken on the state’s economy. 🖐🏾More in comments👇🏾",
    "tags": [
        "Other"
    ],
    "year": "4"
}