{
    "filename": "B_SVczznkl7.jpg",
    "description": "â›”ðŸ™Šâ›”\nWhat is occuring in the world right now has little to do with a virus and alot to do with an agenda that has been unfolding for a very long time by a hidden group of people who have been manipulating every aspect of life on earth through the control of economics, which then gives them access to every other tool necessary to covertly govern the world.\n.\nThis group has been labeled many things; #theilluminati #thecabal #thedeepstate #theelite #elitists #globalists #zionists #the1percent etc, but their significance isn't in what they are called, its in the positions of power they hold and their capacity to influence world events and the direction that society heads toward via the many strings they pull.\n.\nFor those who have become privy to them and their agendas & goals for humanity, it is VERY apparent as to what the bigger picture is when seemingly random world events are taking place, including this current \"\"#pandemic\"\" that has caused mass disruption to human life all across earth, which is that they are currently in a MASSIVE power grab for #CivilLiberties & #HumanRights\n.\nWhile their are multiple agendas at play and \"\"chess moves\"\" being made by this global cult, the key and most successful tactics being initiated to pacify and subdue the masses are #fearmongering & #propaganda which put people into a fearful, susceptible state, making them MUCH EASIER TO CONTROL.\n.\nNow obviously the way to combat these fear tactics which work on the premise of controlling information and public perception, is to SPREAD ALTERNATIVE INFORMATION which can counter the propaganda that is being broadcast by the mainstream media so as to help move people out of a fearful state where they percieve their survival is being threatened; which is what fear mongering does, it creates a psychological atmosphere where people now perceive that they are threatened which activates their sympathetic nervous system(fight, flight, freeze response) where they are no longer rationally or critically thinking and can be shepherded like a fearful herd animal.\n.\nSo what do they do to counteract the spread of alternative information and truth, they use their authoritarian powers to shut down... â¬‡â¬‡",
    "tags": [
        "New World Order",
        "Deep State"
    ],
    "year": "4"
}