{
    "filename": "B_TJfHrhhrk.jpg",
    "description": "As predicted, #climatechange alarmists are coming out of the woodwork to link #COVID19 hysteria to #SustainableDevelopment, aka #Technocracy. Greta promotes the use of ‘science’ in fighting threats to humanity.\n\nCountries have a chance to choose a new path as societies begin to return to normal after lockdowns imposed to prevent the spread of the #coronavirus, activist Greta Thunberg told an #EarthDay event on Wednesday.\n\nThunberg, who shot to fame as a 15-year-old when she started skipping school on Fridays to protest over carbon emissions outside #Sweden’s parliament building, said the outbreak showed the need for long-term thinking. “Whether we like it not the world has changed, it looks completely different from how it did a few months ago and it will probably not look the same again and we are going to have to choose a new way forward,” she said. “If one single virus can destroy economies in a matter of weeks, it shows we are not thinking long term and we are not taking these risks into account.” She was taking part in a streamed event to mark Earth Day, launched 50 years ago to highlight environmental challenges.\n\nLast year was the hottest on record in #Europe, according to a study released on Wednesday by the EU’s Copernicus Climate Change Service.\n\nThunberg’s school strikes calling for climate action sparked a global movement and transformed the now 17-year-old into the equivalent of an environmental rock star.\n\nDrawing on her statement to the #WorldEconomicForum last year, in which she said: “I want you to act as if our house is on fire. Because it is,” her #FridaysforFuture movement released a video to mark Earth Day showing a family carrying out their normal routine, despite flames licking round their home.\n\nBut not everyone agrees with her approach. U.S #PresidentDonaldTrump in December urged her to “work on her Anger Management problem, then go to a good old fashioned movie”. And while some still question the role of human activity in the rise in temperatures, opinions are also divided on the best approach to handling coronavirus. 🖐🏾More in comments👇🏾#Agenda21 #Agenda2030 #GreenNewDeal #GreenAgenda",
    "tags": [
        "Other"
    ],
    "year": "4"
}