{
    "filename": "B_V_v1oD7jF.jpg",
    "description": "University educated. Once a VaxX-er. Turned informed consent and freedom keeper. ⁠⠀\n.⁠⠀\nI'm generally a \"\"turn lemons into lemonade person\"\". A \"\"your choices are powerful\"\" person.⁠⠀\n.⁠⠀\nAnd I'm also here to tell you: you do NOT need to accept these lemons. You are ALLOWED to question the stay at home measures put in place. You are allowed to blow the whistle. You are allowed to dig in and research stats and not let someone else determine your future. If you have a job and a steady income? And and you're telling people to just wait it out? Please sit down.⁠⠀\n.⁠⠀\nThis is not a turn lemons in to lemonade moment. This is moment to question. To use your voice and common sense.⁠⠀\n.⁠⠀\nWe are conditioned to stay in line. To follow the rules. After all, someone else knows more and better than you do about your body. I was that person.⁠⠀\n.⁠⠀\nSo YOU WANT PEOPLE TO DIE? This is the most erratic  and catch phase statement I've ever heard. NO. I want people to live.  It is a paradigm shift. Is life the prevention of death or the promotion of life ?⁠⠀\n.⁠⠀\nYou have one life. Choose wisely. How do you want to live it ?⁠⠀\n.⁠⠀\n.⁠⠀⁠⠀\n.⁠⠀⁠⠀\n.⁠⠀⁠⠀⁠⠀\n.⁠⠀⁠⠀⁠⠀\n.⁠⠀⁠⠀⁠⠀\n.⁠⠀⁠⠀⁠⠀\n.⁠⠀⁠⠀⁠⠀\n⁠⠀⁠⠀⁠⠀\n.⁠⠀\n⁠⠀⁠⠀⁠⠀⁠⠀⁠⠀⁠⠀\n.⁠⠀⁠⠀⁠⠀⁠⠀⁠⠀⁠⠀⁠⠀\n#businesstip #simplify⁠⠀⁠⠀⁠⠀⁠⠀⁠⠀⁠⠀⁠⠀\n#womanonamission⁠⠀#zerowaste #recycle #saveourworld #carbonfootprint⠀⁠⠀⁠⠀⠀⁠⠀⁠⠀⁠⠀⁠⠀⠀⁠⠀⁠⠀⠀⁠⠀⁠⠀⁠⠀⁠⠀⁠⠀⁠⠀⁠⠀⁠⠀⁠⠀⁠⠀⁠⠀⁠⠀⁠⠀⁠⠀⁠⠀\n#realmamahood #autoimmune #detox #beauty #toxinfree #greenbeauty #informedconsent #freedomkeepers #wildandfree #thatsdarling #darlingdaily #thehappynow #livethelittlethings #believemothers #freedomkeeper #momlife #enchatedchildhood #motherhoodblog #thecreativecollective #yycmoms #beautyblogger⁠⠀⁠#thisisredding⁠⠀",
    "tags": [
        "Other"
    ],
    "year": "4"
}