{
    "filename": "B_XjUW0Bh9X.jpg",
    "description": "#China, the country that banned initial coin offerings and made it tough for #Bitcoin to operate has been tossing around the idea to build its own digital currency, and some U.S. multinationals are reportedly willing to help roll it out, the South China Morning Post reported today.\n\nStarbucks SBUX, McDonald’s and Subway chains in China were named on the People’s Bank of China’s list of firms that will test the national digital currency in the near future.\n\nA #digitalcurrency is a generic term that may or may not be a #cryptocurrency. #Cryptos are decentralized by design, and also used for their privacy — something that is anathema to the #Chinese government.\n\nThis particular currency, once referred to as a digital yuan, will also be given a test at Chinese hotels, convenience stores, a bakery, a bookstore and a gym in the Xiong’an New Area, a city being built south of #Beijing.\n\nNo date for the release has been set.\n\nChina has been talking about this for at least a year now and it is unclear how those three U.S. brand were chosen, but it was a local decision to include those local franchises. This is not for McDonald’s nationwide in the mainland.\n\nThe PBoC said last August that their digital yuan was ready to be ruled out.\n\nChina consumers are accustomed to using digital payments. Tech giant Alibaba BABA’s AliPay (owned by Alibaba’s Ant Financial) is more ubiquitous in China than Visa and Mastercard. QR code transactions are common place in China.\n\nOn April 20, the WSJ reported that the digital currency rollout would happen outside of the Xiong’an New Area, and also be test driven in Shenzhen and Chengdu.\n\nChina’s estimated 890 million unique mobile payment users made transactions totaling around $20 trillion in 2019. The number of people making mobile merchant payments is expected rise from around 577 million last year to an estimated 700 million in 2022.\n\nChina’s government move into digital payments would potentially be a competitor to AliPay, which is privately owned, though for now the government does not seem to have any plans to roll out a payments platform or a blockchain for those transactions. 🖐🏾More in comments👇🏾",
    "tags": [
        "Other"
    ],
    "year": "4"
}