{
    "filename": "B_xZWTOhtGR.jpg",
    "description": "The Associated Press has obtained a US Department of #HomelandSecurity intelligence report that concludes #China covered up the extent of the #coronavirus outbreak, including the fact that it was contagious in humans, in order to stock up on medical supplies and protection equipment before the rest of the world knew.\n\nThe four page report dated May 1, outlines how US officials believe China “intentionally concealed the severity” of the outbreak in January.\n\nThe report details how China downplayed the spread of the virus while increasing imports and decreasing exports of medical supplies.\n\nChina simultaneously denied that “there were export restrictions and obfuscating and delaying provision of its trade data,” the report states.\n\nThe document also contends that China intentionally delayed informing the #WorldHealthOrganization that the coronavirus “was a contagion” for almost a month.\n\nAs we have documented, the WHO merely parroted China’s claims, until it was able to send a team to Wuhan on January 20th, whereupon a medical worker immediately told the organisation that the virus was contagious in humans. Even then, the WHO did not declare a pandemic until the 12th of March.\n\nThroughout this time, China was ordering medical supplies from abroad, and its imports of face masks, surgical gowns and gloves increased sharply, according to the report.\n\nThe document concludes that there is a 95% probability that China’s changes in imports and export behavior were not within normal range.\n\nWe exposed China’s disgusting profiteering from the coronavirus outbreak 4 weeks ago, in a report collating several articles that detailed how the CCP blocked US manufacturers exporting medical equipment so it could ‘corner the market’, and even sold Italy’s own donated equipment back to the country at an inflated cost. #Event201 #GlobalHealthSecurityAgenda",
    "tags": [
        "Bill Gates"
    ],
    "year": "5"
}