{
    "filename": "CA4NHx_H1Ic.jpg",
    "description": "Say what you want about me, call me all the names but don’t you come after my babies. Your false words, sponsored research and lack of proven safety studies is not good enough for us. My babies are not your safety experiment.\n•\nI wish I had the luxury of playing the “everything will be ok” game. I wish I didn’t have to speak out against the “norm”. But we don’t have that luxury.\n•\nWhy is it that everyone asks mothers for their medical degrees on this topic but no one asks Bill Gates for his? Vaccines contain fetal cells, animal DNA, carcinogens, heavy metals, poisons and even mutagenic ingredients. I get that to them I’m “just a mum” perusing Google {which they censor and control 👀 so we can only see what they want us to}. I didn’t spend a minute on Google either. I’ve spent YEARS of my fine precious life researching things I wish I didn’t have to. I’m not just a mother. I am a freedom fighter. Because I’ve connected the dots and critically questioned it all for the safety of my babies as your babies. Mainstream media will not give you the answers you are seeking.\n•\nI wish I had the luxury of being silent but when they take away our rights to step outside of our homes, take our children to the park, travel or hang out with out loved ones, tell me is that our given freedom? Because it sure ain’t mine. Our rights are being stripped away while we trust them to protect us. 5G towers are being put up. Streets and playgrounds sprayed with toxic chemicals. And then we are being “rewarded” as they said, with our freedom.\n•\nAll these action are just gasoline to my fire. If they are yours too- speak up girl. Glass houses aren’t for us. I know they want to silence us, remove videos of doctors speaking out, sprinkle in some more censorship “for our safety” because they care 🤦🏼‍♀️, remove all the books proving them wrong off the internet, create new laws on the down low when and how they feel like it. Standing for something is not easy friends. But watching crimes against our children and their future unfold without speaking up is consent.\n.\n.\n.\n.\n.\n.\n.\n.\n#justaskingaustralia #freedomkeepers #bethechange #betterfuture #freedomkeepersunited #mumlife",
    "tags": [
        "Other"
    ],
    "year": "6"
}