{
    "filename": "CA51DlUjScP.jpg",
    "description": "This is what I was talking about. Different vibrations. Expanded consciousness or \"\"little me\"\". Entities that manipulate the world move in low emotions & vibrations. That's why everything has to scare you away from your goal and put you down. Just think about that. Media, politics, even family, friends, school. That's why you have here porn, PC games, alcohol, drugs and other escapes from reality. Addictions. It's all about draining your energy and lower your vibration. The goal is to raise, increase your vibrations. Leave the fear, listen to the heart. Choose love. You can start by looking at documents and videos that I recommend to everyone and that I´ve seen myself many times and have helped me feel more happy, free, confident, in truth, in love, in peace, on my right journey and learn to put off fear. I'm not afraid of vaccinations, I'm not afraid of microchips. Yes, it is necessary to keep in mind what is their plan - being aware, but at the same time keep in mind that this is about your energy, low emotions, fear. When you get to the higher level, there is no one to drain your energy. They have no food. Whether you admit it or think it´s just some nonsense - there is a hidden force that has manipulated us for thousands of years. It is depicted by various ancient cultures and civilizations. In their paintings and descriptions. Also by many insiders in documents, videos, books. Whoever wants, will find information. My page only offers a red pill and a real, deep knowledge about this game around us. \"\"The truth shall set you free but first it will shatter your illusions\"\"\n.\n.\n.\n💊 For Red Pill videos check link in my bio\n👉 Follow @expandedconsciousness\n🙏 Spirituality 💊 Red Pill 🚀 Raising Vibration\n.\n.\n.\n.\n.\n.\n#innerwisdom #spiritualthoughts #soulgrowth #semenretention #dailymotivation #spiritualjourney #spiritualawakening #redpill #dailyguidance #universalenergy #spiritualquotes #wisdomquotes #higherfrequency #thirdeye #unconditionallove❤ #thegreatawakening #spiritguides #inspirationquotes #5thdimension #londonrealarmy #positivevibes #spiritualguidance #spiritualpath #weainthavingit #universehasyourback #qanon #goodvibes #davidicke #wwg1wga #awakenedsoul",
    "tags": [
        "Qanon"
    ],
    "year": "6"
}