{
    "filename": "CAbPVfwBfrF.jpg",
    "description": "Thoughts?\n\nA follower of #QAnon, a conspiracy theory that has been spreading from the far fringes of right-wing social media into more mainstream #Republican circles, won the Republican primary for U.S. Senate in #Oregon Tuesday, crediting fellow followers for her victory. “#Wherewegoonewegoall,” said candidate Jo Rae Perkins in a tweet published prior to the results coming in, quoting a popular slogan from the conspiracy theory. “I stand with #PresidentTrump, I stand with Q and the team. Thank you Anons, and thank you patriots. Together, we can save our republic.” During a victory speech live-streamed to social media, Perkins concluded by saying, “As we Q people like to say, ‘Where we go one, we go all.’” QAnon is a theory built around belief in an international conspiracy of high-ranking government officials to kidnap, abuse, torture and kill children — the delusion under which an armed #NorthCarolina man attempted a rescue mission at a Washington pizzeria in 2016, the #Pizzagate conspiracy seen as a precursor to QAnon. President Trump, in the Q worldview, is working behind the scenes to expose and disrupt this conspiracy but has been thwarted by “#deepstate” bureaucrats and global elites. The narrative is fed by cryptic posts on internet message boards from the anonymous “Q,” who followers believe to be a high-ranking intelligence official, or possibly even Trump himself. Popular YouTube and social media pages promulgate and analyze Q’s vague messages, turning the obsession into something of a game for many followers.\n\nPerkins is the former Republican chairwoman in #LinnCounty, located just south of the capital city, #Salem, and had run in prior Republican primaries in 2014 (U.S. Senate), 2016 and 2018 (the state’s Fourth Congressional District). She was originally running for the House seat again in 2020 but withdrew to enter the Senate race. As of the latest results, Perkins had earned just short of 50 percent of the vote in the four-candidate race. The runner-up was former naval officer Paul Romero, who reached 30 percent. 🖐🏾More in comments👇🏾",
    "tags": [
        "Qanon",
        "Deep State"
    ],
    "year": "5"
}