{
    "filename": "CACzTbdgG_V.jpg",
    "description": ".\n#repost @takingbackcalifornia\n・・・\n#lagunabeach #commiefornia \nRepost: @sourcefilms8k \nI wish I had started recording earlier... I will FOIA request the full video. You better all start showing up to these protests... They are literally trying to take our freedom of speech and our ability to resist their policies/protocols. I never raised my hands, never threatened anyone, never did anything but speak my truth about having my movements unjustly restricted when going to the beach two days in a row and fighting for all of these peoples’ liberties. I wrote an email to the Mayor of @lagunabeachgov Bob Whalen, all of city council, the Chief of @lagunabeachpd and other members of the police force the other night in a genuine effort to stand for truth and all of our collective rights. On the third day, this is what I get as I walk back to my house to shower while coming up from the beach. I was unconstitutionally stopped and detained against my will until I resisted, was presented with false evidence, was told that my neighbor who loves me told this specific officer “I was a problem”, and was led to believe that my wife, kids and I are under active surveillance and that any further “dissent” (freedom of speech) regarding this tyranny from me will lead to greater harassment by their police force while operating under the color of law. This is the beginning of the end of your rights but if you stand, and you know the law, you will walk away a lion and they will drive away like sheep, just like happened just now in Laguna Beach, a community that I love with ALL of my heart. You do NOT have to show ID, you do NOT need to answer questions and you do NOT need to give them your name. Shame them in their own stupidity and pray that they wake up! RESIST! WE DO NOT CONSENT! .\n.\n#reopencalifornia #opencalifornia #openamerica #reopenamerica #wedonotconsent #recallgavinnewsom #recallnewsom #knowyourrights #idonotconsent #boogaloo #wethepeople #shallnotbeinfringed #gavinnewsom #newsom #policestate #plandemic #californialiving #pelosi #nancypelosi #martiallaw #billofrights #lagunabeachpd",
    "tags": [
        "Plandemic"
    ],
    "year": "5"
}