{
    "filename": "CAD0Dy8hOrz.jpg",
    "description": "A team from the #UniversityofHarrisburg, PA, has developed automated computer #facialrecognition software that they claim can predict with 80 percent accuracy and “no racial bias” whether a person is likely going to be a criminal, purely by looking at a picture of them. “By automating the identification of potential threats without bias, our aim is to produce tools for crime prevention, #lawenforcement, and military applications,” they said, declaring that they were looking for “strategic partners” to work with to implement their product.\n\nIn a worrying use of words, the team in their own press release, move from referring to those the software recognizes as being “likely criminals” to “criminals” in the space of just one sentence, suggesting they are confident in the discredited racist pseudoscience of phrenology they appear to have updated for the 21st century.\n\nPublic reaction to the project was less than enthusiastic, judging by comments left on Facebook, which included “Societies have been trying to push the idea of ‘born criminals’ for centuries,” “and this isn’t profiling because……?” and “20 percent getting tailed by police constantly because they have the ‘crime face.’” Indeed, the response was so negative that the university pulled the press release from the internet. However, it is still visible using the Internet Wayback Machine.\n\nWhile the research team claims to be removing bias and racism from decision making, leaving it up to a faceless algorithm, those who write the code, and those who get to decide who constitutes a criminal in the first place, certainly do have their own biases. Why are the homeless or people of color who “loiter” on sidewalks criminalized, but senators and congresspersons who vote for wars and regime change operations not? And who is more likely to be arrested?... 🖐🏾More in comments👇🏾#CoViD984 #Technocracy #ScientificDictatorship #PreCrime #SocialCreditScore",
    "tags": [
        "Other"
    ],
    "year": "5"
}