{
    "filename": "CAe20B5lYy8.jpg",
    "description": "Schulterblick. Rückspiegel. Was liegt hinter uns, was haben wir aus den letzten Wochen gelernt? Eine #WhatsApp kann viral gehen, es war ein Samstag, als die Stimme „einer Mama“ per Sprachnachricht kund tat, die Uni #Wien hätte herausgefunden, dass die Einnahme von #Ibuprofen gefährlich sei. Eine bloße Stimme. Und schon hatten Menschen ein für sie wichtiges Medikament abgesetzt. Oder erinnert Ihr Euch noch an jene Nachricht (wieder an einem Wochenende), laut der am Montag ganz #Berlin abgesperrt werde. Quasi 3 Millionen Menschen - eingekesselt. Es war die Zeit, in der #Klopapier gekauft wurde, als erwarte man einen #Darmvirus. Und keinen #Lungenvirus.\n▪️\nOder dies hier im März 2020: Eine Frau, wackliges Handybild. Sie ist älter. Ihre Haare leicht zersaust. Der Wind rauscht in den Ton, als sie erzählt. „Hier in #Italien\"\"\"\"\"\"\"\" gäbe es \"\"\"\"\"\"\"\"jetzt ein totes Kind von vier Monaten\"\"\"\"\"\"\"\", \"\"\"\"\"\"\"\"hier in Italien\"\"\"\"\"\"\"\" sei man \"\"\"\"\"\"\"\"leider schon einen Schritt weiter als ihr\"\"\"\"\"\"\"\", \"\"\"\"\"\"\"\"hier in Italien\"\"\"\"\"\"\"\" würden die Menschen \"\"\"\"\"\"\"\"sterben wie die Fliegen\"\"\"\"\"\"\"\". - Hier in Italien? Wir sehen nichts von der Umgebung. Vertrauen aber dieser Frau da im Bildschirm, die wir nicht kennen, nur weil die Videonachricht von Leuten, die wir mehr oder weniger gut kennen, an uns weitergeschickt wurde. Und das direkt per WhatsApp, quasi dem „familiären Umfeld“ unserer digitalen Messenger-Kommunikation, wo wir ansonsten emotional mit unseren Nächsten & Liebsten chatten.\n▪️\nEin dubioser #Fitnesscoach hat jetzt nach eigenen Angaben alle seine #Corona-Videos gelöscht. Ihm sei der #Hate zu viel geworden. Ihm, der Hate & Angst wie kaum ein zweiter in dieser Krise aussendete. Und vor dem ich so oft gewarnt hatte, ihm gehe es nicht um Deutschland oder um Euch, sondern um PR für sich, sein Vitamin C & Co. Ein veganer Koch verrennt sich immer mehr, ist moralisch (und wirtschaftlich) fertig. Zudem musste jetzt eine Gruppierung, die den #Widerstand2020 organisieren wollte, öffentlich kleinlaut zugeben, dass sie nicht 100.000 Mitglieder habe, sondern „zwischen 30-50“. - In der Rückbetrachtung schütteln wir vielleicht über all das den Kopf. Vor wenigen Tagen/Wochen haben viele von uns es für bare Münze genommen. - War es das wert? #covid19",
    "tags": [
        "Other"
    ],
    "year": "5"
}