{
    "filename": "CAf6fYGnaOE.jpg",
    "description": "On May 12, 2020, New Jersey Governor Phil Murphy unveiled plans for a new statewide #covid19 digital tracking and monitoring program.🌐\n⠀\nAlthough Governor Murphy maintains that the surveillance program is essential to stopping the spread of #covid_19 many New Jerseyans have serious concerns. For example:\n⠀\n⁉️Why was the program quietly invoked under an #emergency executive order?\n⠀\n⁉️How will #privacy, #confidentiality and #security be handled?\n⠀\n⁉️How will #newjersey #legislators uphold their oath to protect citizens’ basic #human, #civil and #constitutionalrights?\n⠀\n⁉️Will participation be #mandatory , or will residents be able to opt in or opt out of the program?\n⠀\n⁉️What are the #consequences if someone chooses not to comply with #testing, #monitoring or #quarantine?\n⠀\n⁉️If COVID-19 is primarily affecting the elderly and those in long-term care facilities, why is the entire state being put under strict #surveillance?\n⠀\n⁉️Why weren’t similar initiatives launched during other deadly outbreaks like SARS, MERS and H1N1?\n⠀\n⁉️What is the cost of the CommCare program — and how will the state demonstrate that the taxpayer-funded investment is proving effective toward reducing further transmission and #savinglives?\n⠀\nWith so many unanswered questions — and the possibility that this program could lay the groundwork for a #medicalpolicestate that gives unlimited #power to New Jersey officials and the organizations with which they contract — IT’S TIME TO DEMAND ANSWERS!\n⠀\n‼️🗣Take action by clicking the LINK in our BIO 👆 above to tell your legislators that you demand an immediate public hearing on the state’s new digital tracking and monitoring program‼️\n⠀\n#standforhealthfreedom #contacttracing #healthfreedom #stand #standtogether #rise #riseup #yourvoicematters #newjerseyfreedomfighters",
    "tags": [
        "Other"
    ],
    "year": "5"
}