{
    "filename": "CAKOhXxJwhs.jpg",
    "description": "Ihr Lieben, das ist unserer Meinung nach der beste Kommentar zum Thema- Fake News- Verschwörungstheorien- von Prof. Dr. Drosten, Chefvirologe der Charité Berlin. \nDrosten sagt sinngemäß: Da kursieren Videos voller Unsinn, das ist Quatsch von Menschen, die nie an dem Thema gearbeitet haben, denen man glaubt, aufgrund ihrer akademischen Titel. Man hat nachgewiesen, dass das Unsinn ist. \nFür normale Menschen ist das aber nicht so leicht zu unterscheiden, wer hat Ahnung und wer nicht. \nDrosten: „Ich bin auch Professor, ich würde mich nie trauen, irgendwelche Dinge an die Öffentlichkeit zu geben, die auch noch so viel Meinung beinhalten, über Bakterien. \nIch bin Virologe und ich würde mich nie äußern zu einem bakteriologischen Thema, das ist für normale Menschen das selbe, für Wissenschaftler aber nicht. Ich würde mich auch nicht trauen, innerhalb der Virologie mich zu einem anderen Virus zu äußern …als zu dem, an dem ich hier arbeite. \nMan kann die Literatur und Fachkenntnis nicht kennen, wenn man nicht absoluter Spezialist ist und das ist der einzige Grund, warum ich als Person überhaupt in der Öffentlichkeit stehe, nicht weil ich besonders schlau bin oder besonders gut reden kann oder irgendetwas, sondern weil ich als Spezialist an genau diesen Viren arbeite. \nWas ich höre von scheinbaren Fachleuten, die Fachleute in ihrem eigenen Forschungsgebiet sind, entbehrt jeder Grundlage, das sind Allgemeinplätze, die nicht über eine oberflächliche Kenntnis von Studentenlehrbuchwissen hinaus gehen und mit dieser Wissensbasis posaunt man dann Videos in die Öffentlichkeit und stärkt den wirklich gefährlichen Verschwörungstheoretikern, die auch zum Teil politischen Agenden haben, den Rücken. \nDas ist unverantwortlich. \nSchau‘  immer ….wo ist die fachliche Kompetenz von jemandem, ist er Spezialist? Ist er international als Experte respektiert, wenn nicht, lass die Finger davon! \nDem ist unsere Meinung nach nichts mehr hinzuzufügen, super Kommentar. \n@christiandrosten_virologenking @christian.drosten.fanpage @chariteberlin \n#coronakommentar #chariteberlin #charitéberlin #coronafakenews #coronafake #schlafschaf #schlafschafe #schlafschafewachtauf",
    "tags": [
        "Other"
    ],
    "year": "5"
}