{
    "filename": "CALwCipJiek.jpg",
    "description": "I used to follow an account with a very dogmatic approach to gut healing. Strict rules for foods to avoid. Weird food rituals. Time restrictions for eating. The kicker? This influencer had no degree, license, etc to provide medical advice. Much of their advice was based on cherry-picked research and PERSONAL ANECDOTE. And yet, through the trendy appeal of social media, they can write regular posts, a blog, and even a book (!!!) telling people exactly what to do with their bodies!\nSounds dangerous, right? But you see, it is VERY easy for influencers to get away with this when they are instilling fear in a VERY vulnerable audience. In this case, those who are so desperate to \"\"heal\"\" themselves. There was a time when I was desperate to heal my poor gut. I went through my pantry and threw out perfectly good food items that the influencer deemed harmful. I did the weird rituals. I drank the kool-aid (metaphorically). And from this, I developed irrational food fears. It was probably more unhealthy for my mindset than any food could have been for my body. This is why the Instagram health community can be such a dangerous trap. You can do real damage to your body (and mind!) by following that misguided information!\nAnd so I really just write this out of anger and frustration. Personally, I also don't have a degree and am unqualified to give medical advice. So the only general advice I have for you, and my main takeaways from this post (that I wish I could tell my younger self):\n1.) Seek advice from your trusted in-person doctor/medical professional FIRST.\n2.) If you are looking for health tips on social media, at least make sure you are following credible influencers, like real doctors or dietitians.\n3.) If you are at a vulnerable stage in recovery from ANYTHING, it might be best to limit social media altogether. It's a comparison trap and contradicting/false information is everywhere.\n3.) Use common sense and trust YOUR gut!!!\n#WellLivved",
    "tags": [
        "Other"
    ],
    "year": "5"
}