{
    "filename": "CALWu5uhqL5.jpg",
    "description": "Thoughts?\n\n#PresidentTrump says he would “rapidly” mobilize the U.S. military to distribute a #COVID19 #coronavirus vaccine once it’s ready, focusing first on nursing homes and the elderly most vulnerable to deadly complications from the virus.\n\nWe live in a time of crisis the likes of which the world has never seen before, and with each passing day comes further confusion and disorientation about what happens next. As we previously reported, President Trump has gone from being a staunch #antivaxxer to being a COVID-19 vaccination cheerleader. Now today he told Fox News that he is mobilizing the US military to distribute the COVID-19 vaccine when it’s ready, probably at the end of the year. Vaccinations at the point of a gun? Yep, looks like that’s where we are at the moment.\n\nFor legal reasons I cannot tell you what you should do about receiving a COVID-19 vaccination shot, but I sure can tell you what I will do. Under no circumstances nor at an time will I receive a COVID-19 vaccination shot from any entity be it public, private or Trump. Not even the assembled might of the United States military could compel me to do that. I have told you all many, many times now, yes, Bill Gates is one of the major players but he is not the only player. Don’t have your eyes on any one person, or you’ll miss it. It’s a system, a global system.\n\nTrump says he would mobilize military to distribute coronavirus vaccine when it’s ready\n\nFROM CBS NEWS: “We’re mobilizing our military and other forces but we’re mobilizing our military on the basis that we do have a vaccine. You know, it’s a massive job to give this vaccine. Our military is now being mobilized so at the end of the year we’re going to be able to give it to a lot of people very, very rapidly,” the president said. “We will have a tremendous force because assuming we get it, then you have to distribute it,” he added. “And unless you’re mobilized and ready, you’re not going to be able to do it for a long time. So we’re starting now.” 🖐🏾More in comments👇🏾#VaccineAgenda #GlobalHealthSecurityAgenda #CoViD1984 #ContactTracing #PopulationControl #Technocracy",
    "tags": [
        "Other"
    ],
    "year": "5"
}