{
    "filename": "CAnh-hjhAkf.jpg",
    "description": "So far, the #Chinese #coronavirus has killed over 342,000 worldwide, destroyed economies, and impoverished small business owners, yet #WorldHealthOrganization (W.H.O.) chief Tedros Adhanom Ghebreyesus was praised by #China for his efforts.\n\n#Beijing’s top diplomat Wang Yi said that Tedros has done a good job and countries “with decency” will support him and the W.H.O. in its future work.\n\nSpeaking at a press conference, Wang claimed the W.H.O. was beyond reproach but failed to offer a single fact to back his claim. “We hope all countries will realize that humanity is a community with a shared future.” “We must render each other more support and cooperation, and there should be less accusation and confrontation,” he added. “We call on all nations to come together and build a better world for all,” he said. “As for W.H.O.’s international standing and its place in history, I’m sure clear-eyed people the world over will reach a fair conclusion, one that will not be altered just because some country doesn’t like it.” Breitbart.com reports: Those who throw mud at the W.H.O. will only leave a stain on themselves, said Wang, in defiance of a host of countries who see nothing but hopeless mismanagement almost from the first day the virus was isolated.\n\nU.S. health secretary Alex Azar has already blamed the W.H.O. for not obtaining or providing the information needed to stem the pandemic. “We must be frank about one of the primary reasons this outbreak spun out of control: there was a failure by this organisation to obtain the information that the world needed, and that failure cost many lives,” he said earlier this month.\n\nThe evidence backs that assertion.\n\nAs far back as January 14, two months after health officials are believed to have detected the first case of the virus in China on November 17 of last year, the W.H.O. was promoting a Chinese claim via Twitter that there was “no clear evidence of human-to-human transmission.” 🖐🏾More in comments👇🏾",
    "tags": [
        "Other"
    ],
    "year": "5"
}