{
    "filename": "CANsVHzhxbe.jpg",
    "description": "Teen #climateactivist #GretaThunberg has told CNN viewers to follow the guidance of experts as the world fights the #coronavirus pandemic\n\nShe said that she now thinks more people are beginning to realize the importance of listening to experts and the global science community.\n\nOn Thursday night Thunberg joined a panel of ‘experts’ during CNN’S live coronavirus town hall.\n\nThe network came under fire after announcing that the Swedish teen would participate in the #Covid19 town-hall event hosted by Anderson Cooper and CNN Chief Medical Correspondent Dr Sanjay Gupta.\n\nRT reports: Judging by Thunberg’s remarks during the discussion, it appears she at least partly agrees with her detractors. “People are starting to realize that we are actually depending on science and that we need to listen to scientists and experts,” the 17-year-old said during the panel discussion.\n\nHer message sparked considerable displeasure on social media.\n\nConservative commentator Mark Dice jokingly suggested that CNN should interview a 12-year-old who has a lemonade stand about financial relief legislation.\n\nOthers chided CNN for becoming an “Onion-type” news organization by allowing Thunberg on the panel.\n\nThe Swede also used the occasion to underline how the pandemic was affecting children – claiming that Covid-19 has created a “children’s rights crisis” because the worldwide response has focused too heavily on safeguarding the elderly. In April, she donated a $100,000 prize she won to the United Nations Children’s Fund (#UNICEF), arguing that children may ultimately suffer the most from the social and economic consequences of the pandemic.\n\nThunberg tweeted before the town hall that she has never claimed to be an expert, stating for the record that she is an “activist” and would use the panel to discuss her campaign supporting UNICEF. #Agenda21 #Agenda2030 #Agenda2050 #GreenNewDeal",
    "tags": [
        "Other"
    ],
    "year": "5"
}