{
    "filename": "CAONqk7A_cF.jpg",
    "description": "I used to not like Trump, til I started researching every opinion I had- about 95% of them were not true- lies I had been told by the mainstream media. And yea; I get it, he lacks tact, a bit of an asshole... but he’s a New Yorker ... And you know what? He is an incredible leader. What I have learned is, he loves America and all she stands for; he works tirelessly FOR FREE (only president to do so), everyday he faces an onslaught of energetic curses, criticism and hate, and presses on, unshaken. He is strong, smart, and has very intelligent people behind him. There is a Deep State-  full of corrupt globalist leaders. They have helmed the control of our country for far too long, selling us off to China, enabling China’s infiltration of North and South America- ideologically, economically and eventually, socially. Trump is against their secrecy, their global domination/manipulation, and their evils. He is against the communist regime of China, which the deep state would love to implement globally. He loves our Constitution, and is an advocate for freedom. His desire is to restore our abused country from the inside out- but to do all this, he has to first drain the swamp! So, question the narrative of every article you read and media outlet (if you do some homework, you will find most are owned directly or indirectly as subsidiaries of larger companies heavily invested in big Pharma, Big Tech and China- Aka Deep State... all threatened by Trumps policies ). Of course he isn’t perfect- and you can disagree with me- but if you do research, I bet you would find exactly what I did- that he is a good President, we are lucky to have him. And that he really is making America Great again. ❤️ #maga #trumptrain #trump2020 #iusedtobeatrumphater #nowiseethelight #billgatesisavirus #fakenews #fauciisafraud #fakescience #protectourconstitution #protectcivilliberty #thegreatawakening #wwg1wga #trustpotus #trusttheplan #qanons #qanonarmy #draintheswamp #exposethedeepstate #exposetheluciferianagenda #pizzagate #obamagate #italygate #fisagate #pedowood #theclintonbodycount #stopbillgates #stopthenewworldorder #wakeupamerica #covfefe",
    "tags": [
        "Qanon",
        "Bill Gates",
        "New World Order",
        "Deep State"
    ],
    "year": "5"
}