{
    "filename": "CAooXX2h-sx.jpg",
    "description": "Thoughts?\n\nFormer #British Prime Minister #TonyBlair has questioned #PresidentTrump’s leadership during the #coronavirus pandemic.\n\nBlair’s idea’s echoe those of another former UK PM, Gordon Brown, who recently urged world leaders to create a temporary form of #globalgovernment to tackle the crisis caused by the coronavirus.\n\nBeing concerned about what he called “the absence of global coordination”, Blair harked back to his work alongside, #GeorgeBush (his partner in war crimes), #BillClinton and #BarackObama, as being good examples of how global inter-governmental cooperation can work at winning the day.\n\nBreitbart reports: His remarks in an interview with NBC News last Friday followed an earlier intervention in the crisis when his own #globalist think tank claimed it is “embedded in governments around the world,” as Breitbart News reported.\n\nIn his most recent observations, he told NBC News he was worried about the lack of global coordination in tackling the crisis. “The worry I have that an absence of global coordination and global leadership that’s necessary for it is a huge problem,” he said. “When I think back to the times when I’m dealing with American presidents whether it’s Bill Clinton or George Bush, Barack Obama as well, the most important thing at a time like this is to say, ‘How do you bring the world together?” By building more and bigger global government, Blair believes leaders could find a vaccine together, accelerate the development of therapeutics and testing capability, while keeping the international economy afloat. “It’s that global coordination, the absence of which means that each individual country’s less effective at dealing with the disease. That’s the thing that worries me,” he stated.\n\nThe left-wing former Labour leader was asked his opinion on Trump’s suggestions on fighting the epidemic, he said: “I think most people would understand what I would think, but it’s probably better sometimes not to say it.” Read More: [https://newspunch.com/tony-blair-calls-for-stronger-who-more-global-government-during-pandemic/] #VaccineAgenda #GlobalHealthSecurityAgenda",
    "tags": [
        "Other"
    ],
    "year": "5"
}