{
    "filename": "CAqJeI1nTf3.jpg",
    "description": "There is no more time to sit on the fence or hide because you're afraid. By removing exemptions state by state this is essentially introducing mandatory vaccinations, the Government is essentially claiming it owns your body, it knows best when it comes to medicine and health, that the science behind vaccines is settled, and that it has the right to violate you if it deems in doing do that it’s “protecting the greater good”.⁣\n⁣\nHow many people out there still consider that the Government forcibly injecting you with at least 10 toxic and carcinogenic vaccine adjuvants (such as mercury, aluminum, formaldehyde, human DNA from aborted fetal tissue, MSG, etc.) is not a violation? To those who have been following the unfolding of the New World Order, it is also unsurprising that the WHO (World Health Organization), another subsidiary of the Rockefeller-created UN (United Nations), has laws on its books to be able to declare mandatory vaccinations in all its 194 signatory states. \"\"In the event of WHO declaring a pandemic, WHO has the authority to order forced vaccinations around the world. All 194 signatory countries to IHR must comply.”⁣\n⁣\nSimply put when they create and stage a false flag pandemic you better buckle up and get ready to fight because they will be coming for everyone. Funny how all these organizations like the UN, WHO and the US Government have “Generals” like a Director-General, Surgeon-General or a Secretary-General. Maybe it’s because they’re actually corporate and military organizations in disguise with the intent and possibly the partial ability to force things like mandatory vaccinations on the population.⁣\n⁣\nVaccinations are a tyrannical manifestation of collectivism, the notion that all individuals must sacrifice their rights, desires and freedom for the greater good. Of course, the greater good is always defined by the State, or the small group of usually power-hungry individuals who have gained control of the helm of Government. The Government is now trying to claim it has the legal right to do what it wants with your body, including injecting it full of poisons disguised as “medicine”, for whatever noble-sounding pretext it comes up with next.",
    "tags": [
        "Other"
    ],
    "year": "5"
}