{
    "filename": "CAV6WakhQ9M.jpg",
    "description": "Notorious left-wing billionaire #GeorgeSoros has labeled the #coronaviruspandemic “the crisis of my lifetime” and indicated that the global crisis has provided the opportunity for radical changes to society previously thought impossible.\n\nSoros, who lived through the Second World War as a youth, said, “Even before the pandemic hit, I realized that we were in a revolutionary moment where what would be impossible or even inconceivable in normal times had become not only possible, but probably absolutely necessary.” During the interview on May 11, Soros also said “I will also say that I have put my faith in Trump to destroy himself, and he has exceeded my wildest expectations,” Soros added.\n\nWhile the constitution, according to Soros, “will prevent him from doing certain things,” that has not stopped the President from trying, “because he is literally fighting for his life.” Radical left sponsor and billionaire George Soros says #PresidentTrump is “literally fighting for his life.”\nLifeSiteNews report: Soros was “particularly concerned about the survival of the EU because it is an incomplete union.” While, according to the #Hungarian-born billionaire, the #EuropeanUnion was “in the process of being created,” that process “was never completed.” Thus, Soros said the EU was “exceptionally vulnerable – more vulnerable than the US not just because it is an incomplete union but also because it is based on the rule of law.” Soros also commented on a recent conflict between Germany and the EU. Germany’s highest court had ruled on May 5 that one of the EU’s Court of Justice decisions regarding policies of the European Central Bank (ECB) was not legally binding. In turn, the European Court of Justice asserted that it alone had jurisdiction over the ECB.\n\nIn the interview, Soros sided with the EU. “When Germany joined the EU, it committed itself to abide by European law,” he argued.\n\nHe voiced his fears that countries like Poland or Hungary might become more independent of the EU, if also “the German court can question the decisions of the European Court of Justice.” 🖐🏾More in comments👇🏾#SocioEconomicReformation",
    "tags": [
        "Other"
    ],
    "year": "5"
}