{
    "filename": "CAVhJDVAWeN.jpg",
    "description": "An alarming new federal bill has surfaced in the US House of Representatives with potentially devastating implications to your #privacyrights and ability to choose how you care for yourself and your #children.\n⠀\nH.R. 6666 is a federal bill that allocates $100 billion annually to deploy a massive force of #surveillance workers to test, contact trace and enforce the #quarantine of men, women and children in the United States who are thought to be infected — or potentially infected — with #COVID-19.\n⠀\nAccording to the bill, those hired will conduct diagnostic #testing and “related activities such as #contacttracing through mobile health units and, as necessary, at individuals’ residences, and for other purposes.”\n⠀\nThe bill uses broad, open-ended language and fails to specify what “related activities” or “for other purposes” are; such ambiguity creates the opportunity for an #abuseofpower, particularly during times of crises.\n⠀\nThe activities stemming from this #legislation infringe on individuals’ ability to opt out of unwanted surveillance and potentially mandated medical interventions such as testing, treatment and vaccination. Deploying federal workers to individuals’ homes encroaches on their privacy and raises numerous questions.\n⠀\n🇺🇸Let’s show our #lawmakers how many #people oppose the use of #taxpayer funds (a proposed $100 billion annual budget) for total #citizen surveillance measures that violate #health #freedom #rights.🇺🇸\n⠀\n👆 Follow the LINK in @standforhealthfreedom’s BIO ⬆️ above to 📩email your US senators and representatives NOW and urge them to vote ❌no on H.R. 6666.\n⠀\nIt is dangerous legislation that could irrevocably suspend our #civilliberties in the name of containing a #virus that recent research suggests has an estimated 99.9% survival rate‼️\n⠀\n#CatholicConnect #standforhealthfreedom #rise #riseup #advocate #advocates #healthfreedom #humanrights #wedonotconsent #informed #consent #medical",
    "tags": [
        "Other"
    ],
    "year": "5"
}