{
    "filename": "CAvrMpXhl7q.jpg",
    "description": "Newly released emails reveal that #Michigan Democrat Gov. Gretchen Whitmer’s office gave the “green light” for taxpayer funds to be given to Democrat groups as part of the state’s #coronavirus “#contacttracing” program. “Whitmer’s office gave the ‘green light’ for a #COVID19 contact tracing ‘arrangement’ she denied knowledge of and canceled amid outcry over a contractor with Democratic ties,” Bridge Magazine, a local Michigan publication, reported. “Emails obtained through a public records request appear to show Michigan officials tried to avoid controversy by shifting work to apolitical subsidiaries of firms with known partisan leanings.” DailyWire report: A senior adviser in the Michigan Department of the Health and Human Services, Andrea Taverna, said in an email to Michigan government officials: “We got the green light from EOG [the executive office of the governor] to move forward with a slightly different organizational arrangement of the contact tracing volunteer work. This would still be working with Mike Kolehouse, so work there isn’t lost – it’s just organized somewhat differently – see below.” In late April, The Washington Free Beacon reported that Whitmer had given control of the state’s contact tracing program to “one of the left’s biggest technology firms” and that the move was seen as potential way of her “using the coronavirus to strengthen the Democratic Party’s data operation.” The Washington Post reported that the group that hundreds of thousands of taxpayer dollars were going to go “would be managed in coordination with EveryAction, a firm that is closely linked to NGP VAN, a technology provider that boasts that it powers ‘nearly every major Democratic campaign in #America.’” Republican National Committee (RNC) Chairwoman Ronna McDaniel highlighted an alleged Facebook post from a Democrat operative who also revived a contract from Whitmer’s administration that stated: “I hope [Trump] gets Coronavirus ASAP. Can someone do the country a favor and cough on that man.” 🖐🏾More in comments👇🏾#Event201 #GlobalHealthSecurityAgenda #VaccineAgenda #PopulationControl #Agenda21 #Agenda2030 #ContactTracers #TraceForce",
    "tags": [
        "Bill Gates"
    ],
    "year": "5"
}