{
    "filename": "CAY5HcEhlre.jpg",
    "description": "Lindsey Graham sets vote to subpoena Comey, Brennan and others\nThe Senate Judiciary Committee will vote on June 4 whether to subpoena former government officials, including James Comey and John Brennan, as part of the panel’s investigation into abuse of the surveillance process during Crossfire Hurricane.\n\nThe committee will debate and vote June 4 on whether to issue subpoenas to these #DeepState officials, Sen. Lindsey Graham confirmed.\n\nGraham is seeking documents and testimony from 53 officials.\n\nCommittee rules require Graham to either obtain consent from the top Democrat on the committee or to obtain a majority vote in order to issue subpoenas.\n\nDailycaller.com reports: Graham is seeking documents and testimony referenced in the Justice Department inspector general’s (IG) report on the FBI’s Crossfire Hurricane probe. The FBI committed 17 “significant” errors and omissions in applications for surveillance warrants against former Trump campaign aide Carter Page, the report stated. \nThe FBI relied heavily on the unverified Steele dossier to obtain the spy warrants.\n\nFBI officials withheld information that undermined the credibility of the dossier and its author, Christopher Steele, the IG report noted.\n\nGraham is seeking the testimony of any current or former government official involved in Crossfire Hurricane, or any current or former government official who handled the Steele dossier.\n\nGraham included the following list of individuals he plans to subpoena:\n\nTrisha Anderson, Brian Auten, James Baker, William Barr, Dana Boente, Jennifer Boone, John Brennan, James Clapper, Kevin Clinesmith, James Comey, Patrick Conlon, Michael Dempsey, Stuart Evans, Tashina Gauhar, Carl Ghattas, Curtis Heide, Kathleen Kavalec, David Laufman, Stephen Laycock, Jacob Lew, Loretta Lynch, Andrew McCabe, Mary McCord, Denis McDonough, Arthur McGlynn, Jonathan Moffa, Sally Moyer, Mike Neufield, Sean Newell, Victoria Nuland, Bruce Ohr, Nellie Ohr, Stephanie L. O’Sullivan, Lisa Page, Joseph Pientka, John Podesta, Samantha Power, E.W. “Bill” Priestap, Sarah Raskin, Steve Ricchetti, Susan Rice, Rod Rosenstein... 🖐🏾More in comments👇🏾#ArrestsAreComing",
    "tags": [
        "Deep State"
    ],
    "year": "5"
}