{
    "filename": "CAYVTtYBeuH.jpg",
    "description": "Last night, as dozens of biotech companies rushed to issue stock following the massive spike in #Moderna shares on some extremely preliminary trial results inspired the biggest short-squeeze in US equities since the beginning of May, we warned that Moderna shareholders might be in for a bruising \"\"\"\"bait-and-switch\"\"\"\" as reports about insider share sales emerged, and Moderna, along with dozens of other biotech companies the company, seized on the demand to issue more shares.\n\nBut it's not only Moderna's billionaire founder/CEO Stephane Bancel - once compared to a post-scandal Elizabeth Holmes - who stands to profit from the action: the #WhiteHouse's new vaccine czar also holds - or rather, held - more than 150,000 options contracts on Moderna shares worht more than $12 million, and had resisted pressure to divest them despite the blatant conflict of interest. We were joking yesterday when we speculated that he would probably be glad to exercise these options at current prices. But just as every joke contains a nugget of truth, that one turned out to be prophetic, too.\n\nAs Moderna shares rallied yesterday, the White House said the new vaccine czar, Moncef Slaoui, who had resigned from the biotech company's board just days before, planned to sell his options.\n\nA press release touting the sale hit newswires this morning at around 530amET. Most members of the Washington Press Corps are still sleeping off their hangovers at that hour, so it's hardly surprising that the news seems to have attracted little, if any, media attention on Tuesday.\n\nSlaoui brushed off accusations that he might be biased about the efficacy of Moderna's vaccine. Still, considering that Moderna is already working with the NIH, we certainly found it surprising that such preliminary results involving a group of just 8 patients could have such an outsize impact on the market. 🖐🏾More in comments👇🏾",
    "tags": [
        "Other"
    ],
    "year": "5"
}