{
    "filename": "CB1Cy7vlY7Y.jpg",
    "description": "‼️PART1‼️ I’m about to blow your mind🧠 I often say “we live in a Matrix,” but many have inquired, what does that saying really mean? Facts over Emotions🙅🏾‍♀️ It simply means you live in a controlled society created to manipulate and harvest your #energy , all while alluding to the idea that you are unambiguously free. Let’s get 222 it!✨ Freedom does NOT exist in America. In FACT, freedom does not exist for ANYONE who is consider COLLATERAL to the Federal Government. Let’s be Clear⚡️ Raise your hand if you have a Birth Certificate issued by the United States of America 🙋🏿‍♀️ Ever wondered why your name is written in all CAPS? Ever wondered why your name in ANY legal documentation (Bank Card, Drivers License, Tax Return) is ALWAYS written in all CAPS? ✨ Did you know your name being written in all caps signifies that you are a #Corporation of The United States of America and therefore, are NOT a natural born citizen‼️ Hence, why our birth certificates are written on Banknote Papers, the same banknote papers owned by the Royal Family. Due to the fact that we can’t sign papers upon birth; our parents unknowingly signed our freedom away; unintentionally enslaving us to the U.S. Corporation. It’s a trade off! In exchange for our Freedom, we received #Healthcare , Education, Welfare, Employment, Social Security, Tax Return, Taxes, Benefits (Student Loans, Unemployment) ETC✨ In LEGAL TERMS, our NAMES represent “Artificial Persons”~ So, what does that mean, EXACTLY? Well, Corporations are the most common types of artificial persons. Nonetheless, a Natural Person (WHO WE REALLY ARE OUTSIDE OF THE UNITED STATES) is a human being; a real living person. However, a Legal Person (WHO WE ARE WITHIN THE UNITED STATES) is a being, real or “imaginary” whom the LAW regards is capable of rights and duties. But HOW is this true if we are a Federal Republic and Representative Democracy based COUNTRY govern by the sovereignty of its citizens?💫 Please stay tuned 444 PART 2‼️ I will be posting another post today at 6pm! 444 more information on #martiallaw #pizzagate #stop5g #operationmockingbird #id2020 #operationpaperclip #deepstate Check Pervious Post🦋",
    "tags": [
        "Qanon",
        "5G",
        "Deep State"
    ],
    "year": "6"
}