{
    "filename": "CB66_egn-n9.jpg",
    "description": "❗️It's time to make your #voice heard now! Take action TODAY by following the LINK in our BIO ⬆️ above ⬆️ to send a pre-drafted, customizable 📩 email to your elected officials, including U.S. Education Secretary #betsydevos; the #illinoisstateboardofeducation and its Superintendent, #carmenayala.\n⠀\nThe #illinoisdepartmentofpublichealth and the Office of the #Governor have not confirmed and have been unable to produce ANY findings from the #CDC to support the theory that: ⠀\n1️⃣ #healthy #people wearing cloth face coverings prevents the spread of #illness;\n2️⃣ forced separation of individuals slows transmission; and\n3️⃣ #asymptomatic transmission of illness occurs.\n⠀\nIn other words, there is 🚫NO evidence or #scientific data to support that the CDC and the Illinois Department of Public Health have based their guidelines on #science or #medical #evidence.\n⠀\nThus, these guidelines/considerations, on which Governor Pritzker and the Illinois State Board of Education are basing their guidance, are founded on inconclusive assumptions with 🚫NO reputable peer-reviewed studies to support them.\n⠀\nIf you have a personal perspective to share as a #teacher, #student, #parent or concerned #citizen, please add it to the top section above the provided message. You can also edit the subject line and the pre-drafted message as needed.\n⠀\nAdditionally, if these measures would cause you to pull your #child from the #Illinois #school system — or if you are a school #employee considering leaving your position as a result of the measures — be sure to mention that in your message.\n⠀\nWhen you are done, please share this important campaign with your friends, #family and #neighbors.\n⠀\n#standforhealthfreedom #illinoismedicalfreedom #illinoiseducator #wedonotconsent #stand",
    "tags": [
        "Other"
    ],
    "year": "6"
}