{
    "filename": "CBCXP_TngSj.jpg",
    "description": "To my BIPOC sisters, and brothers I see you.⁣\n⁣\nI decided… instead of trying to say, do, or be the right thing… ⁣\n⁣\nTHIS was my time to LISTEN.⁣\n⁣\nI watched your stories, your videos, I read your posts.I reached out to many of your privately, I checked in, I ASKED! ⁣\n⁣\nMany of you expressed that you feel a PRESSURE of needing to be a PILLAR right now, and truthfully hasn’t found the courage to speak up…⁣\n⁣\nI want you to KNOW that your voice has been so appreciated right now. Know that people like myself have been SO DEEPLY touched by your stories and sharing.⁣\n⁣\n⁣\nThis is a time for us to come into deeper UNITY. This is a time for the unheard voices to be heard. This is a time for us to recognize our blind spots. TO BE EDUCATED!!⁣\n⁣\nThis is a time for us to OPEN UP OUR HEARTS AND COME INTO A DEEPER STATE OF LOVE FOR ONE ANOTHER.⁣\n⁣\nListen… I KNOW that there have been generations upon generations of racial divide, hatred, and violence. And this is NOT OK. ⁣\n⁣\nWE NEED TO LOOK AT THIS. WE NEED TO DIVE INTO THE SHADOWS OF RACISM.⁣\n⁣\nHowever, I feel that there is something EVEN DEEPER going on that is important we also address. ⁣\n⁣\nI’m not claiming to be an expert.. I’m not claiming to know what the truth is…⁣\n⁣\nHowever I’ve seen evidence of bricks being delivered to where they know there will be mass gatherings⁣\n⁣\nI’ve seen evidence of people being hired to go to these protests and intentionally cause harm ⁣\n⁣\nI’ve seen evidence that this has been a ploy to divide us even further.⁣\n⁣\nWhat I do know that TRUTH is a FREQUENCY.⁣\n⁣\nAnd I am tired of being lied to by the media, by the governments, and by the “trusted sources.”⁣\n⁣\nHumanity it is time for us to CLAIM THAT WE WANT TRUTH AND WE WANT IT NOW.⁣\n⁣\nIt’s time for us to CLAIM OUR OWN SOVEREIGN GOD SELF.⁣\n⁣\nIt’s time to say WE DO NOT CONSENT TO MASS MANIPULATION, LIES, AND PROGRAMMING OF SEPARATION AND DIVIDE OF ANY SORT.⁣\n⁣\nHUMANITY.⁣\n⁣\nTHIS IS THE TIME WE HAVE BEEN WAITING FOR.⁣\n⁣\nTHIS IS THE GREATEST OPPORTUNITY WE HAVE TO CREATE MORE LOVE, COMPASSION AND UNDERSTANDING THEN EVER BEFORE.⁣\n⁣\nWE ARE PURGING THE COLLECTIVE CONSCIOUSNESS OF LIES AND ILLUSION.⁣\n⁣\nIT’S TIME TO DO THE WORK PEOPLE. HUMANITY WE GOT THIS!!",
    "tags": [
        "Other"
    ],
    "year": "6"
}