{
    "filename": "CBG2_ynAE0b.jpg",
    "description": "All my teenage life I found myself on antidepressants, anxiolytics, and stomach/reflux meds as I battled anorexia (and would sometimes purge). Multiple endoscopies and a colonoscopy later, I came back positive at 17 for Barrett’s esophagus. ⁣\n⁣\nBarrett’s esophagus involves abnormal changes in the cells lining the esophagus and Can be precancerous. Prior to that diagnosis, I had been on years of proton pump inhibitors medications and literally was starving myself 🥴⁣\n⁣\nProton pump inhibitors (PPIs) are medications that suppress gastric acid production - such as Nexium, Prevaid, Prisolec and Protonix. They are known for the following adverse effects:⁣\n⁣\n✅ induce magnesium and iron deficiency⁣\n✅ increased fracture risk⁣\n✅ increased risk of SIBO⁣\n✅ increased risk of serious gut infections such as Campylobacter and Clostridium difficile⁣\n✅ facilitated gut dysbiosis⁣\n✅ increased risk of death (and recent studies show increased stroke risk ⁣\n✅ increased risk of micronutrient deficiency, especially B vitamins ⁣\n⁣\nIt wasn’t until I found the book Gut and Psychology Syndrome by Dr Natasha McBride that I realized how much my gut health was affecting my mental state...even the eating disorder. That began my path of integrative medicine and healing a leaky gut ❤️⁣\n⁣\nNext week I’ll be doing a free workshop where you can learn about leaky gut, resources and tools to support healing, essential oils and supplements I have used to help and nutrition tips. I would love to have you join. Our healing is critical ...and it’s critical we share it ❤️ Learn more in my stories or let me know below if you need an invite 👋🏿👋🏼👋🏽👋🏾⁣\n⁣\n⁣\n⁣\n#denvermama ⁣\n#coloradomama ⁣\n#guthealthmatters ⁣\n#gutbrainconnection ⁣\n#lymestop⁣\n#dnrs ⁣\n#autoimmunehealing ⁣\n#leakygutsyndrome ⁣\n#leakyguthealing ⁣\n#irritablebowelsyndrome ⁣\n#barrettsesophagus ⁣\n#gerddiet⁣\n#hippiemama⁣\n#bohomama ⁣\n#hippiesoul ⁣\n#bohosoul ⁣\n#wildandfreemamas ⁣\n#homebirthmama ⁣\n#mentalhealthmama ⁣\n#mentalhealthmovement ⁣\n#anorexianervosarecovery ⁣\n#lymediseaserecovery ⁣\n#believemothers ⁣\n#depressionawareness ⁣\n#anxietysupport \n#idahomom \n#believemothers \n#workfromhomenurse",
    "tags": [
        "Other"
    ],
    "year": "6"
}