{
    "filename": "CBhWbxfA9hB.jpg",
    "description": "Research ID2020! \nFollow @alkaline_electric_vegan & my back up page @alkaline.electric.vegan 🎥👨🏻‍🔬 Laser-Scan refers to the method of both burning a barcode into a prisoner's skin and reading the same barcode. This was used for identification purposes for prisoners in Skynet work camps, which makes them analogous to the markings given to prisoners in many historic and modern prisons and prison camps.\n\nKyle Reese shows his barcode brand to Sarah Connor in The Terminator during the parking garage scene. Derek Reese and Allison Young are both shown receiving their barcode brands in Terminator: The Sarah Connor Chronicles. \nReese. Why me? Why does it want me?\n\nThere was a nuclear war. A few years from now. All this. This whole place. Everything. It's gone. Just gone. There were survivors. Here. There. Nobody even knew who started it. It was the machines, Sarah.\n\nI don't understand.\n\nDefence network computers. New, powerful. Hooked into everything. Trusted to run it all. They say it got smart, a new order of intelligence. Then it saw all people as a threat, not just the ones on the other side. Decided our fate in a microsecond.\n\nextermination.\n\nDid you see this war?\n\nNo. I grew up after it. In the ruins. Starving. Hiding from HKs.\n\nHKs?\n\nHunter-killers. Patrol machines built in automated factories. Most of us were rounded up, put in camps for orderly disposal. This was burned in by laser scanner. Some of us were kept alive, to work. Loading bodies. The disposal units ran night and day. We were that close to going out forever. But there was one man who taught us to fight, to storm the wire of the camps, to smash those metal motherfuckers into junk. He turned it around. He brought us back from the brink. His name was Connor. John Connor. \n#arnoldschwarzenegger #alkalineelectricvegan #terminator #arnie #id2020 #artificialintelligence #ai #predictiveprogramming #programming #film #movie #oldschool #retro #barcode",
    "tags": [
        "Other"
    ],
    "year": "6"
}