{
    "filename": "CBI9rvpDIYk.jpg",
    "description": "Conspiracy theory or truth theory? I have known about the corruption for years but just recently decided to speak up about it a little bit. Everyone I had previously spoken to about the elites, the government lies and everything being fabricated, ALWAYS thought I was a crazy conspiracy theorist so I stopped speaking up. However, recently, I feel compelled to speak UP. Once you start learning about everything that’s happening behind the scenes - you suddenly realise you can’t have normal conversations anymore. Everything is an illusion. You see signs everywhere.⁣\n⁣\nA lot of what we have always been told & taught just doesn’t add up. There is SO much misinformation out there. Use your brain, intellect & intuition to find your answers.⁣⁣\n⁣⁣\nQuestion everything. Don’t believe blindly. ⁣⁣\nWhat’s the distraction?⁣⁣\nAre there hidden agendas?⁣⁣\nIt is so much easier to fool people than it is to convince people that they have been fooled.⁣⁣\nA smalllllll list of things you can watch & research to wake up:⁣⁣\n⁣⁣\nOut of Shadows documentary - it shows how the media uses CIA tactics to manipulate the masses. Exposing Hollywood & mainstream media⁣⁣\nFall of the Cabal⁣⁣\nDark to light ⁣⁣\nWikiLeaks - Podesta Emails⁣⁣\nWikiLeaks - Hilary Clinton’s Emails⁣⁣\nPizzagate ⁣⁣\nAdrenochrome⁣⁣\n⁣⁣\nDon’t use google to find your information - change your search engine to DuckDuckGo as google censors everything. These reveals are shocking. Research, research & research. ⁣⁣\n⁣⁣\nDespite all of the chaos, there is so much good happening behind the scenes, it just isn’t being broadcast on the media and I doubt it ever will be. ⁣⁣\n⁣⁣\nThe old paradigm - based on deception, is literally crumbling before our eyes.⁣⁣\n⁣⁣\nWe are transitioning into the Age of Aquarius. A paradigm of unity & abundance. The transition period is hard, tiring & can be worrying but don’t let fear or worry get to you. I am currently an exhausted mess hahaha but it’s all part of the plan. Trust it 🙌🏻 ⁣⁣\n⁣⁣\nThings currently look dark & messy but the future is bright. Trust the divine plan. The biggest truth bomb in history is about to drop. ⁣⁣\n⁣⁣\nThe world is waking up. 2020 - The Great Awakening. Buckle up & enjoy the ride 🌟",
    "tags": [
        "Other"
    ],
    "year": "6"
}