{
    "filename": "CBjXTY3DZWN.jpg",
    "description": "Upcoming weather events & Orwellian agendas & motives to be vigilant of & prepare for. •\n\nThis is not fear-mongering, it’s being realistic & vigilant, knowing that what we have already endured will continue happening, because people simply don’t get it that these are orchestrated events. •\n\nSo many are ensnared in the matrix mind-control hypnosis programming and have no clue how to connect all the dots, & can benefit from being pointed in the right direction as far as what to research & find the gnosis for themselves. •\n\nWhat are solutions? There are many, but the first one is to have COURAGE, to speak your truth & not be afraid of being mocked for stating the truth of the direction our planet is heading. •\n\nWe can redeem our income in lawful money so we aren’t endorsing the (non-federal, private corpseoration) fed reserve, we can file notices of liability with our city councils on 5G and any other sort of tyrannical unconstitutional law or ordinance they approve. •\n\nWe can take steps every day to become more self-sufficient, & we can not fund corpseorations like big pharma & Agra that are polluting the environment, toxifying the human condition & causing suffering for millions of sentient beings. •\n\nWe can talk to our neighbors & hand out informational flyers on 5G, vaccine ingredients, inflated death statistics of the scamdemic, etc. •\n\nWe can work on becoming better people, we can live righteously & virtuously and not violate Natural Law & the property rights of other sentient beings. We can wear the full armor of God & shine the light of truth on all wickedness & deception. •\n\nNow, let’s get into these topics we face. \nAgenda 21/2030, technocracy, mandatory vaccines, collectivism, transhumanism, artificial intelligence, 5g,  climate change hoax, weather warfare & Covid scamdemics:\n\nThe agendas that make up the road to the centralized one world government, aka the new world odor. •\n\nSimilar & interrelated motives & psychological operations that are all in motion at once, with the goal of restricting basic rights, liberties & freedoms, body autonomy, resources, energy usage, rights to travel, assemble & bear arms... Cont’d 👇🏽",
    "tags": [
        "Other"
    ],
    "year": "6"
}