{
    "filename": "CBKRzcYD2G8.jpg",
    "description": "YUP!!!!\n.\n.\n***ATTENTION ***\n.For those who don't know yet.\nMAKE THIS GO VIRAL\n.\n.\nCLUES ARE BEING LEFT FOR US ALL AND HAVE BEEN FOR 3.5 YEARS. TRUMP AND Q (HIGH INTELLIGENCE MILITARY) ARE TRYING TO WAKE US ALL UP!Â  GO CHECK IT OUT NOW AND FOLLOW IT DAILY ASAP!!! NOW, NOW, NOW!\n.\nQmap.pub\n.\nFollow Trump on facebook and Twitter and Instagram.\n.\nFB, TWITTER andÂ  QMAP.PUB are the ones to watch EVERYDAY!!! THIS IS SERIOUS! I HAVE NEVER BEEN MORE SERIOUS IN MY LIFE!\n.\n@realdonaldtrump\n.\n.\n.\n\nTrump and Q are trying to tell all of us what the solution is. PAY ATTENTION!! We are the solution to stand together in peace to defeat them.Think about it, evil begets more evil. Love extinguishes evil. It's a universal law!!! Psychopaths use manipulation tactics to divide and conquer. All standing together strong in love is the only way. Picture this.....a dark room. What happens when you flip a light switch on??? That darkness goes running like the week ass it is. Think narcissists, sociopaths and psychopaths. How do you defeat them? Not by staying in the relationship and fighting back and causing more destruction. You tap out peacefully with love and no attachment. You disengage in their manipulation. Please I need everyone to remember how to defeat psychopaths. Please pay attention...............\n.\n.\nFollow 1 follow all\n.\nJOIN MY FACEBOOK GROUP\nhttps://www.facebook.com/groups/546165259647484/?ref=share\n.\nINSTAGRAM\n@psychopath_awareness_1\nwww.instagram.com/psychopath_awareness_1\n.\n.\n\n@psychopath_awareness_2\nwww.instagram.com/psychopath_awareness_2\n.\n.\n\nADVANCED\n@the.great.awakening.worldwide\nwww.instagram.com/the.great.awakening.worldwide\n.\n.\n\nMORE ADVANCED (new) @5d_starseed_awakening\nwww.instagram.com/5d_starseed_awakening\n.\n.\n.\n.\n.\n#psychopath \n#narcissist \n#gaslighting #spiritualawakening \n#wakeup \n#woke \n#truther \n#starseed \n#lightworker \n#godwins \n#truthseeker #questioneverything #digitalsoldiersÂ  #deepstatetakedown .\nRESEARCH\n#Pizzagate \n#agenda21 \n#agenda2030 \n#adrenachrome \n#qanon \n#qmap\n#thegreatawakening\n#unmask",
    "tags": [
        "Qanon",
        "Deep State"
    ],
    "year": "6"
}