{
    "filename": "CBlOcGWiABb.jpg",
    "description": "Wie viele Zufälle bis es mathematisch gesehen kein Zufall mehr ist? [CoronaAppFake]\nHab gehört je mehr Leute man „ansteckt“, verpetzt, meldet, spioniert und kennzeichnet, so schneller steigt man Level auf.\n\nLasst uns spielen.\nIst ja alles nur ein Spiel,\nmacht es Spaß andere zu melden??\nDie, das noch gut sprechen, verbreiten und dazu auffordern, diese TeufelsApp zu nutzen.\nIhr seid alle Helden, ja?\n\nHabt ihr Pädophile gemeldet, aggressive Menschen gemeldet, Vergewaltiger, Straftäter, irgendwas der gleichen, die eine Gefahr GEGEN DAS VOLK sein könnten, aufgelistet, angesprochen, WAS DAGEGEN ENTWICKELT, unternommen?? Wir leben in einem Land, wo selbst Beweismaterial aus der Asservatenkammer der Polizei verschwindet.\n\nGibt das mal bei Google ein👇🏻 [Polizisten sollen sich in Asservatenkammer bedient haben]\n[Richter spricht Vergewaltiger frei- Bewährung]\n\nVersteht ihr wieso die ganzen lächerlichen, unmoralischen Freisprüche? „Im Namen des Volkes auch noch“.\nDas sind Richter, „Beamte“ , Politiker, Polizei, Highsociety. Das sind alle hochrangige, die halten alle zusammen! Folge dem Geld.\nDie FakeNews decken ihren misst!\nDieser Sumpf ist so tief, wie niemand sich vorstellen kann.\nVersteht ihr, was für ein Wahnsinn das ist?\nWas hier abgeht?\nLeute, wer diese App benutzt, der hat sich zu 100% zur 2. FakeWelle bekannt!\n\n1. Maske - Das Volk stimmt blind zu?!?!?\nAbgeordnete müssen keine in geschlossenen Räumen tragen, \nErklärung gibt es keine!!!\nSie sind wohl keine Menschen.\nOder sie wissen, dass die Maske nichts bringt und nur schadet!\nKamera an Maske auf, Kamera aus Maske ab.\n#FakeNews\n\n2. Corona App- Das Volk stimmt blind wieder zu?!?!?\nWie viele Infizierte kennen Sie?\nWieso diese Massenpanik, wenn es keinen Grund dazu gibt?\nWo sind die ganzen Patienten, Infizierten und kranken Menschen?\nLeute, gehts noch?\n#Plandemie\n\n3. Wir bekennen uns blind und ohne jegliche Bedenken in fremde Hände!\nOhne Zweifel, ohne eigene Meinung, ohne zu hinterfragen, ohne zu erkennen, dass alles geplant war und nur gegen uns Menschen gerichtet arbeitet, wir aber durch UNSERE EIGENE DUMMHEIT-Unwissenheit- Angst-Panik, blind zustimmen. \nIhre FakeNews leisten top Arbeit.\n\nWeil ihre Masche wirkt!",
    "tags": [
        "Other"
    ],
    "year": "6"
}