{
    "filename": "CBnakexg7oi.jpg",
    "description": "Leave your thoughts in the commentsðŸ‘‡\n\nAt least 3,000 children have fallen victim to sex abuse in the French Catholic Church since 1950, the president of a commission set up to investigate the claims said Wednesday.\n\nJean-Marc Sauve said preliminary figures suggested some 1,500 clergy and other church officials carried out the abuse.\n\nThe commission was set up last June at the request of French bishops after a series of pedophilia cases that rocked the Church in France and abroad.\n\nA hotline urging victims to come forward has received 5,300 calls over the past year, Sauve said.\n\nThe number of estimated victims represents more than 40 cases per year on average over the past seven decades. \"\"I am profoundly convinced that there are many more victims,\"\" Sauve told journalists in a videoconference. \"\"What we do not know is how to consolidate these two sources\"\" of potential cases, the hotline and the commission's own inquiries, he said.\n\nThe call for witnesses has been extended to October 31 and reviews of church archives have resumed after being suspended during France's coronavirus lockdown.\n\nPope Francis has vowed to confront criminal offenses in the church's ranks, including several cases where top officials knew of sexual assault but failed to inform the authorities.\n\nLast year, Francis passed a measure obliging those with knowledge of child sexual abuse to report it to their superiors, a move that was expected to bring numerous new cases to light.\n\nThe commission headed by Sauve, a high-ranking civil servant, includes legal experts, doctors, historians, sociologists and theologians.\n\nIt is expected to produce a final report next year with recommendations on how to prevent abuse.\n\nSource: Daily Sabah \n#killilluminati #newworldorder #theearthisflat #thirdeye #conspiracytheory #conspiracytheories #stoplies #truth #truther #truthseeker #truthhurts #truthersunite #truthisstrangerthanfiction #truthhiddeninplainsight #butterflyeffect #truthunedited #mkultraexposed #truthlife #theendisnear #celebsexp #stoppedofilia #pedophelia #pedogate #pizzagate #frazzledrip #clintonbodycount #podestaemails #epstiendidn'tkillhimself #childtrafficking#childabuse",
    "tags": [
        "Qanon",
        "New World Order"
    ],
    "year": "6"
}