{
    "filename": "CBurEsNh116.jpg",
    "description": "DOE\n°\nDoe waar je je goed bij voelt. In een wereld als vandaag is het zo belangrijk dat je daar werk verricht waarvan je zelf gelooft dat het noodzakelijk is. Ik ben wakker, ben jij het ook? De wereld staat op het punt te veranderen. Ben ik een complotgekkie of heb ik een goede helikopterview en zie ik sneller strategische moves. Daar kunnen we pas echt over 10jaar antwoord op geven. Ik gebruik logica en daarnaast is er tal van informatie die gewoon online staan waarmee je de waarheid kan zien. °\nWel verbaas ik mij over het aantal mensen dat nog zoveel wegkijkt en niet op de hoogte willen zijn van onderwerpen die zo belangrijk zijn. Mensen kunnen gewoon weg niet geloven dat dingen als mensenhandel, corrupte overheid gewoon niet bestaat. Maar als je nog steeds niet geloofd dat mensen in staat zijn tot vreselijke dingen dan zou ik maar eens in de geschiedenis van de mensheid duiken. Daarnaast doet het pijn om er naar te kijken en maakt het bang. Het dus makkelijker om weg te kijken en net te doen alsof het er niet is. Ik begrijp het, maar deze spoetwet gaat te ver en gaat per 1 juli in en het is 5 voor 12!\n°\nHelaas zit dit niet in mijn aard, wegkijken... daarom doe ik ook mijn best zoveel mogelijk vegan te eten en kom ik op voor dat gene wat een stem verdiend. Ik ben blij zoveel bekende, vrienden en kennissen te hebben gezien op het malieveld gister. Mijn hartje wordt warm van iedereen die deze mening met mij deeld. Het verbaast mij dat er nog zoveel ondernemers thuis op de bank blijven zitten. Ik heb zoveel respect voor de mensen die met hun hele gezin daar zijn geweest. Je kinderen bewust opvoeden is noodzakelijk! Er zijn veel mensen wakker maar helaas nog niet genoeg! ° \nIk zal niet stoppen met het delen van informatie op mijn Facebook en proberen mensen bewust te maken. Het is overigens niet voor mezelf maar voor mijn kleine meid die moet gaan opgroeien in een hele bizar wereld. ❤ lets hope for the best. #letsraiseyourvoice #WG1WGA #demonstratie #malieveld #liefde #bloemen #respect #bizar #wereld #id2020 #carona #spoetwet",
    "tags": [
        "Other"
    ],
    "year": "6"
}