{
    "filename": "CBWNhXsgEp2.jpg",
    "description": "Agenda 21/2030, technocracy, collectivism, transhumanism, Artificial Intelligence, 5g, climate change & Covid/mandatory vaccination. •\n\nSimilar & interrelated motives & psychological operations that are all in motion at once, with the goal of restricting basic rights, liberties & freedoms, resources, energy usage, rights to travel, assemble & bear arms, all in the name of collectivism, which means that inherent individual rights must be given away to “protect society”, to “preserve nature”, to “fight climate change”- the boogie men that they create, via Hegelian Dialectic & Problem-Reaction-Solution. •\n\nWe all are seen as mere resources that must be monitored, regulated, vaccinated, microchipped, propagandized & controlled to a greater extent, “for the common good” and “for our protection”. •\n\nSo, they care about our “health” all of a sudden after poisoning our water with fluoride, our food with GMOs, mandating toxic vaccines for kids to go to school, unleashing 5G & spraying us with chemtrails? 🙃🤔 •\n\nFirst it was “global warming”, then switched to “climate change”, now we must “fight climate change” by scaling back all of our energy usage & switching to unreliable renewables, using less water, less energy & allowing them to implement a technocratic currency system of “carbon credits” which is similar to the social credit scoring system already present in China (the template for the NWO & Agenda 2030 centralized system of control). All the while they spray our sky with toxic Chemtrails & modify our weather every day, worldwide. •\n\nNow with the Covid scamdemic: create a fear campaign, scare everyone into submission from something less deadly than seasonal flu, then offer the solution with mandatory vaccines, digital IDs, facial recognition, contact tracing, quarantines & re-education camps for those who refuse the vaccine. Give up inherent liberties & rights “to protect public health”. •\n\nHopefully more are able to connect the dots on these disingenuous agendas full of deception & hellbent on reducing the population & completely controlling every aspect of the lives of those who live. •\n\nCont’d 👇🏽",
    "tags": [
        "Other"
    ],
    "year": "6"
}