{
    "filename": "CBWTaHVBcJ0.jpg",
    "description": "The #BillandMelindaGatesFoundation gave more money from 2018-2019 to the #WorldHealthOrganization than any entity except the U.S. government, who recently cut ties with the organization.\nMelinda Gates, the wife of #Microsoft founder Bill Gates, has revealed who she believes should be the first to receive the #COVID19 vaccine.\n\nIn a Q&A with TIME ahead of the 2020 #GlobalVaccinesSummit, Gates stated that black people should be second-in-line to be vaccinated immediately after health care workers.\n\nAt the June 4 summit, co-chair Bill Gates announced that the Gates Foundation would give $1.6 billion to the Vaccine Alliance (GAVI) over the next five years.\n\nTIME: The scale of anti-racism protests we're seeing right now is incredible. How does this moment relate to your work in health equity?\n\nGates: What happened to #GeorgeFloyd was brutal and horrible and should never happen to anyone, anywhere. This is a moment of reckoning in the #UnitedStates. We all need to really pause during this time and learn as best we can from it. Even before we saw this senseless death, #COVID had already started to show us gaps and structural problems in our country. We are seeing black men die at a disproportionate rate. We know the way out of #COVID19 will be a vaccine, and it needs to go out equitably.\n\nTIME: How do you make sure that happens?\n\nGates: You make sure the vaccine doesn't go to the highest bidder. GAVI uses a pooled set of resources from governments and private citizens, so you can make sure that when you go to purchase the vaccine, you purchase it in bulk at low prices. We've gotten the delivery system, over 20 years, really set up appropriately. This pledging event means governments around the world will step up in global cooperation to all say, 'We care about this vaccine getting out equitably,' [since their contributions will help GAVI secure and distribute doses when they become available]. The first people that need this vaccine are the 60 million health care workers around the world. They deserve to get it before anybody else. Then you start tiering. 🖐🏾More in comments👇🏾#CoViD1984 #VaccineAgenda #Event201 #GlobalHealthSecurityAgenda #BlackLivesMatter",
    "tags": [
        "Bill Gates"
    ],
    "year": "6"
}