{
    "filename": "CBWxKBmgWQM.jpg",
    "description": "🧐 While this pic could be a representation ONLY (if it's not authentic) words are forever ⤵️\nTheHill\nJune 28, 2010 - 04:29 PM EDT\n\nBiden remembers Byrd as a great leader, 'dear friend'\n\nBY JORDAN FABIAN\n\nVice President Joe Biden on Monday remembered the late Sen. Robert Byrd (D-W.Va.) as a legend of the upper chamber and a friend who was there for him in a time of need. \nBiden spoke while discussing the federal stimulus package at a General Electric plant in Louisville, Ky. Biden, who served in the Senate for 36 years, remembered how Byrd showed up to the funeral of his wife and one-year-old daughter after they were killed in a car crash weeks following his 1972 election.\nThe vice president called Byrd \"\"a guy who was there when I was a 29-year-old kid being sworn into the United States Senate shortly thereafter; a guy who stood in the rain, in a pouring rain, freezing rain outside a church as I buried my daughter and my wife before I got sworn in, Robert C. Byrd,\"\" adding that \"\"we lost the dean of the United States Senate, but also the state of West Virginia lost its most fierce advocate and, as I said, I lost a dear friend.\"\"\nBiden also memorialized Byrd, the longest-serving U.S. lawmaker ever, as an institution, and said that \"\"the Senate is a lesser place for his going.\n\"\"He may have spent half a century in Washington. But there’s a guy — if anybody wondered — he never, never, never, never took his eye off his beloved mountain state,\"\" Biden said. \nFor the people in the back!!!\nJoseph Manchin [pictured behind Byrd] is an American politician serving as the senior United States Senator from West Virginia, a seat he has held since 2010. A member of the Democratic Party, he was the 34th governor of West Virginia from 2005 to 2010 and the 27th secretary of state of West Virginia from 2001 to 2005.\n#darktolight\n#generalflynn\n#savethechildren\n#pizzagate\n#mkultra\n#420\n#freeyourmind\n#followthewhiterabbit\n#operationmockingbird\n#operationpaperclip\n#projectbluebeam\n#dispensary\n#STICKY\n#Godwins\n#pray\n#greatawakening\n#liberty\n#magnumpi\n#angels\n#georgefloyd\n#downyougo🐇🕳\n#truthisstrangerthanfiction\n#walkawaymovement\n#conspiracytruther\n#purple\n#fallcabal\n#redpill💊\n#justice",
    "tags": [
        "Qanon"
    ],
    "year": "6"
}