{
    "filename": "CC1L2laFkeO.jpg",
    "description": "“People should not be walking around in masks- there’s no reason to be walking around in masks. \n\nWhen you’re in the middle of an outbreak, wearing a mask might make people feel a little bit better, & might even block a droplet, but it’s not providing the perfect protection that people think that it is, and often, there are unintended consequences. \n\nPeople keep fiddling with the mask and they keep touching their face....but when you think masks, you should think of health care providers needing them, and people who are ill.” \n\n-Anthony Fauci, March 2020- on wearing masks to protect from CV\n\n•\n\nOn Tuesday, July 14th, 2020, Dr. Anthony Fauci said he opposes conducting a controlled study on the effectiveness of masks to prevent the spread of the coronavirus.\n\n•\n\nFauci discussed the idea during a conversation with students of Georgetown University’s Institute of Politics and Public Service.\n\n•\n\nOne student asked if it is possible to do a study in the midst of a pandemic about the effectiveness of wearing masks.\n\n“What kind of studies can we do right now in the middle of the pandemic about masks and transmission of the disease?” the student asked. “Or are we just relying on anecdotal evidence because we are not able to do those kind of studies right now?\n\n•\n\n“Right now, I’m convinced enough in the summation and totality of the data that has been analyzed by meta-analysis that I’m convinced that the benefit of wearing a mask clearly is there and is better than not wearing a mask,” he said:\n\n•\n\nIn theory, a randomized controlled study would test the spread of the virus among people wearing masks versus people not wearing masks and possibly scientifically demonstrate the effectiveness of wearing one.\n\nBut Fauci balked at the idea.\n\n“I would not want to do a randomized controlled study because that would mean having people not wear masks and see if they do better,” he said.\n\nFauci suggested he would never ask an individual to participate in a study that would involve not wearing a mask.\n\n“I think that to do the study would be kind of difficult to do because then you’d have to tell people not to wear masks...\n\nCont’d👇🏽",
    "tags": [
        "Other"
    ],
    "year": "7"
}