{
    "filename": "CCBfa7wh1g3.jpg",
    "description": "Thoughts?\n\nDr Anthony Fauci said that while he’s “cautiously optimistic” that a #coronavirus vaccine will be available by the start of 2021, he thinks it unlikely the U.S. would reach #herdimmunity if too many people refused to take it.\n\nThe top infectious disease expert told CNN he would settle for a vaccine that was 70 percent to 75 percent effective but warned it was “unlikely” that the U.S. would be able to quell the outbreak if 30 percent of the population refused to be vaccinated.\n\nFauci’s concerns echo those of Bill Gates who also warned last week that the “final hurdle” for a new Coronavirus vaccine will be ensuring that the public actually takes it.\n\nNY Post reports: Fauci, head of the National Institute of Allergy and Infectious Diseases, noted that the incomplete protection and the fact that many people say they will skip the vaccine makes it “unlikely” that the nation will achieve sufficient immunity to stem the outbreak.\n\nA recent CNN poll found one-third of #Americans said they would not try to get a vaccine — even if it is widely available and low cost.\n\nHerd immunity is achieved when a sufficient percentage of a population is immune to an infectious disease, either through prior illness or vaccination.\n\nIn the next three months, three vaccines are expected to be studied in major clinical trials — but “there is a general anti-science, anti-authority, anti-vaccine feeling among some people in this country — an alarmingly large percentage of people, relatively speaking,” Fauci said.\n\nGiven the influence of #antivaxxers, he added, “We have a lot of work to do” to educate people on the truth about vaccines. “It’s not going to be easy,” said Fauci, a member of the #WhiteHouse task force on the pandemic. “Anyone [who] thinks it will be easy is not facing reality. It’s going to be very difficult.” He said the government has a vaccine education program to spread the message. “We have a program right now that’s going to be extensive in reaching out to the community,” he said. 🖐🏾More in comments👇🏾#Event201 #GlobalHealthSecurityAgenda #VaccineAgenda #CoViD1984",
    "tags": [
        "Bill Gates"
    ],
    "year": "6"
}