{
    "filename": "CCC1clvpOuv.jpg",
    "description": "Melinda Gates wants to deliver coronavirus vaccine based on racial groups, BLACKS FIRST, the Healthcare workers, sick and older people!\nPLEASE EXPLAIN HOW YOU SEE THIS?🙏🏽\n\nSo they tested their Vaccine on a Superhuman Gene. The only one they ever found and were able to clone. Right now they have tons of it. Oh!..by the way it came from a \"\"Black Woman, Henrietta Lack, go look her up. That coupled with a documented Scientific fact and Truth that is evident in a Scientific Lab, that \"\"Black\"\" people have stronger Organs and make the best Organ Donors with recipients having a 90% chance of success compared to only 50% chance of success if the Organ came from an \"\"White\"\"person. And these two Clowns expect you to believe that an Influenza strain (not a Virus because 1. They have never been able to isolate a Virus. 2. Viruses are waste matter are never proven to be contagious) is more deadly to \"\"Black\"\" people than \"\"White\"\" people?!🤔... This is what people can get away with by lying straight in you face because they're confident their system of making you into a stupid incompetent non-thinking dependent jackass who is void of any sense or reasoning and has to be fed, taught, controlled and governed because they are nothing but DUMB LUNATICS!\nVideo @researchflatearth_ \n\nFOLLOW 👉 @miri.p.swiss.truths \nFOLLOW 👉 @miri.p.swiss.truths 🔥🔥\nFOR MORE CONTENT AND TRUTH! 🔥🔥 #hr6666 #deepstate #globalreset #deepstateexposed #thenewnormal  #globalistagenda \n#shadowgovernment #trustinjesus #MRNA #agenda21 #agenda2030 #wakeupsheeple #wedonotconsent #predictiveprogramming #theworldisastage #microchip #mkultra #freemasons #markofthebeast #secretsocieties #cabal #governmentcorruption #pizzagateisreal #bigpharma #newworldorder #rockefellerfoundation #id2020 #event201 #transhumanism #exposebillgates",
    "tags": [
        "Qanon",
        "Bill Gates",
        "New World Order",
        "Deep State"
    ],
    "year": "6"
}