{
    "filename": "CCcyapYp3VT.jpg",
    "description": "In a world where cancel culture appears to be the new normal, we need to stand up for our beliefs and what is right.\nI was told awhile back that I needed to stop participating in “toxic positivity.”\nNo joke, that’s a real thing now.\nIt seems like everyone is offended by something these days. Even happiness and an optimistic outlook can be interpreted as offensive. \nI get it. Life isn’t always sunshine and rainbows.\nI’ve experienced negativity and bullying from others. I’ve been given obstacles in life to overcome. But having an optimistic spirit always helped me push through. In fact, I’m thankful for everything I had to endure because it shaped who I am today.\nBecause in the end, we are in charge of our destiny. We create our life. That’s our superpower. \nDon’t let anyone tell you otherwise.\nIn a world that lifts up victimhood, dare to be a survivor. \nI will never apologize for who I am. I will never apologize for what I believe. And neither should you.\nThis canceling, hate, division, attempts to “re-educate,” and tearing others down needs to end. Tearing others apart never builds one up. \nThe world would be so boring if we all submitted to groupthink. I love meeting people who are different than me; I learn so much from them, and myself.\nWith that said, I’m gonna go out and spread even more good vibes. I’m going to smile more. Laugh more. Talk to strangers more. We need positivity now more than ever.\nAnd I’m not sorry. 😎\n.\n.\n📸 @robandrewlifestyle \n🌊 #sandiego \n.\n.\n#cancelcancelculture #nonewnormal #refusethenewnormal #selflove #california #californiagirl #beachvibes #goodvibes #positiveenergy #smilemore #noworries #happinessisachoice #happinessisfree #sandiegolife #californiacoast #californiabeaches #greatawakening #starseed #lightworker #beachday #vitaminsea #portraitphotography #selflovejourney #socal #californiadreaming #outdooradventures #coastalvibes #beachlifestyle #mindsetiseverything",
    "tags": [
        "Other"
    ],
    "year": "7"
}