{
    "filename": "CCD_GQggCPx.jpg",
    "description": "Repost from @alli.leigh.p\n•\nPosted @withregram • @wearebreitbart The Democrat Party on Monday evening tweeted, then deleted, an attack on Mount Rushmore, negatively portraying an upcoming event President Trump is planning ahead of Independence Day at the historic monument to four great American presidents.\n\n“Trump has disrespected Native communities time and again,” the Democrats wrote on Twitter, with a link to an article in the British newspaper the Guardian, in the now-deleted tweet. “He’s attempted to limit their voting rights and blocked critical pandemic relief. Now he’s holding a rally glorifying white supremacy at Mount Rushmore–a region once sacred to tribal communities.”\n\nThe linked story from the Guardian quotes Oglala Lakota tribe member Nick Tilsen, the president of local activist group “NDN Collective,” as calling Mount Rushmore a symbol of “white supremacy.”\n\n“Mount Rushmore is a symbol of white supremacy, of structural racism that’s still alive and well in society today,” Tilsen said, a message echoed by the Democrat Party’s formal Twitter account.\n\nThe Guardian piece goes on to note that Tilsen wants to see Mount Rushmore torn down altogether.\n\nThe push from the Democrats to target Mount Rushmore comes as leftist activists tear down monuments and statues around the country. But the move by the Democrat Party to put the iconic American mountainside monument to four great American presidents–George Washington, Thomas Jefferson, Theodore Roosevelt, and Abraham Lincoln–in the crosshairs by claiming it represents “white supremacy” when it clearly does not may go too far for some voters.\n\nSeveral on Twitter were quick to rip the Democrats for pushing attempts to destroy Mount Rushmore. \n\n#realnews #darktolight #wwg1wga🇺🇸 #sheepnomore #wwg1wgaworldwide #thegreatawakening #qmap #q #thesepeoplearesick #mindcontrol #thesepeoplearestupid #painiscoming #operationmockingbird #pedogate #redpill #spiritcooking #hisnamewassethrich #whatisq #declass #wearethenewsnow #obamagate",
    "tags": [
        "Qanon"
    ],
    "year": "6"
}