{
    "filename": "CCg8mPNlMSU.jpg",
    "description": "Let’s recap what we know. \n\nThe CDC themselves even say on their website, the PCR test is “not for use in diagnostic procedures”- meaning it’s not supposed to be used to DIAGNOSE WHETHER SOMEONE HAS COVID OR NOT. \n\ncdc.gov/Coronavirus/2019-ncov/php/testing.html\n\n•\n\nLabcorp admitting flawed tests: \n\nhttps://www.labcorp.com/tests/164068/sars-cov-2-antibodies:\n\n“This test has not been FDA cleared or approved. This test has been authorized by FDA under an Emergency Use Authorization (EUA)”.\n\n“Results from antibody testing should NOT be used as the sole basis to diagnose or exclude SARS-CoV-2 infection or to inform infection status. False positive results infrequently occur due to prior infection with other human Coronaviruses.”\n\n•\n\nUK test kits were found to be pre-contaminated with Coronavirus.\n\n•\n\n A paw paw fruit & a goat tested “positive for Covid” in Tanzania. \n\n•\n\n“PCR tests should never be used to diagnose infectious diseases” - from the creator of the PCR tests himself. \n\n•\n\nThe test kits are also generic, and don’t test specifically for “Covid19”- and there are 36 different strains of “Coronavirus”- aka the common flu. \n\n•\n \n80-83% of the tests were giving false positives. \n\n•\n\nThe tests don’t pass any of the 4 “Koch Postulates” that have been used since 1890 to identify & isolate what is  specifically causing various  illnesses/diseases etc. \n\n•\n\nWhen a cell is poisoned, it secrets what’s called “exosomes”. This poisoning can be from many different things (stress, fear, toxicity, EMF radiation, food etc). These exosomes warn other cells that there’s an imminent problem. \n\n•\n\nUnder the microscope at the levels of amplification used in the PCR tests, those exosomes (diseased cells) look *identical* to Covid19! \n\n•\n\nDr. Sebi echoed David Icke: he said a virus does not exist, but is rather “a manifestation caused by cell erosion”- this description sounds strikingly similar to an “exosome”.\n\n•\n\nSebi said that this manifestation of “cell erosion”( or an “exosome”) is caused by the mucus, and the mucus is caused by the foods that you eat- “the food they told us to eat”. \n\nCont’d👇🏽",
    "tags": [
        "Other"
    ],
    "year": "7"
}