{
    "filename": "CCmgPA4jvmG.jpg",
    "description": "Wow! Over 2000 new peeps in the last 72 hours🎉  thought it might be fun to share a little “Get to Know You post”:\n.\n🌟Oh hey! I’m Rachel Pekarek (pronounce: Peh-Car-Eck) 😘\n.\n1️⃣ I serve the Most High God YHWH and His Son Jesus. Not man. Not social media. Not a business and certainly not money. \n.\n2️⃣ I recently married (COVID elopement style) the most incredible man I affectionately call Ogre. He loves Christ. He pushes me. Supports me. Oh and he’s the hottest man on the planet. #IWin\n.\n3️⃣ I am a voracious reader and researcher. I nearly never watch TV, I hate most movies and despise Hollywood. Because of that - I would rather be watching a documentary, reading The Word if God or commentaries/Christian literature, pouring over blogs/videos and increasing my knowledge and understanding.\n.\n4️⃣ Ive endured 40 surgeries in my life from tonsils, to a complete colectomy at 15 years old due to an acute life-threatening form of #UlcerativeColitis\n.\n5️⃣ Ive been very blessed to build a 7-Figure business  in Network Marketing but believe in being #CONTRARIAN - for instance: My husband and I both drive 2011 SUVs. #WarOnDebt #TeamHeart💙\n.\n6️⃣ I am PRO LIFE. PRO GUN. PRO AMERICA. ANTI VAX. ANTI PHARMA. ANTI FAKE NEWS. I believe hugely in ADVOCACY and #Truth. In my spare time I love exposing the sickness involving the Elites / Cabal in this world. #Ephesians511 #RedpillingTheWorld\n.\n7️⃣ Travel is my love language. Culture. New foods. Experiences. Ahhhh!! I miss global adventures. \n.\n8️⃣ My favorite colors are: pink, leopard and glitter. #YAAAAAS \n.\n9️⃣ One of the greatest callings in my life is to make a difference in the realm of human (child, specifically) trafficking and caring for orphans. I’ve been advocating these causes aggressively since 2012. \n.\n🔟 Some of my happiness moments revolving around hosting people, and especially FEEDING THEM! 🍔🥩🍳🍝🍕🍰☕️ So satisfying!! \n.\n✨✨ Now Share Something about you ✨",
    "tags": [
        "Other"
    ],
    "year": "7"
}