{
    "filename": "CCMoa4_BzSH.jpg",
    "description": "A very interesting article was just published discussing the current understanding of chronic illness and raises some interesting ethical questions regarding treatment recommendations, specifically nutrition. 🌱⁣\n⁣\nThe article highlights some staggering statistics that display the burden that chronic diseases place on the healthcare system. Currently, more than 85% of US healthcare costs are due to chronic conditions and in 2020 157 million Americans are expected to live with at least one chronic condition! 😬⁣\n⁣\nAs I’ve discussed previously, nutrition plays a major role in the prevention, and in some cases, reversal of many of these diseases. In the article, the authors primarily discuss cardiovascular disease and diabetes, which account for the number 1 and number 7 killers in America, which is similar to what we see in Canada. 🇺🇸🇨🇦⁣\n⁣\nNon-insulin-dependant type 2 diabetes, specifically, can be reversed with a plant-based diet and no diet has produced as impressive of results for cardiovascular disease as we see with a plant-based diet. Given this information, the authors conclude that “not advocating for plant-based nutrition is unethical.” They describe it as withholding potentially life-saving information from those struggling with a variety of chronic conditions. 👨🏽‍⚕️⁣\n⁣\nWe cannot ensure that our patients will adopt this eating pattern, but they deserve to know it’s an option. Whether we follow our own advice or not is our prerogative, but our heart disease patients should know that a plant-based diet is the most effective means of improving their health, and if they decide a Mediterranean diet is more achievable, then it’s their decision. Too many doctors withhold this information on the basis of “it’s too difficult for patients to follow,” which removes our patients’ autonomy in the decision making process and is unacceptable. 🚫⁣\n⁣\nFood for thought. 🥬🍠🍎⁣\n⁣\nReference:⁣\n⁣\nStorz, MA. Will the plant-based movement redefine physicians’ understanding of chronic disease? The New Bioethics. 2020.⁣\n⁣\n📷: @sam_eats_plants",
    "tags": [
        "Other"
    ],
    "year": "7"
}