{
    "filename": "CCmsN-4Jdyu.jpg",
    "description": "🌾 𝘉𝘦𝘦 𝘢 𝘋𝘳𝘦𝘢𝘮𝘦𝘳 𝘎𝘪𝘧𝘵𝘢𝘸𝘢𝘺⁣\n⁣\nToday Olivia and I read this cute, inspiring book, and we want to send a set to 𝐘𝐎𝐔 ❤ ⁣\nI asked her what her dream would be and she said \"\"that everyone would have clean water\"\" we had thoughtful conversations about how she can bee a world changer 🐝 ⁣\n⁣\n𝘐 𝘸𝘰𝘶𝘭𝘥 𝘭𝘰𝘷𝘦 𝘵𝘰 𝘩𝘦𝘢𝘳 𝘺𝘰𝘶𝘳 𝘥𝘳𝘦𝘢𝘮𝘴!⁣\n⁣\n𝐓𝐨 𝐞𝐧𝐭𝐞𝐫:⁣\n• 𝐋𝐈𝐊𝐄, 𝐒𝐀𝐕𝐄 and 𝐂𝐎𝐌𝐌𝐄𝐍𝐓 your dream⁣\n• 𝐓𝐀𝐆 all the woke world changers!⁣\n• Make sure to 𝐅𝐎𝐋𝐋𝐎𝗪 ⁣\n@3littlelambshomestead⁣\n@bee.a.dreamer⁣\n⁣\nMine dream is that we would come together, common sense and common morality. 𝐊𝐍𝐎𝗪𝐈𝐍𝐆 𝐓𝐇𝐀𝐓 𝗪𝐄 𝐀𝐑𝐄 𝐀𝐋𝐋 𝐌𝐀𝐃𝐄 𝐈𝐍 𝐇𝐈𝐒 𝐈𝐌𝐀𝐆𝐄 𝐚𝐧𝐝 𝐁𝐄 𝐀 𝐕𝐎𝐈𝐂𝐄 𝐟𝐨𝐫 𝐀𝐋𝐋 𝐭𝐡𝐞 𝐂𝐇𝐈𝐋𝐃𝐑𝐄𝐍 being trafficked + abused every minute. Remember just because something is uncomfortable, doesn't make it conspiracy. Epstein island was once conspiracy....⁣\n⁣\n𝘚𝘰𝘮𝘦 𝘧𝘢𝘴𝘵 𝘧𝘢𝘤𝘵𝘴⁣\n• In 2018, over half (51.6%) of the criminal human trafficking cases active in the US were sex trafficking cases involving only children.⁣\n• The average age a teen enters the sex trade in the US is 12 to 14 years old. Many victims are runaway girls who were sexually abused as children.⁣\n• Globally, an estimated 71% of enslaved people are women and girls, while men and boys account for 29%.⁣\n• Human trafficking earns global profits of roughly $150 billion a year for traffickers, $99 billion of which comes from commercial sexual exploitation.⁣\n⁣\n𝐏𝐋𝐄𝐀𝐒𝐄 𝐃𝐎𝐍'𝐓 𝐒𝐓𝐀𝐘 𝐒𝐈𝐋𝐄𝐍𝐓 ⁣\nWe can ransack businesses + destroy cities over indignation for police brutality but there are crickets when it comes to the trafficking + enslaving of Woman and Children.⁣\n𝐊𝐄𝐄𝐏 𝐓𝐇𝐈𝐒 𝐎𝐍 𝐘𝐎𝐔𝐑 𝐇𝐄𝐀𝐑𝐓⁣\n⁣\n\"\"Give justice to the weak and the fatherless; maintain the right of the afflicted and the destitute. Rescue the weak and the needy; deliver them from the hand of the wicked.” ⁣\n⁣\n𝘎𝘰𝘥 𝘉𝘭𝘦𝘴𝘴, ❤ Ash⁣\n⁣\n#savethechildren⁣\n#speakup #beeadreamer",
    "tags": [
        "Other"
    ],
    "year": "7"
}