{
    "filename": "CCQDAIgFWAw.jpg",
    "description": "The family unit is the most important thing in this creation of a geocentric universe. The alpha Male, Omega Mother, and child are the true trinity.  At the end of the day, family should be your number one priority. Success is determined by how much time we spend with family. If one is making 10 million a year but always away from home and family traveling, they are not successful at all. Yes our cosmology is important knowing where you live and your purpose, but if you aren’t with family, it’s meaningless. If you are gay, trans, or any other identity, that’s okay, doesn’t make you less of a soul. Just means you have a lot of growing to do.\n\nRight now there is an all out attack on  dominate alpha males along with the family unit. Once the majority of alphas are taken out, the new world order can then be ushered in. The alphas protect the divine feminine, family unit and the “elite” child sacrificing pedo’s know this. This world needs sober alpha men with a grip on reality to restore the sovereignty and inalienable rights awarded by the Father and Mother (Creators). If you have a muzzle/mask - BURN IT. If you have access to mainstream news, deny it. If all you do is live in fear, drink alcohol, eat animals, and think you live on a spinning ball... it’s too late for you. Better luck in the next life.\n\nBoys if you haven’t asked your girl to spend the rest if your life with you, MAN UP and start making babies. Stop chasing pussy or cock and retain your colostrum. Stop waiting on someone to save you (QTards & fake upside down Christians) and help physically remove these tyrants from their govt positions. Be fruitful and multiply. If you can’t be “faithful” to one woman, that’s okay, it’s your natural biology. Get you multiple “wives” and start making 30 children. This world needs more dominant men and nurturing women, not immature gamma males with low testosterone and feminist women trying to be equal to men working 9-5. Truth is, females are far superior to males. \n#lgbqt #qanon #Q #quarantinelife #manup #dontwearamask #falseflags #fakevirus #5gtowers #makebabies #adopt #poligamy #monogamy #standtogether #stayathome #burnamask #transgender #flatearthmillionaire",
    "tags": [
        "Qanon",
        "5G"
    ],
    "year": "7"
}