{
    "filename": "CCRgck8nuS6.jpg",
    "description": "Before he was deemed a terrorist, “Osama bin Laden” went by the name Tim Osman (this is all public record, btw). Tim Osman was a huge part of a CIA operation in the 1980’s (involving “enemies” that we had in Russia and the Middle East). He, and several other “freedom fighters” were invited BY THE U.S. Government to execute a secret mission overseas. The government trained them on weapons, military, other operations that could affect the ones that they were intended to serve as assets to, and allegedly agreed to help uplift their nations’ economies in exchange for these secret services.\n\nThe “freedom fighters” were also referred to as bin Laden. In a nutshell, from working in the CIA, the “freedom fighters”, who had reportedly been to the White House, the twin towers, the pentagon, and other government buildings and toured as apart of their training, noticed a lot of corruption in the system and began plotting to overturn it to fight for the freedom of the world as protection from the CIA and the United Nations, in which they believed were evil. Moreover, after years of working as assets for the CIA, they had saw little signs of the U.S. government staying true to their end of their deal (to help stimulate the respective economies of the nations from which the freedom fighters we’re hand picked).\n.\n.\n.\n.\n.\nFollow us for more content @the_dark_side_oftruth tag and share with your friends.follow our backup account @thedarksideoftruth \n#ConspiracyFiles #ConspiracyFiles2 #Reptilian #ShapeShifter #TheDarkWeb #DarkWeb #LetThatSinkIn #Sheeple #WakeUpSheeple #CorporationSlayer #Rothschild #UncleSam #UncleScam #Area51 #Illuminati #NewWorldOrder #UnexplainedVids #ConspiracyPic #ConspiracyJokes #ConspiracyFact #ConspiracyTheories #ConspiracyTheory #Conspiracy #ConspiracyFiles\n#hollyweirdisevil",
    "tags": [
        "New World Order"
    ],
    "year": "7"
}