{
    "filename": "CCrOoyJJRfo.jpg",
    "description": "SHARE THIS🚨 Urgent Information on Covid Vaccine - Dr. Carrie Madej\n❗️Vaccine Information on COVID-19, Nanotechnology, Smart phone health apps, rDNA, rRNA, patenting GMO. \n\nThe complete absence of 'COVID-19' from Vietnam -a densely-populated country of 98 million, and bordering China, is the 'smoking gun' that debunks this whole charade. If it’s really so 'infectious', surely everyone in the whole world would've been exposed by  now, so what are we doing locked up? If the germ theory were true, there'd be no-one left alive to believe in it.\"\" No vaccine has ever been shown to be safe, quite the opposite, nor has any ever 'eradicated' or produced any verifiable immunity against any disease; simply put, there's no evidence demonstrating the purported efficacy of any vaccine, only their apparent dangers. \nAll of this makes perfect sense when their toxic ingredients are considered, and the fact that 'germs' do not even cause disease, thus rendering the very premise of vaccines absolutely futile. Whenever someone credits vaccination as modern medicine's gift to mankind that have effectively rid the world of numerous diseases, call them out on their lies, such accolades are not only undeserved but are dangerous nonsense.\n\nSped up video repost @awakening_sheep \nSlower version @exposing_the_truth2day \nFOLLOW 👉 @miri.p.swiss.truths \nFOLLOW 👉 @miri.p.swiss.truths 🔥🔥\nFOR MORE CONTENT AND TRUTH! 🔥🔥 #2ndwave #deepstate #globalreset #deepstateexposed #thenewnormal  #globalistagenda \n#shadowgovernment #trustinjesus #MRNA #agenda21 #agenda2030 #wakeupsheeple #wedonotconsent #predictiveprogramming #theworldisastage #microchip #mkultra #freemasons #markofthebeast #secretsocieties #billandmelindagatesfoundation #governmentcorruption #pizzagateisreal #bigpharma #newworldorder #rockefellerfoundation #id2020 #event201 #transhumanism #exposebillgates",
    "tags": [
        "Qanon",
        "Bill Gates",
        "New World Order",
        "Deep State"
    ],
    "year": "7"
}