{
    "filename": "CCWed7GgYyJ.jpg",
    "description": "“Pedophilia is a natural sexual orientation”\nAnd people should “reflect and over come their negative feelings towards pedophiles”\n\nWHAT THE FUCK? \nAnd the spiritual community deems anger bad, and tells us not to judge \nIf this doesn’t make you angry and you can’t judge this as wrong there’s something wrong with you\n\nThis was the text shared in the post by Mackenzie Sullivan 👇\n\nFacebook and Twitter are trying to normalize pedophilia! 😡 So posts with doctors whistleblowing corrupt practices behind the covid testing, or posts about Bill Gates are deemed “harmful” to the public...but advertisements condoning child abuse are ok. They will not remove them. \n\nNAMBLA stands for North American Man Boy Love Association. The heart symbol is for “girl love.” The flag symbol sure looks identical to the Antifa flag. The triangle swirl and heart symbols were declassified by the FBI and you can find them everywhere, most notably on Disney toys and movies (Disney is a WHOLE other topic). Popes and priests wearing the boy love symbol should come as no surprise.  I’ll include pics in the comments.\n\nDid you know the dress the First Lady wore at the 4th of July celebration, the one the media was very quick to ridicule, was an Alexander McQueen dress featuring the therapy artwork of child sex abuse survivors? And the “I Don’t Really Care, Do You?” Jacket she wore to visit kids at an immigrant detention center was another reference to child trafficking?\n\nDo you remember when the president kept saying we were fighting a “hidden scourge” during the task force pressers? Google that phrase. \n\nThe WHO now recommends to teach children ages 0-4 HOW to masterbate. Now I’m not ignorant about normal behaviors, but isn’t that a bit bordering sexualizing/exploiting young children? 800,000 children go missing every year in the US. \n\n#pizzagateisreal #pedogate #adrenochrome #epsteindidntkillhimself #spiritcooking #savethechildren #hollyweirdisevil #pizzagate #qanon #wwg1wga #SatanicRitualAbuse #thegreatawakening #thestorm #darktolight #digitalsoldiers #covfefe #pedowood #redpill #nothingcanstopwhatiscoming #draintheswamp #hollywood",
    "tags": [
        "Qanon"
    ],
    "year": "7"
}