{
    "filename": "CCwskW_FNt3.jpg",
    "description": "Reposted from @killuminati3  FOR THOSE THAT DONT BELIEVE HE SAID THIS, HERES THE TRANSCRIPT TO THE INTERVIEW👇🏼👇🏼 INSTAGRAM IS BLOCKING ME FROM DM'ing IT TO PEOPLE!\n#andrenochrome #censorship\n.\n“The revelations that are coming out of Hollywood now, I’m telling you, they are just the tip of the iceberg,” Keanu Reeves said in Milan, Italy, where he unveiled three motorbikes that he designed for a company that he co-founded in 2007.\n.\nExplaining that he is “building to a future” where he is “free from Hollywood’s shackles“, the John Wick star spoke with revulsion about “the place of the child in Hollywood“.\n.\n“Children are revered, they are put on pedestals, but they are also tortured, raped, murdered, and consumed in various ways. They are currency. And I’m sad to say this practice seems to be becoming more and more open in those circles in recent years.“\n.\nKeanu Reeves, whose younger sister suffered from leukemia, finds it “inconceivable” that anybody could “be so selfish as to destroy a young person’s life for your own personal pleasure.”\n.\n“But that is the sort of person running Hollywood,” said Reeves, who donated 70% of his earnings from the Matrix trilogy to hospitals treating children with cancer. “These people are sociopaths, pure and simple.”\n.\n“They see it as the ultimate high. They say it gives them life. The more the child suffered, the more fear and hormonal adrenaline it had in its system at the time of death, the stronger the effect on the people who consume that blood. They live for this stuff.“\n.\nAccording to Reeves, the number of Hollywood elites who engage in the ritual abuse of children and the practice of drinking their blood is not insignificant.\n.\n“Some of these guys carry around bottles of blood. They call it ‘red wine.’ But they don’t hide it.“\n.\n“From what I understand there is a supply chain that delivers young children on the regular. I’ve heard them refer to times of famine, times of feast.“\n.\n#panic #amazongate #wayfair #wayfairgate #childsextrafficking #pedogate #pizzagate #pizzagateisreal #endhumantrafficking #prayforthechildren #darktolight #ritualabuse #andrenochrome #jeffreyepstein #stlittlejames #epstein #epsteinflightlogs #l",
    "tags": [
        "Qanon"
    ],
    "year": "7"
}