{
    "filename": "CCZh0G2n1AG.jpg",
    "description": "#Repost @artwork.by.god.111 with @make_repost\n・・・\nSISTER BEVELYN & HER FRIENDS WERE ARRESTED TODAY FOR REFUSING TO WEAR A MASK IN PUBLIC. THIS IS WHERE WE'RE HEADING CHURCH. WE ARE TARGET ENEMY #1 TO SATAN & THE WORLD HE CONTROLS. WHAT WILL YOU ACTUALLY SUFFER WHEN THE TIRE MEETS THE ROAD? BETTER FIGURE IT OUT REAL QUICK. NO TIME FOR WISHY WASHY CHRISTIAN'S. YOU BOW TO THIS YOU'LL BOW TO IT ALL EVENTUALLY. CLING TO JESUS AS TIGHTLY AS POSSIBLE. WE WILL FACE NO WORSE THAN JESUS HIMSELF DID. HE SAYS THROUGH HIM WE CAN DO ALL THINGS. FAITH IS A CHOICE. GOD BLESS US ALL.\n\n@bevelynbeatty\n\n✝️✝️✝️\n1 John 4:1-6\n1 Dear friends, do not believe every spirit, but test the spirits to see whether they are from God, because many false prophets have gone out into the world.  2 This is how you can recognize the Spirit of God: Every spirit that acknowledges that Jesus Christ has come in the flesh is from God, 3 but every spirit that does not acknowledge Jesus is not from God. This is the spirit of the antichrist, which you have heard is coming and even now is already in the world. 4 You, dear children,  are from God and have overcome them,  because the one who is in you is greater than the one who is in the world. 5 They are from the world and therefore speak from the viewpoint of the world, and the world listens to them.  6 We are from God, and whoever knows God listens to us; but whoever is not from God does not listen to us. This is how we recognize the Spirit of truth and the spirit of falsehood.\n.\n.\n🕊️🕊️🕊️\n.\n.\n#idonotconsent\n#wedonotconsent #freedomisgone #satanhatesyou #christian #dieforjesus #willyoudieforjesus #fightthesystem\n@realdonaldtrump \n@realcandaceowens \n@terrencekwilliams \n@donaldjtrumpjr \n@ginaguywarren \n@dbongino \n@jessewatters \n@tuckercarlsontonight \n@turningpointusa \n\n#PastorBrianWARren\n#MrUnbreakable\n@mrunbreakable22 \n@mrunbreakable22forjesus",
    "tags": [
        "Other"
    ],
    "year": "7"
}