{
    "filename": "CD98CuelijT.jpg",
    "description": "The current death rate for the CV scamdemic according to the Gates of Hell funded WHO is at 0.6%, & that’s WITH all the manipulated death certificates, the false positives, the over-counting of cases, the counting of cases for those never even tested, and the extremely scientifically flawed testing. \n\nFor perspective, according to the CDC, a total of 1.5 million people died from Tuberculosis in 2018 (including 251,000 people with HIV). Worldwide, TB is one of the top 10 causes of death and the leading cause from a single infectious agent (above HIV/AIDS). Tuberculosis kills more people than any other infectious disease, according to information shared by the United Nations. \nOver 4,000 people die of tuberculosis every day according to the WHO as well. \n\nIn 2018, an estimated 10 million people fell ill with tuberculosis(TB) worldwide- meaning TB had a 15 PERCENT DEATH RATE in 2018.\n\nYet we saw no declared health emergency, no lockdowns, no health orders to shelter in place, social distance or wear a mask into stores. \n\n•\n\nIn addition to the PCR tests being scientifically meaningless....\n\n...CV test kits being found to be pre-contaminated with CV....\n\n....the tests don’t pass any of the 4 “Koch Postulates”...\n\n...they are known to give up to 80% false positives...\n\n...a paw paw fruit, a tiger, a goat, a cat & now WATER testing positive...\n\n...death certificates being manipulated to show CV as cause of death when it was not...\n\n...”new cases” based on fraudulent & flawed testing & fraudulent & flawed science...\n\n...”tests” being counted as “cases”...\n\n...”probable cases” being counted as “cases” simply because someone had a symptom of the common cold/flu...\n\n...in addition to all these factors that the pharma controlled media pumps out daily to increase the fear & lockdowns, now people are being counted as “cases” despite never being tested.\nHundreds of people across the United States have been complaining that they are receiving calls from clinics and medical offices claiming that they have confirmed positive for C0VlD, but those people say they were NEVER EVEN TESTED.\n\nCommunist China is the new world odor template coming to a city near you...\n\nCont’d👇🏽",
    "tags": [
        "Other"
    ],
    "year": "8"
}