{
    "filename": "CD_aTB1ncIG.jpg",
    "description": "DAIRY CAUSES INFLAMMATION.... RIGHT?⁣\n....⁣\nWELL... NO, THATS NOT ACCURATE ⁣\n⁣\nFollow @antidiet_dietitian 💜⁣\n⁣\nNowaydays we hear about \"\"Anti-inflammatory diets\"\" & so many people blaming and putting milk/dairy in the pro inflammatory category... ⁣\n⁣\nFor many, milk comes to mind as something to eliminate but HOLD it THERE! ⁣\n⁣\nIt has been proven over and over, that milk has actually anti inflammatory effects on health markers, and there is still so much emerging evidence coming our way!!!\n⁣\nWhy would you want to eliminate an anti-inflammatory food ?\n⁣\n In various systematic reviews & meta analysis dairy has been shown to have NO SIGNIFICANT EFFECT ON INFLAMMATORY MARKERS in the body and has actually been found to have a significant anti-inflammatory effect in certain populations!⁣\n⁣\nObviously If you suffer from milk allergy, then milk is not an option for you ⁣\n⁣\nSo why is it that people want to eliminate dairy? ⁣\n⁣\nIt seems to get a bad reputation due to its saturated fat content.  And we all know saturated  fat has been linked to potentially cause inflammation (however this topic is also under review) ⁣\n⁣\nWhen you read through systematic  reviews though, all dairy products including full fat versions of dairy have very similar anti-inflammatory effects.⁣\n⁣\nThese results could be due to a variety of reasons.  Some studies have reported the existence of over 400 different types of fat in milk with varying fatty acid chain lengths & saturation levels which may likely result in different effects on inflammatory markers.⁣\n⁣\nAlso, if you think about it...there are plenty of fermented dairy products (I .e. greek yogurt) that promote serve as probiotics & promote healthy gut bacteria, so this has an effect on ⬇️total inflammation in the body⁣\n⁣\nPeople buy into these MARKETING STRATEGIES on “REDUCING INFLAMMATION IS KEY\"\"⁣\n... However,  inflammation is not necessarily a bad thing (only when we refer to chronic inflammation). This is a natural body process to help with healing.. so some inflammation is a good sign.⁣\n⁣\nMost healthy people arent living their lives in an inflamed status \nSTOP FEARING DAIRY OR MILK\n\nSHARE🙏💜",
    "tags": [
        "Other"
    ],
    "year": "8"
}