{
    "filename": "CD_j_qMg1mI.jpg",
    "description": "If you see something, say something.\n\nBut don’t be afraid to be disliked because not everyone is going to agree with you. 🤷🏻‍♀️\n\nAs a breast cancer patient that has been putting themselves out there for the last two years, I am no stranger to people disagreeing or disliking me.\n\nBut ☝🏻 I am very passionate about the Triple Negative Breast Cancer Community I serve.  We are scared + we are vulnerable.  We also have limited treatment options, so you could imagine how important our hashtags are to the members in our community.\n\nI’ve watched for months the food fear mongering + exploitation of cancer hashtags for exposure in the TNBC Community.  I kept silent but stayed aware.\n\nI even got tagged in said mongering posts. 📝\n\nI sent a private message to inform this person of the hurt they were doing, I assumed they would apologize not knowing they were causing harm. \n\nInstead I was met by disregard. 🖐🏻\n\nI reiterated that the TNBC hashtag shouldn’t be in a post about someone’s vacation.  Especially when there was no mention of TNBC.  That got met with anger + then a block. ❌\n\nI received many messages of gratitude for speaking up, but there were two that stood out to me the most: 👇🏻\n\n1️⃣ One person told me that this page gave them such anxiety that their therapist had to intervene in reference to food fear mongering.\n\n2️⃣ Another person told me that they have been so triggered that they were about to find a therapist to help with their fear of food after cancer.\n\nI also received 3 DMs of disapproval for going after someone PREYING on my community.  That’s okay, I was waiting for them.\n\nThose of us without a genetic mutation will question + quite honestly, beat ourselves up thinking what we did wrong to deserve this. 💔\n\nThe TNBC Community has enough fear in it, we don’t need to add food to the roster. #foodfearmongering #supportusdonttargetus",
    "tags": [
        "Other"
    ],
    "year": "8"
}