{
    "filename": "CDb85coFuyV.jpg",
    "description": "The PCR tests they're doing don't test for viruses, they test for RNA and DNA which is easy to prove as they are the basis of all viruses so anyone who's had the flu or the flu shot in recent years is likely going to test positive according to the CDC. But that's not all, fruits, goats, swabs of alcohol and wastewater are amongst dozens of items that all tested positive for coronavirus.\n\nAlso, the CDC and other health agencies worldwide have had to come out and admit that untold thousands of PCR test sent to numerous countries were pre-contaminated with the coronavirus. But wait, there's more! One of the WHO's publicly posted primer sequences in the PCR test for SARS-CoV-2 is found in all human DNA, “CTCCCTTTGTTGTGTTGT”, which means that by default these tests are biased to test positive in any person they choose because they are all rigged.\n\nSo the ultimate questions are, why are fake tests needed for a real virus and why is anyone allowing themselves to be enslaved by science proven to be fake? \n\nA few scientific facts we've been lied to about: Viruses are NOT transmissible from one person to the next, viruses are NOT contagious and germ theory is junk science with every test ever performed on it proving it to be 100% false. The only real way to ''catch'' a virus is through an injection directly into your bloodstream!! (Fact!)\n\nI know that sounds incredulous and I know I'm not going to convince anyone in a few sentences over a lifetime of indoctrination. So everything you need to know to get started is laid out in this channel's highlights so you can learn for yourself and become free from the ignorance that is enslaving all of us. That is, if you want to be free. \n\nThe Spanish Flu /Polio videos are a good place to start as well as this hashtag #virusesareNOTcontagious \n\nPlease dig into the highlights and other channels cited in the captions, follow the hashtags and take my word for nothing, research everything for yourself then pay it forward. The truth will literally set us all free from tyranny but it starts with setting yourself free first.\n\n#fauciliedpeopledied #firefauci #fauciisafraud\n#pharmafauci #billgatesisevil #fuckBillGates #AZT #pcrtest #swabtest",
    "tags": [
        "Bill Gates"
    ],
    "year": "8"
}