{
    "filename": "CDd3Az4jGm_.jpg",
    "description": "#🕊\n,,Wir sind nur so stark, wie wir vereint sind und so schwach, wie wir getrennt sind.“\n•\nAnstelle uns auf unsere Gemeinsamkeiten zu besinnen, verlieren wir uns in diesen Tagen in unseren Unterschieden. \nJeder will auf einer Seite stehen. Auf der anderen natürlich. \nUnd jeder denkt im Recht zu sein und empört sich darüber, dass der andere es nicht ,checkt‘. \nWas wäre wenn ....\nwir uns darauf einigen könnten, dass jeder recht hat. Denn so ist es im Grunde auch. \nWir leben vielleicht alle unter einem Himmel, doch ein jeder bringt sein eigenes Universum mit. Und darin hat er selbstverständlich recht. Denn es ist seine ganz eigene Welt. \n•\nIch kenne viele Menschen die anderer Meinung sind als ich. Erst dieses Wochenende hatte ich Besuch von einer Freundin, die ganz selbstverständlich ,Mund-Nasen-Bedeckung‘ trägt, während ich seit Monaten Widerstand gegen diesen ,Maulkorb‘ leiste. \nLong story short: Wir hatte eine fantastische Zeit, tiefe und schöne Gespräche. Warum? Weil wir uns die Mühe machen, tiefer zu graben. Und jeder der tiefer gräbt, findet früher oder später eine Schnittstelle. Selbst wenn dies nicht möglich wäre, dann gibt es immer noch eine nicht zu leugnende Gemeinsamkeit, nämlich diese, dass wir einer #menschheitsfamilie angehören.\n•\nDie Geburt der neuen Welt und der neuen Zeit geht nur GEMEINSAM. Wie stark die Wehen sind, liegt an UNS. \n__________________________________\n\n@ all:\nVielleicht helfen die wunderbaren Zeilen von Theodor Fontane, wenn uns das nächste Mal der Unmut über das Verhalten anderer Menschen packt>>>\n\nErscheint dir etwas unerhört, \nbist du tiefsten Herzens empört, \nbäume nicht auf, versuch's nicht mit Streit, berühr es nicht, überlass es der Zeit.\nAm ersten Tag wirst du feige dich schelten, \nam zweiten lässt du dein Schweigen schon gelten, \nam dritten hast du's überwunden; \nalles ist wichtig nur auf Stunden, \nÄrger ist Zehrer und Lebensvergifter, \nZeit ist Balsam und Friedensstifter.\n\n  𝗨̈𝗯𝗲𝗿𝗹𝗮𝘀𝘀 𝗲𝘀 𝗱𝗲𝗿 𝗭𝗲𝗶𝘁!",
    "tags": [
        "Other"
    ],
    "year": "8"
}