{
    "filename": "CDFMy0PnaSj.jpg",
    "description": "5. Cóᴍᴏ ʀᴇᴄᴏɴᴏᴄᴇʀ ᴀ ᴜɴ ʀᴇᴘᴛɪʟɪᴀɴᴏ?\n. \nEn 2013, se llevó a cabo una encuesta a gran escala en los Estados Unidos sobre varias teorías de conspiración.\n. \n Encontró que 12,5 millones de estadounidenses creen que el gobierno de EE.UU. está dirigido por reptiles. Sin embargo, esta no es una cifra muy grande.\n. \nSegún la misma encuesta, 44 millones de ciudadanos estadounidenses creen en la existencia de Snowman, y 116 millones de ellos creen que el calentamiento global es un engaño inventado por el gobierno. En este contexto, 12 millones es bastante.\n. \nPero esos 12,5 millones no dijeron lo principal: ¿cómo calcular los reptiles en el gobierno? Este es un método probado que te ayudará a entenderlo. \n. \nOjos azules, verdes o marrones. Algunos de ellos pueden cambiar el color de los ojos, que también traiciona a los invasores alienígenas;\nCabello rojo o rojo;\nVisión aguda y/o audición;\nHay una fascinación por la ciencia y el espacio;\n. \nBaja presión y cicatrices extrañas e inusuales en la piel;\nFalta de creatividad, no tienen la capacidad de expresar amor o empatía por otras personas. En general, están preocupados por el desarrollo de la humanidad y están interesados en su futuro.\n\n6. Reptiles más famosos\n\nSerá muy interesante saber cuál de las estrellas modernas es un extraterrestre de Nibiru. Según David Icke, resulta que las familias de los ricos influyentes, los Rockefeller y los Rothschild, son en realidad reptiles. Lo mismo puede decirse de la dinastía imperial Romanov. Muchos presidentes estadounidenses, incluyendo a Bill Clinton, la familia Bush y Barack Obama, también son reptiles.\n\nLa verdad, no se que pensar de eso, todos somos un poco raros aveces. Podemos a salir mal o raro en los videos.. Comportarnos raro según otros.. \n\nTu crees que  reptilianos pueden estar entre nosotros? Que unas parsons famosas, como políticos, son reptilianos? Comenta! \n\n#reptilianos #reptiles #davidicke #nibiru #reptilianosfamosos #oculto #selfie #smile #sonrie #amazing #sexy",
    "tags": [
        "Other"
    ],
    "year": "7"
}