{
    "filename": "CDP7Zx3B1ep.jpg",
    "description": "The #mainstreammedia has been ramping up their reporting on the “third wave” of the #coronavirus scamdemic. It sure looks like another #lockdown is coming and the economic destruction of the #UnitedStates will be complete.\n\nAs anxieties about a global “second” (or, in #HongKong’s case, “third”) wave intensify, health authorities in #China have just reported the biggest daily jump in new #COVID19 cases on the mainland in three and a half months on Wednesday when 101 new coronavirus cases were reported by the health commission, reported ZeroHedge. \n\nThis is all by design. None of this is by accident. The economy will crash and the dollar will be worthless as they usher in the one digital dollar that will be controlled and monitored by the central bank.\n\nThe IDF has begun preparations for a “third wave” of the coronavirus, which it predicts will reach its peak in October and continue throughout the winter. The Israeli news site Walla reported that the IDF believed the current second wave of the virus had topped out, and the time to get ready for the next wave was now, according to Algemeiner. \n\nIn particular, it was thought the winter weather could lead to the worst outbreak yet. The IDF chief of staff has ordered the purchase of enough flu vaccines to vaccinate all soldiers before winter, thus removing a possible complication due to the ease of confusing the symptoms of the two diseases. “Winter” has been an important time frame to the elitists.\n\nSo far, most of the news reports on the “third wave” are coming from outlets overseas. But remember, this is how the second wave nonsense started. If the mainstream media in the U.S. thinks they will be able to use this fear-mongering “news” to further control the public and convince them to participate in the beast/vaccine system, they will for certain, being reporting on the third wave frequently.\n\nThis seems like one long nightmare that’s hard to wake up from. #Event201 #CoViD1984",
    "tags": [
        "Bill Gates"
    ],
    "year": "7"
}