{
    "filename": "CDrjQWonUDY.jpg",
    "description": "What’s the big deal??? It’s just a small piece of fabric. Why are so many people complaining?! 🤔🌟\n\nYou’re not losing your freedoms or anything.\n\nIt’s for your protection. It’s totally your choice if you want to comply or not, but if you don’t you will get cited with a misdemeanor. So what.\n\nOh, you’re sick of staying at home? You’ve binge watched all your favorite Netflix shows and now you’re out of quarantine snacks? You only bought enough for 2 WEEKS?!? 🤣🤣🤣 \nYeah. This is gonna last way longer than that....\n\nWe’re just telling you what time of day you can be outside, or when/if you’re allowed to leave your home at all or not 🧐 You’re not on house arrest. We just keep telling you over and over to stay home. \nWhat? You don’t like your house? That’s your fault.... stay inside it anyway.\n\nIt’s not like you need to stand in line for 4 hours to get your rations of groceries or anything. 😒 Who needs water and toilet paper anyway??? Or flour, sugar, hand soap, sanitizer, meat, medications or anything else for that matter. What, 2 isn’t enough for you? Well, you should have already been stocked up! Can’t afford it? That’s your fault. 🤷🏻‍♀️\n\nWe’re only telling you how many people you’re allowed to gather with at one time or not. Because you can’t use your own best judgment to protect your own family or anything. Idiot. We know what’s best. You elected us. Trust us. 😷\n\nWe always tell the truth. ☝🏼 And we always have your best interest in mind, and our bank accounts reflect that. Don’t you watch the News?\n\nWe’re the only ones who know which businesses, products, and careers are actually “essential” for you in your life, and which you can simply live without 🤪 Obviously.\n\nIt’s a choice.\n\n***continued in comments***",
    "tags": [
        "Other"
    ],
    "year": "8"
}