{
    "filename": "CDStQwIped-.jpg",
    "description": "We had the opportunity to #getloud today, and boy did we ever. I packed up my girls this morning and we headed downtown for a #endhumantrafficking rally. \nAs happy as I was to see people gathered out front of city hall this afternoon for this great cause. The support from people driving by was amazing, it was encouraging to see that people want change. I was equally angered by the fact that there was no media @globalcalgary @ctv_calgary (who had been informed about the rally happening), mayor @nenshi was not there, and @jkenney was not there either. They knew it was happening and choose to not attend. To me there is not greater fight we should be fighting at this moment. Our children are 67000 times more likely to be trafficked than get covid. Tell me that’s not news worthy?\n•\n•\nI had never been to a rally. I have never felt strongly enough about something to attend.  But I can not and will not stand by and quietly let this continue. \n•\n• \n I chose to take my children down with me today. I explained why we were going. But like many I don’t think they fully understood. So as my sweet daughter was standing holding up this sign I looked over and saw her crying. As I hugged my babe she said\n “mom, does this really happen?” \nYes, yes it does. It happens in our city, our province our country and all over the world. EVERY SINGLE DAY. \n•\n•\nI will hold my babies closer, and protect them from this evil. I will also not be silenced, I will continue to be loud about it. It is uncomfortable to talk about, you don’t want to believe it happens. It does and we have to fight to #savethechildren \n@ourrescue is doing amazing things to help rescue these children from slavery. Please support them. Even if that is through just clicking on their link and reading and watching and becoming more informed. This is real and needs more attention. \n•\n•\nI was honoured to join in the @high.fitness live class tonight to raise funds for @ourrescue. I love that #highfitness has got involved, we’re a loud group of instructors and hope we have helped make a difference on this #endhumantrafficingday \n\n#pizzagate #andrenochrome #childsextrafficking #yyc #calgary #wakeup #standup #riseup",
    "tags": [
        "Qanon"
    ],
    "year": "7"
}