{
    "filename": "CDtXdfvAQ_n.jpg",
    "description": "AUSTRALIA. WE HAVE A PROBLEM... READ ON....\nIf most of us don't want to be forced to take a Covid-19 vaccine, and politicians like Victorian Premier, Dan Andrews are threatening that we MUST take it before things go back to 'normal then someone is going to lose. Either Dan loses or Australia does. Either the man who sold Victoria to China, without consulting the people of Australia and in fact in doing so went against the premiers of every other state of Australia with his private 'Belt and Road' deal-either he gets his way and holds Australians to ransom or something's gotta give. Because it's highly likely that whatever goes down in Victoria will soon be rolled out for the rest of Australia. The writing is on the wall from the last six-months of soft lockdown to hard lockdown to who knows what's next. So we are faced with a question. Either the government is representative of the people and respects their individual choice or it is beholden to foreign powers and will do whatever it takes to enforce the will of those foreign powers. Are those foreign powers an elite cabal of an illuminati 1% or simply the mighty force of communist China? We can only speculate. Or we can find and present the proof that\nAustralia is under control from hostile forces.\nBut what is sure for all Australians is our choices are slowly being stripped away. In Victoria we aren't allowed out of the house between 8pm and 5am. We can shop for essential food and supplies once a day. One person per household at a time. Children are banned from playgrounds. Elderly relatives are dying alone, hungry. If you live in any other state of Australia maybe you have a chance to avert a situation unthinkable to our forefathers who fought and died-for our freedoms.\nIs this what our grandparents died for? To be locked inside and soon, forced to be injected with a vaccine 79% of us don't want?\nPretty sure most of us know the answer to that question! \n#AUSTRALIASAYSNO #letstalkaboutit #shareeverything \nCredit @friendsoftruth",
    "tags": [
        "Other"
    ],
    "year": "8"
}