{
    "filename": "CECqjVmAnUp.jpg",
    "description": "I don’t know who needs to hear this but you are more than your degree.⁣\n⁣\nYou are more than just a stay at home mom ⁣\n⁣\nYou are more than just a homeschool mom⁣\n⁣\nYou are more than just a work from home mom ⁣\n⁣\nSomething that brought up so many feels for me the past few months was when people would ask if I was “still” a nurse practitioner. Like maybe that goes away if I’m not in a white coat in an office? ⁣\n⁣\nIt honestly annoyed every time someone asked because I worked my ass off for that degree and the ability to write prescriptions and even though I don’t use it in the same capacity as what may be expected, doesn’t mean I no longer can. But regardless...⁣\n⁣\nThen I wondered why we feel as women so often that choosing against the grain, choosing to be at home, not being a “career” woman...why does that often have us feeling less than? Is it what society says we should be? Is it frowned upon in our social circles? Why do i feel so defensive?⁣\n⁣\nI run a million dollar business, I’m a six figure entrepreneur earner, and nothing about my life looks like I ever thought it would or should. And that’s ok. It’s great actually. And even if I didn’t have my nurse practitioner, I would still be enough. If i wasnt a work from home mom or not using my degree, it would be enough.⁣\n⁣\nI guess I’m letting you know today that those pieces of your life that nobody sees: they are worthy. You are worthy. You are deserving. No matter what society says. You teaching and raising your kids. It’s enough.⁣\n⁣\n𝑌𝑜𝑢 𝑎𝑟𝑒 𝑑𝑜𝑖𝑛𝑔 𝑎 𝑔𝑜𝑜𝑑, 𝑔𝑜𝑜𝑑 𝑗𝑜𝑏 𝑚𝑎𝑚𝑎.\n.\n.\n.\n.\n#youareenough \n#wellnessjourney\n#idahomom \n#positivityisthekey \n#womenempowermentquotes \n#femaleownedbusiness \n#younglivingbusiness \n#nursesofig \n#medicalfreedomactivist \n#femaleentrepreneurs",
    "tags": [
        "Other"
    ],
    "year": "8"
}