{
    "filename": "CEDYBLpnK0f.jpg",
    "description": "You know those topics. The ones everyone hides from. The ones that are easier to ignore. The ones that are hard to talk about. The ones that when you do talk about them you just know what’s going to come. Yea, I know those topics too. The ones I’m vocalizing now because I can’t sit back any longer and be scared of what others are going to say. It’s too important to stay quiet.\n.\nI asked in my stories how many were pro life vs pro choice. I understand this isn’t a black and white topic so for this post I’m only going to address my reason for asking. What was interesting is that some of the pro life voters also voted for vaccines. I was truly never aware of what was in vaccines until the last year or so. Have you ever asked to see an insert?\n.\nDid you know vaccines such as rubella, measles, rabies, poliomyelitis, hepatitis A, chickenpox and smallpox are produced using tissues from human abortions? Parts of the body these cells were obtained from are lung, skin, muscle, kidney, heart, thymus, thyroid, liver and small intestine. If you were unaware of this information then the statement on my shirt is more important than ever. America needs medical freedom.\n.\nIf an individual is pro-life I would believe it would go against personal ethics to then inject cells from an aborted baby? No? I’m asking questions. I’m simply sharing what I’ve learned that has made me take a step back and dig deep on what my beliefs are around all of this. I am so thankful for the many individuals that have used their voices to challenge me to dig deeper.\n.\nAmerica needs medical freedom because we aren’t one size fits all individuals. America needs medical freedom because allergies are a thing. America needs medical freedom because I know my body better than any doctor. America needs medical freedom because vaccines aren’t true placebo tested. America needs medical freedom because there is no science showing how this impacts our DNA. America needs medical freedom because I don’t consent to having an aborted baby’s cells injected into my body. America needs medical freedom because where there is a risk, there must always be a choice.\n.\nAccounts I’m thankful for that have challenged me 👇🏻",
    "tags": [
        "Other"
    ],
    "year": "8"
}