{
    "filename": "CEJ5caVnOLr.jpg",
    "description": "Watch this highly informative video by fellow physician Dr. Carrie Madej, explaining the 3 major components of the Moderna vaccine and the implications. This is a must view video. If this video doesn't open the eyes of those who don't get it, who I refer to affectionately as \"\"sheeple\"\", nothing will!\n\nI've previously brought up how if we allow the mandatory vaccination rhetoric to proceed, humans will no longer be human. And I've talked about Moderna and the implications of their RNA vaccine which has never been commercially produced before. But Dr. Madej does an outstanding job going into greater detail.  Watch this, and share it with everyone. \n\nBut Dr. Madej is wrong about one thing. She says it \"\"may\"\" cause genetic modification in our genome.  Remember, the function of RNA is to repair and re-write the DNA.  She's being overly generous with her words...it WILL cause a genetic change which will continue to re-write and \"\"repair\"\", ie, change our DNA. \n🔆\nIn addition, the PLANDemic full length movie came out yesterday. If you haven't watched it, watch it now on Bitchute or on London Real.\n🔆\nYou as the individual have the power.\nWe are the revolution 😈\n🔆\nStaying healthy in these times 👇\nMost important is keeping yourself active,healthy and natural food, Sunlight, meditation, daily grounding DO NOT STRESS 🤓\n(stress creates all sorts of problems and illnesses) breath deep💯\n🔆\nPOWERFUL NUTRITION 🏺🗿\n🔸Shilajit(85 +minerals and fulvic acid)\nhttp://bit.ly/PureHimalayanShilajit\n🔸Seamoss (contains 92 minerals of the 102 minerals that the human body consists of)\nhttp://bit.ly/Seamoss_BladderWrack \n🔸BladderWrack (BladderWrack adds the rest of the 102 minerals our body needs)\n🔸Chaga(Rich in Antioxdiants,Slows down aging,Protects DNA,Reduces Radiation)\n🔸Brahmi (mental health & clarity)(L-Dopa rich) \n🔸Lion's mane, Reishi and Cordyceps (Powerful For Mental Performance)\n🔸Nano Enhanced CBD oil (AntiStress & Relaxation)\n🔸Kanna (Energy) \n🔸Rhodiola rosea (Mental performance) \n🔸Ginseng (Energy) \n🔸Curcumin (Brain repair) \n🔸Resveratrol (Gene activator) \n🔆\nDont hesitate to reach out if you need a good source of shilajit, Seamoss\n@CsunShare 🔆\nRepost @drbuttar",
    "tags": [
        "Other"
    ],
    "year": "8"
}