{
    "filename": "CELlNUTJmcr.jpg",
    "description": "We wouldn’t be recovering our daughter the way we are today had we not allowed ourselves to question + challenge the status quo the “experts” tried to spoon feed us.\n\nTRUST THE EXPERTS is great advice, when the experts are UNBIASED + truly objectively reviewing information that is contrary to their conclusions.\n\nAlleged experts must be seeking the TRUTH, not just information that fits THEIR BIAS.\n\nSo the real question is who is watching the watchers? Humans are fallible, prone to corruption, prone to bias, prone to cognitive dissonance -- EXPERTS ARE MERE HUMANS. EXPERTS CAN FUDGE NUMBERS! Experts can be bribed, extorted, coerced, influenced to do the wrong thing popping out a bunch of false or contorted numbers and studies.\n\nWhy would we think experts are immune to the human condition? \n\nDo we listen to experts based on their field of expertise or on the evidence + data? If a contractor's homes he's building collapse within two years of building it, they are still a contractor and have expertise without anything to show for it. Should I throw out the data/outcome (the fact that the homes he builds fall apart)? Since I'm not a contractor can’t I question him if his expert opinion isn't demonstratively sound -- proven by the outcome of his houses?\n\nYou don't need to be an EXPERT in research to understand cognitive dissonance in it. You don't need a specific degree to know that some science has conflicts of interest. If a person's entire livelihood depends on global warming being true -- can't we raise eyebrows + fact check them even tho we aren’t climate scientists? \n\nI AGREE with one point of those who say ‘don’t do your own research’: Don't do research to confirm your own biases, but that is our sole common ground. To ask the general public to surrender critical thinking to trust corrupt people deemed superior is to uphold a position of AUTHORITY rather valuing the TRUTH.\n\nThere is a Holy Expert above all human experts. He sees the end from the beginning. He is the way the truth + the life. Do you know Him?\n\n#advocatelikeamother #believemothers #freedomkeeper #askquestions #awakening",
    "tags": [
        "Other"
    ],
    "year": "8"
}