{
    "filename": "CEoWia-nKem.jpg",
    "description": "STOP ✋🛑 COMPLYING WITH ANYONE WHO TRIES TO CONTROL YOUR REALITY (THOUGHTS, FEELINGS, IDEAS, WHAT TO EAT, HOW TO THINK, HOW TO ACT, WHAT IS \"\"LEGAL\"\" AND WHAT ISN'T. THESE ARE JUST RULES ANOTHER HUMAN HAVE MADE. WE ALL HAVE THE REAL DIVINE RULES WITHIN US AND YOU DO NOT NEED TO FOLLOW ANYONE BUT THEM IF YOU DONT FOLLOW YOUR OWN RULES THEN YOUR BODY, MIND AND SOUL ARE MOST LIKELY INFECTED BY EVIL AKA LIVE BACKWARDS (LIVING BACKWARDS)\n🔆\nITS TIME FOR YOU TO MAKE YOUR OWN RULES! YOUR OWN TRUTH , YOUR OWN PATH, YOUR OWN REALITY😎\n🔆\nThe spiritual journey is INDIVIDUAL, highly PERSONAL, it can't be organized or regulated. it isn't true that everyone should follow one path. LISTEN to your OWN Truth.\n🔆\nYou as the individual have the power.\nWe are the revolution 😈\n🔆\nStaying healthy in these times 👇\nMost important is keeping yourself active,healthy and natural food, Sunlight, meditation, daily grounding DO NOT STRESS 🤓\n(stress creates all sorts of problems and illnesses) breath deep💯\n🔆\nPOWERFUL NUTRITION 🏺🗿\n🔸Shilajit(85 +minerals and fulvic acid)\nhttp://bit.ly/PureHimalayanShilajit \n🔸Seamoss (contains 92 minerals of the 102 minerals that the human body consists of)\n🔸BladderWrack (BladderWrack adds the rest of the 102 minerals our body needs)\nhttp://bit.ly/Seamoss_BladderWrack \n🔸Chaga(Rich in Antioxdiants,Slows down aging,Protects DNA,Reduces Radiation)\nhttp://bit.ly/Chaga-Primal-Herb\n🔸Brahmi (mental health & clarity)(L-Dopa rich) \n🔸Lion's mane (Mental Performance)\n🔸Nano Enhanced CBD oil (AntiStress & Relaxation)\n🔸Kanna (Energy) \n🔸Rhodiola rosea (Mental performance) \n🔸Ginseng (Energy) \n🔸Curcumin (Brain repair) \nhttps://bit.ly/Curcumin-300G \nUse Coupon code \"\"CSunShare\"\" for 10%\n🔸Resveratrol (Gene activator ) \n🔆\nDont hesitate to reach out if you need a good source of shilajit, Seamoss,  Or anyone else mentioned above🔆 STAY HEALTHY‼️\n🔆\nDm me for information on how you can protect yourself from 5G Radiation\n🔆\n#SunThought\n@CSunShare",
    "tags": [
        "Other"
    ],
    "year": "9"
}