{
    "filename": "CEuTE7nHqsC.jpg",
    "description": "Check in: How is everyone feeling? How are you processing this worldwide situation, your individual situation/process in this moment, and the situation/state of mind of those around you? \n.\n.\n.\nAt the moment, we are all processing a lot. It is like we are being pressed into a funnel, stretched and squeezed if you will. What is happening is a massive shift in consciousness, a vibrational, seismic shift across the entire globe, within humanity, and within the Earth herself. As the Earth shifts, we shift, but shifting is not always fun.\n.\n.\nShift happens...\n.\n.\nSometimes we think awakening our consciousness and rising to higher dimensions will be all rosy and sweet, but oftentimes it feels like the world is ending and we will never feel “normal” again. It can feel very painful and confusing. I hate to break it to you, but nothing is going “back to normal”. That was the past. And the structures of the past no longer work. They were out of harmony with the Earth and with human life. We are looking to a new future, a future that is almost unrecognizable from the old one, but we are not going into this artificial, controlled “new normal” either. We are rising to the ✨ New Earth ✨ paradigm, a paradigm of love, of sisterhood and brotherhood, of oneness with Nature, higher consciousness, a higher dimensional reality. But in order to get there, that which has been hidden, that which has been in the shadows must reveal itself. In this revealing, it can feel VERY DARK. In the coming months, it might feel this way. It might feel like it is “getting worse”. If you have experience with healing, we know oftentimes it feels like it gets worse before it gets better. It comes to a head of sorts. \nObserve this, but don’t get caught up in it. \n.\nThis is never the end. \nIt’s always darkest before the dawn.\n.\n.\nWe will get through this, and you will be amazed at the blessings that will come. ✨\n.\n.\nLove,\nLena ✨🌹✨\n.\n.\n.\n.\n.\n#newEarth #5D #starseed #awakening #lightworker #gridworker #Gaia #motherEarth #Healing #consciousness #shift #truther #lightcodes #wisdom #gratitude #harmony",
    "tags": [
        "Other"
    ],
    "year": "9"
}