{
    "filename": "CEXprxCnzJL.jpg",
    "description": "Perhaps the most expansive of conspiracy theories concern the New World Order,” alleging that global affairs are controlled behind the scenes by a group of international elites manipulating entire governments, and controlling financial institutions, industry, and media organizations worldwide.  Variations of New World Order theories feature such alleged conspirators as international bankers, Jews, Freemasons, and the Illuminati.  The Bavarian Illuminati formed in 1776 with the purpose of infiltrating religious views and political control in their society.\n^^\nAs we can Clearly see this is happening globally, which is why we as a people need to take action towards our own plans for the future a sustainable future where we work together for the betterment of humanity and not greed which is the controlling force today. but don't you blame yourself if you might feel abit greedy cause we all have been victims of programming from early childhood so its not our faut but what is our fault is if we continue to allow this shit fest to expand. WE MUST UNITE NOW. \n^^\n#SunThought 🔆\nYou as the individual have the power.\nWe are the revolution 😈\n🔆\nStaying healthy in these times 👇\nMost important is keeping yourself active,healthy and natural food, Sunlight, meditation, daily grounding DO NOT STRESS 🤓\n(stress creates all sorts of problems and illnesses) breath deep💯\n🔆\nPOWERFUL NUTRITION 🏺🗿\n🔸Shilajit(85 +minerals and fulvic acid)\nhttp://bit.ly/PureHimalayanShilajit \nUse \"\"CSunShare\"\" to save 15 % on your order \n🔸Seamoss (contains 92 minerals of the 102 minerals that the human body consists of)\n🔸BladderWrack (BladderWrack adds the rest of the 102 minerals our body needs)\nhttp://bit.ly/Seamoss_BladderWrack \n🔸Chaga(Rich in Antioxdiants,Slows down aging,Protects DNA,Reduces Radiation)\nhttp://bit.ly/Chaga-Primal-Herb \n🔸Brahmi (mental health & clarity)(L-Dopa rich)\n🔸Lion's mane (Mental Performance)\n🔸Nano Enhanced CBD oil (AntiStress & Relaxation)\n🔸Rhodiola rosea (Mental performance) \n🔸Ginseng (Energy) \n🔸Curcumin (Brain repair) \nhttps://bit.ly/Curcumin-300G \nUse Coupon code \"\"CSunShare\"\" for 10% off \n🔸Resveratrol (Gene activator) \n🔆\n#SunThought 🔆\n@Csunshare",
    "tags": [
        "Other"
    ],
    "year": "8"
}