{
    "filename": "CFFo-ijlcgv.jpg",
    "description": "İĞNELİ FIÇI NEDİR?\n\nYahudilerin, kaçırdıkları Yahudi olmayan çocukların kanlarını almak için kullandıkları yöntemlerden biri. Fıçının içi iğnelerle kaplıdır. Çocuğu fıçının içine canlı canlı kapatan hahamlar, ardından fıçıyı dakikalarca yuvarlarlar. Daha sonra fıçının dibinde bulunan musluk açılır ve toplanan kan ayinlerde kullanılmak ya da Mayasız Bayramında yenilen mayasız ekmeklere karıştırılmak üzere alınırdı.\n\nYahudilikte, insan kanının ikinci bir kullanım yeri ise Pessah (mayasız) bayramları olmuştur. Pessah bayramında bir hafta boyunca mayasız ekmek yapılır ve yenir. Yahudilerin bazı kollarına göre, bu ekmeklerin en makbul olanları ise içine insan kanı katılanlardır. Bazı tarihçilerin bildirdiklerine göre, Pessah bayramları, Avrupa’da her yıl küçük çocukların kaybolduğu dehşet dönemleri olmuştur.\n\nKan içme konusunu şimdiye dek en iyi açıklamış kaynaklardan biri, 1803’te Moldavya’lı rahip Neophite’in yazdığı kitaptır. Bir hahamın oğlu olan Neophite, Yahudilikten çıktıktan sonra hristiyanlığı kabul edip rahip olmuştur. Babasının inancındaki bütün kanla ilgili ayinleri açıklamıştır. Bazı Yahudi tarikatlarının, insan kanı kullandıklarında Yehova katında daha “üstün” olduklarına inandıklarını anlatmıştır.\n\nİşte Yahudilerin bulundukları ülkelerden sürülmelerinin nedenlerinden birisi de bu sapık adettir. Özellikle İspanya’da, kan içme olayları defalarca gündeme gelmiş, bu olaylar halk arasında büyük huzursuzluk meydana getirmiştir. Sayısız çocuk kaybolmuş, cesetlerin bir kısmı tamamen kanı çekilmiş bir durumda bulunmuştur.\n\nOsmanlı İmparatorluğuna geldikten sonra da, Yahudilerin bazı kolları, bu sapık adetlerine devam ettiler.\n\nOsmanlı zabıtlarında bu konuda gelişmiş pek çok olay vardır. Bunların en önemlileri 1715’te Amasya’da, 1840’ta Şam’da ve Rodos’ta, 1633-1843 ve 1866’da İstanbul’da, 1863-1868 ve 1870’te İzmir’de kayda geçen olaylardır. Bu olaylarda pek çok Yahudi suçlu bulunmuş ve idam edilmiştir.\n\nYahudi tarihçi-yazar Avram Galante, “Histoire Des Juifs de Turquie” isimli kitabında bu konuda gelişmiş olan olayları uzun bir şekilde anlatmaktadır.\n\nDEVAMI YORUMDA 👇❌❌",
    "tags": [
        "Other"
    ],
    "year": "9"
}