{
    "filename": "CFNwZF-pTTV.jpg",
    "description": "Thoughts?\n\nIn an appearance with Bloomberg Tuesday, Bill Gates once again dismissed anyone who questions the motives of his global #coronavirus vaccination push as a ‘conspiracy theorist,’ calling them “so crazy”.\n\nHost Erik Schatzker stated that “The #conspiracytheorists who believe that you helped to create and spread the Corona virus might be easy to dismiss. If there weren’t so many of them,” before asking “has that notoriety become an impediment to your efforts or the foundation’s work yet?”\n\n“Well it’s so crazy to suggest the opposite which is you know we make vaccines and that has save millions of lives to somehow say that the vaccine in general is malign or that you know that the deaths are really taking place,” Gates stated.\n\n“It’s surprising to me how interesting that is. It spreads far more quickly than the truth,” he added.\n\nGates attempted to conflate questions over vaccines to those who refuse to wear masks in public, stating “The big concern is that if that means that the protection of others like wearing masks or a willingness of enough people to take the vaccine then it absolutely does make things worse.”\n\n“And the idea of how should these social media platforms try and avoid being the source. These sort of weirdly interesting falsehoods. That’s a debate or discussion we’re going to we’re going to have to continue to have,” Gates added.\n\nIt isn’t surprising however, that mistrust of Gates’ vaccines continues to spread, given accounts like a recent admission by the UN that a major international vaccine initiative is actually causing the outbreak of the very disease it was supposed to wipe-out.\n\nIn the same interview, Gates suggested that while it is ‘weird’ for people to mistrust his vaccines, Americans should not trust the FDA or the CDC, reasoning that they are linked to the President, and are politicising the virus.\n\nRead More: [https://summit.news/2020/09/16/video-bill-gates-pushes-global-vaccination-says-covid-conspiracy-theories-are-so-crazy/] #Event201 #GlobalHealthSecurityAgenda #VaccineAgenda\n\nRepost @freedom_faction",
    "tags": [
        "Bill Gates"
    ],
    "year": "9"
}