{
    "filename": "CFP6PpdltRM.jpg",
    "description": "#Repost @unitedpeoplesalliance\n・・・\nBelarusian President Claims IMF & World Bank Offered him a Bribe to Impose COVID Restrictions\n.\n.\n.\nBelarusian President Aleksandr Lukashenko said last month via Belarusian Telegraph Agency, BelTA., that World Bank and IMF offered him a bribe of $940 million USD in the form of “Covid Relief Aid.” In exchange for $940 million USD, the World Bank and IMF demanded that the President of Belarus:\n.\n• imposed “extreme lockdown on his people”\n• force them to wear face masks\n• impose very strict curfews\n• impose a police state\n• crash the economy\n.\nBelarus President Aleksandr Lukashenko REFUSED the offer and stated that he could not accept such an offer and would put his people above the needs of the IMF and World Bank.\n.\nBelarus has been one of the few nations in the northern hemisphere to resist introducing nation-wide quarantines and other large-scale restrictions in its battle with the new coronavirus, instead preferring a targeted response.\n\nBelarusian President Alexander Lukashenko has expressed concerns over how powerful nations and interests may try to use the coronavirus pandemic to reshape the world to their own advantage.\n\n“I once asked the question: is this pandemic, this coronavirus, a man-made phenomenon? I don’t know the answer yet, but I have my suspicions. Are politicians and others using this situation for their own purposes? You and I both know the answer to that question. You already see how it is used today…Doesn’t it seem to you that the powerful forces of the world would like to remake the world, without a ‘war’ \n.\n.\n.\n#nwo #newworldorder #belaruspresident #scamdemic #covert19 #certificateofvaccination #billgates #arrestbillgates #filmyourhospital #crimesagainsthumanity #agenda2030 #jewworldorder #zionistagenda #jewnation #wedonotconsent #markofthebeast #imf #who",
    "tags": [
        "Bill Gates",
        "New World Order"
    ],
    "year": "9"
}